{"0":{"date":"2019-12-05 20:01:29","tweet":"She like Kamala and Elizabeth but for some reason, she doesn't give Amy Klobuchar the time of day. I believe she worked for Hillary in 2016.","Sentiment":0.0},"1":{"date":"2019-12-05 20:01:08","tweet":"So delighted. We need you and @CoryBooker on the stage. No more old white men. Yes, I am Caucasian, but I am an educated voter. I do my research. I miss @SenKamalaHarris I am a fan of @amyklobuchar as well. We must vote, and we must win to take our country back!!!","Sentiment":0.225},"2":{"date":"2019-12-05 20:01:00","tweet":"@amyklobuchar is speaking to Iowans. She's laying out her vision for America. Her plans have depth, detail, and are achievable. #WinBig #AmyForAmerica #AmyForIowa","Sentiment":0.0},"3":{"date":"2019-12-05 20:00:54","tweet":"Sen. @amyklobuchar says she loves working with Congress and getting things done, reminds crowd she's passed over 100 bills. But Klobuchar points out that she has identified 137 things she can get done in the first 100 days as President \"that are legal\" w\/o relying on Congress.","Sentiment":0.225},"4":{"date":"2019-12-05 19:59:32","tweet":"Baby Yoda gets more social media interactions than 2020 Democratic candidates🤣 ⁦@JoeBiden⁩ ⁦@ewarren⁩ ⁦@BernieSanders⁩ ⁦@amyklobuchar⁩ ⁦@MikeBloomberg⁩ ⁦@CoryBooker⁩ ⁦⁦@TulsiGabbard⁩ ⁦@TomSteyer⁩ …","Sentiment":0.2666666667},"5":{"date":"2019-12-05 19:56:38","tweet":"There are 250 people at @amyklobuchar's event in Des Moines tonight, according to the fire marshal. \"We want to win big,\" Klobuchar tells this crowd.","Sentiment":0.4},"6":{"date":"2019-12-05 19:55:18","tweet":"New topics @amyklobuchar has notably focused on today: - Privacy concerns: \"Big tech companies do not own your data, you own your data.\" - Enforcement of anti-trust laws - points out she is highest ranking Democrat on anti-trust committee - Structural racism in economy","Sentiment":0.1872727273},"7":{"date":"2019-12-05 19:55:15","tweet":"I will vote all Democrats, as usual. I will also especially vote for Amy Klobuchar! …","Sentiment":-0.125},"8":{"date":"2019-12-05 19:55:06","tweet":"To be fair, he may have stolen this plan from Amy Klobuchar.","Sentiment":0.7},"9":{"date":"2019-12-05 19:53:21","tweet":"I’m with you, Amy.","Sentiment":0.0},"10":{"date":"2019-12-05 19:53:09","tweet":"@SenStabenow is implicated in a campaign contribution scam where indictments were just announced on illegal campaign contributions. @RepAdamSchiff @amyklobuchar and others also accepted $$$$$$$$$ #fraud …","Sentiment":-0.45},"11":{"date":"2019-12-05 19:53:01","tweet":"If we elect a moderate, it had better be @amyklobuchar.","Sentiment":0.4333333333},"12":{"date":"2019-12-05 19:52:13","tweet":"You're the worst","Sentiment":-1.0},"13":{"date":"2019-12-05 19:51:17","tweet":"Look. I told y’all to keep an eye out for @amyklobuchar","Sentiment":0.0},"14":{"date":"2019-12-05 19:51:14","tweet":"It makes sense, but does that change if Biden picks Pete Buttigieg or John Kerry or Amy Klobuchar as VP?","Sentiment":0.0},"15":{"date":"2019-12-05 19:48:49","tweet":"I wouldn’t mind seeing a dem candidate if they were in my area for heck of it. Just curious how they plan to compete while Trump is literally filling whole stadiums of supporters currently","Sentiment":0.0333333333},"16":{"date":"2019-12-05 19:48:12","tweet":"the JUDICIARY IS ON THE BALLOT so, why isn't it at the center of #2020 campaigns? hey, @ewarren @PeteButtigieg @JoeBiden @BernieSanders @amyklobuchar @JulianCastro @CoryBooker, etc. maybe address this for anyone else who would love to hear ANY plan to take back our judiciary …","Sentiment":0.1333333333},"17":{"date":"2019-12-05 19:48:04","tweet":"“The big technology companies don’t own your data, you own your data,” @amyklobuchar says about legislation she’s part of in congress to a lot of applause.","Sentiment":0.4},"18":{"date":"2019-12-05 19:46:47","tweet":"I think you’re running a good, solid campaign. Keep going. Don’t quit.","Sentiment":0.35},"19":{"date":"2019-12-05 19:46:31","tweet":"@SenWarren @MichaelBennet @BernieSanders @amyklobuchar @SenBooker The fact that you are PRESENTLY members of the Senate and seeking the office of president demands that you recuse yourselves from an obvious conflict of interest. #ImpeachTrump #ImpeachmentHoax","Sentiment":0.0}}