{"0":{"date":"2019-12-05 20:02:02","tweet":"Yang with a cherry on top hold the whipped cream","Sentiment":0.5},"1":{"date":"2019-12-05 20:01:57","tweet":"Work when we are talking about an increasingy Automated\/AI future. Also Like Yang I also studied the data on those Rust Belt States who turned for trump most were unable or unwilling to be retrained, and stayed put, it's not like those clean, green, etc jobs are not here already","Sentiment":0.0333333333},"2":{"date":"2019-12-05 20:01:54","tweet":"This is my honey Jeff, he's been Yang Gang since before his stroke several months ago. Tonight he proudly signed the application for absentee ballot to vote for our guy, Andrew Yang. Please share, and thank you Yang Gang, much love! ️","Sentiment":0.475},"3":{"date":"2019-12-05 20:01:53","tweet":"i haven't had a land line since 2002 ... 17 years ago!","Sentiment":0.0},"4":{"date":"2019-12-05 20:01:42","tweet":"Love seeing @AndrewYang #winning …","Sentiment":0.5},"5":{"date":"2019-12-05 20:01:40","tweet":"@neiltyson Would you be willing to break the protocol of scientists who would be willing to have a convo with @AndrewYang? I have respected you my whole life this would be a absolute great convo. #HumanityFirst","Sentiment":0.34},"6":{"date":"2019-12-05 20:01:29","tweet":"The polls are robbing Yang of the presidency. They don’t include him on ballots, don’t mention his name, or selectively choose the participants that meet the DNC’s agenda. Democracy is being manipulated and bought. Make America Think Harder #MATH","Sentiment":-0.1},"7":{"date":"2019-12-05 20:01:29","tweet":"Take this bread in rememberence of him","Sentiment":0.0},"8":{"date":"2019-12-05 20:01:28","tweet":"The top 1% have more wealth than the bottom 50% combined. It will and much more","Sentiment":0.5},"9":{"date":"2019-12-05 20:01:24","tweet":"Detailed and in depth questions!!Great job #AxeFiles and #AndrewYang..Send ppl to this pod cast especially republicans!!","Sentiment":0.2},"10":{"date":"2019-12-05 20:01:23","tweet":"Nice","Sentiment":0.6},"11":{"date":"2019-12-05 20:01:22","tweet":"Do share !","Sentiment":0.0},"12":{"date":"2019-12-05 20:01:21","tweet":"Regardless, nobody even asks Yang how he will pay for his stuff or how much people will be taxed, because they know he can't win, because he has very little popularity overall. Pretending the candidate is more popular than they really are, is how we got Trump.","Sentiment":0.29375},"13":{"date":"2019-12-05 20:01:13","tweet":".@AndrewYang i heard you’re in town! will we see you at @climatestrikeil ‘s chicago climate strike tomorrow?","Sentiment":0.0},"14":{"date":"2019-12-05 20:01:12","tweet":"Who's awesome?","Sentiment":1.0},"15":{"date":"2019-12-05 20:01:09","tweet":"Mr. President, she is a hard woman with a warm facade who has made horrible decisions for humans in her political career thus far. She may be fun, but please do not consider putting her in your cabinet.","Sentiment":-0.0486111111},"16":{"date":"2019-12-05 20:01:09","tweet":"Definitely exhausting, but he's genuinely being taken more seriously all the time. A colleague came up to me yesterday and noticed I was watching Yang speak during a break and said \"Is that Andrew Yang? He has some really good ideas, I'm excited to see how far he goes!\"","Sentiment":0.1952380952},"17":{"date":"2019-12-05 20:01:05","tweet":"Andrew Yang: Impeachment Efforts May Help President Trump Get Reelected … via @gatewaypundit","Sentiment":0.0},"18":{"date":"2019-12-05 20:01:03","tweet":"CREEPY","Sentiment":-0.5},"19":{"date":"2019-12-05 20:00:53","tweet":"I can’t wait until the day I see a whole baseball or football stadium full of yangsters. Now, THAT will immensely impressive!!","Sentiment":0.5166666667}}