{"0":{"date":"2019-12-05 20:01:58","tweet":"Wall Street controls significant portion of the economy < Government controls significantly portions of economy","Sentiment":0.375},"1":{"date":"2019-12-05 20:01:58","tweet":"Getting defensive isn't helping you. Not believing what she says about her in person experiences isn't helping you. Doubling down isn't helping your case at all. You are simply proving my point.","Sentiment":-0.0777777778},"2":{"date":"2019-12-05 20:01:57","tweet":"You are the shit under my boot! You don’t even know what socialism is!. It’s redistribution of wealth. Plus it is the takeover of production and distribution from private industry. It is also the takeover of private property get it","Sentiment":-0.1041666667},"3":{"date":"2019-12-05 20:01:57","tweet":"who the fuck are you again","Sentiment":-0.4},"4":{"date":"2019-12-05 20:01:57","tweet":"No she isn't, most Sanders Supporters will also admit this.. both sides are corrupt and many of them are working in tandem ..","Sentiment":0.1666666667},"5":{"date":"2019-12-05 20:01:57","tweet":"[1Th 5:17 NLT] 17 Never stop praying.","Sentiment":0.0},"6":{"date":"2019-12-05 20:01:56","tweet":"do you think giving sweeping tax cuts to the elite and hoping they'll do good, and putting your wellbeing into the hands of profit and not government doing well for you? bezos won't save you. you're a mere fly on his dinner table.","Sentiment":0.3333333333},"7":{"date":"2019-12-05 20:01:55","tweet":"#BernieSanders has a plan for this check it out It's #free","Sentiment":0.4},"8":{"date":"2019-12-05 20:01:55","tweet":"Desperate people will do desperate acts.","Sentiment":-0.6},"9":{"date":"2019-12-05 20:01:54","tweet":"Currently doing it now and have been for years. Just can't afford it right now.","Sentiment":0.1428571429},"10":{"date":"2019-12-05 20:01:51","tweet":"You are referring to your paymaster, George Soros& the Soros Constitution 2020- not the actual Constitution of the USA ! You are doomed to fail. Evil","Sentiment":-0.5},"11":{"date":"2019-12-05 20:01:49","tweet":"You think you have a chance to win?","Sentiment":0.8},"12":{"date":"2019-12-05 20:01:49","tweet":"Let's bring Celebrity Death Match back but have it be everyone who has dropped out of the Democratic Presidential Race and the winner fights superpowered Bernie Sanders.","Sentiment":0.0},"13":{"date":"2019-12-05 20:01:49","tweet":"It’s not the baby choosing to be aborted.","Sentiment":0.0},"14":{"date":"2019-12-05 20:01:48","tweet":"BREAKING NEWS: Presidential hopeful Sen. Bernie Sanders launches new campaign slogan: America Can Bank on Bernie.","Sentiment":0.1363636364},"15":{"date":"2019-12-05 20:01:47","tweet":"Have you?","Sentiment":0.0},"16":{"date":"2019-12-05 20:01:47","tweet":"didn't your dad get you a job or something","Sentiment":0.0},"17":{"date":"2019-12-05 20:01:47","tweet":"Your first lesson in big boy world. Don’t take on more debt then you can handle. For allahs sake - you think you’re playing with Monopoly money?","Sentiment":0.25},"18":{"date":"2019-12-05 20:01:47","tweet":"Clearly you're not paying attention to how grading has changed. What happens when not enough people are \"passing\"? We lower the bar","Sentiment":0.05},"19":{"date":"2019-12-05 20:01:46","tweet":"The first of two farmers forums this swing for @BernieSanders. Moments ago, more than 30 Iowa farmers and rural activists endorsed Bernie as he returned to the state.","Sentiment":0.25}}