{"0":{"date":"2019-12-05 19:57:22","tweet":"Did Beto's speechwriter go to work for the governor?","Sentiment":0.0},"1":{"date":"2019-12-05 19:56:09","tweet":"We are already #winning with @realDonaldTrump so we don't need you and you can drop out. #Deval #DevalPatrick #MAGA #KAG #Trump #Trump2020 …","Sentiment":0.5},"2":{"date":"2019-12-05 19:55:34","tweet":"\"If you are brave enough and self confident enough to listen to people who may have different ideas about how you accomplish objectives, then I think you can get change that lasts.\" -@DevalPatrick …","Sentiment":0.26},"3":{"date":"2019-12-05 19:53:25","tweet":"If we want big change that lasts we have to bring other people in. To win, we need everybody, everywhere. We need the people who feel left out and feel left back, the people who participate all the time and those never do— and everyone in between. …","Sentiment":0.1125},"4":{"date":"2019-12-05 19:51:51","tweet":"Tweet from @mviser John Kerry is bypassing the senior senator from Massachusetts, Elizabeth Warren (as well as former governor Deval Patrick) to back Joe Biden. “I just think Joe is the person for the moment,” Kerry said. … #news #p2","Sentiment":0.0},"5":{"date":"2019-12-05 19:49:33","tweet":"Correction: @MikeBloomberg","Sentiment":0.0},"6":{"date":"2019-12-05 19:45:28","tweet":"Deval Patrick: \"My work for Bain Capital will be the toughest for Democratic primary voters to accept.\" Pete Buttigieg: \"Hold my beer.\" …","Sentiment":0.4},"7":{"date":"2019-12-05 19:28:07","tweet":"Presidential hopeful Elizabeth Warren is expected to speak at the DNC fundraiser in Boston tonight. The DNC confirmed to me that Warren will be the only presidential candidate in attendance. But what about Deval Patrick? #mapoli","Sentiment":0.1},"8":{"date":"2019-12-05 19:25:47","tweet":"One of Deval Patrick's early campaign stops this weekend is in FALLS CHURCH, Virginia -- right inside the Beltway.","Sentiment":0.1928571429},"9":{"date":"2019-12-05 19:24:50","tweet":"Maura Healey @MassAGO at the @DNC #IWillVote gala in #Boston wisecracks that she's the only #Democrat from Massachusetts not running for president. @ewarren @DevalPatrick @MikeBloomberge @masslivenews","Sentiment":0.0},"10":{"date":"2019-12-05 19:24:11","tweet":".@DevalPatrick I'm sorry. I know the field is weird now but running for @joebiden #VP doesnt work. Deuling #optics. Not @BarackObama enough, not opposite enough. I am sorry You're a great guy, truly, but get out. #Dems I know how to consult to a win so bring me in- just a meeting","Sentiment":0.0125},"11":{"date":"2019-12-05 19:06:18","tweet":"I like all of them too. My additions would be Deval Patrick, Ayanna Pressley, Adam Schiff, Stacey Abrams and Joe Kennedy.","Sentiment":0.0},"12":{"date":"2019-12-05 19:04:18","tweet":"I’ve seen literally no reporting on Deval Patrick since his announcement. Does his campaign have any reasonable chance of getting off the ground? @galendruke @NateSilver538 @ClareMalone @538politics","Sentiment":0.2},"13":{"date":"2019-12-05 18:54:46","tweet":"Booker is a bit too “let’s all get along” & Deval Patrick has a lot of serious problems. They’ve also less support than Harris. Warren doesn’t hold up to scrutiny when it comes to a civil rights record, which is more important to the base than her economic message.","Sentiment":-0.0333333333},"14":{"date":"2019-12-05 18:43:00","tweet":"hey, what ever happened to Deval Patrick?","Sentiment":0.0},"15":{"date":"2019-12-05 18:23:40","tweet":"Biden2020! Kamala Harris would be the icing on the cake!","Sentiment":0.0},"16":{"date":"2019-12-05 18:16:27","tweet":"Whatever happen to Deval Patrick,Obama's man? He came out in the morning and was gone before nightfall.","Sentiment":0.0},"17":{"date":"2019-12-05 18:16:13","tweet":"I don't oppose him on his record.","Sentiment":0.0},"18":{"date":"2019-12-05 18:13:52","tweet":"Here for it There are great candidates running..but who is capable of beating Trump?(I trust @KamalaHarris is on everyone’s list for VP) My picks are: @JoeBiden @MikeBloomberg (he intimidates Trump like no other)@SenSanders @CoryBooker @DevalPatrick @JulianCastro @ewarren …","Sentiment":0.5},"19":{"date":"2019-12-05 18:12:16","tweet":"I thought CNN said he did endorse him...","Sentiment":0.0}}