[{"date":"2019-01-23T10:54:13+00:00","tweet":"Why Black Folks Who THiNK don't trust Kamala Harris, Cory Booker, and Deval Patrick …","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-01-22T22:37:11+00:00","tweet":"It's all about Bernie. They are going to try to disqualify everyone they think will be his strongest challengers. First it was Cory Booker, then Deval Patrick, then Beto, now Kamala. Booker, Deval, & Harris would win the black vote; Beto youths.","name":"deval patrick","Sentiment":0.2944444444},{"date":"2019-01-22T17:47:25+00:00","tweet":"Martin Luther King was a Zionist. The fact Intersectional bigots exploit his beautiful legacy is an ugly truth. Instead of Anti Israel hate speakers, why not replace with Bakari Sellers, Maajid Nawaz, Deval Patrick? …","name":"deval patrick","Sentiment":-0.2166666667},{"date":"2019-01-22T13:18:13+00:00","tweet":"I remember when Obama gave the opening speech at the DNC and thinking “oh shit I’m watching a President talk”, and it was 10x more like that when I saw him stumping at a Deval Patrick rally. Anyway it’s gonna totally rule when we finally elect AOC in 6-10 years.","name":"deval patrick","Sentiment":0.275},{"date":"2019-01-18T12:00:57+00:00","tweet":"This was an amazing experience for our students. Thank you for spending some time with our students today Mr. @DevalPatrick. …","name":"deval patrick","Sentiment":0.6},{"date":"2019-01-16T11:37:30+00:00","tweet":"Falmouth Wind Turbine Project Finally Finished - The town that once hosted Gov Deval Patrick's flagship #windenergy project on Cape Cod and Islands pronounced the Falmouth turbines dead: … @pwrhungry","name":"deval patrick","Sentiment":-0.1},{"date":"2019-01-13T16:01:50+00:00","tweet":"So far there's: Hillary Clinton Joe Biden Elizabeth Warren Corey Booker Kamala Harris Beto O'Rourke Tulsi Gabbard AOC (fake ID) Mike Bloomberg Andrew Cuomo Shears Brown Chris Murphy Eric Holder Terry McAuliffe Kirsten Gillibrand Deval Patrick Bernie Sanders Julien Castro","name":"deval patrick","Sentiment":-0.2},{"date":"2019-01-12T16:26:55+00:00","tweet":"I just saw someone say his top 2020 picks are Harris, Biden, Deval Patrick, Warren, and Beto, and I have questions about how he came to these choices.","name":"deval patrick","Sentiment":0.5},{"date":"2019-01-09T19:48:48+00:00","tweet":"So far we’ve removed Deval Patrick, Tom Steyer (not running) & Stacey Abrams (CAP) from our Twitter List of 2020 Dem possibles: we’re down to 30 prospects. Who’s next to announce or leave? #Bernie #Warren #Gabbard #Booker #Kamala #Bloomberg #Beto #Biden #Castro #Ojeda #Brown #Etc","name":"deval patrick","Sentiment":-0.0185185185},{"date":"2019-01-09T16:25:42+00:00","tweet":"Steyer had sent a lot of signs that was gonna run. He's in Iowa today (met with he Asian and Latino coalition this morning). Recently, he had brought on Doug Rubin - who was an adviser to Deval Patrick (former Gov of Mass who also decided to bypass a run for president this cycle) …","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-09T14:01:01+00:00","tweet":"I wonder if the author, who spent some time interning for a lobbying firm, Deval Patrick and Bobby Jindal, has an implicit bias against Bernie who is firmly anti all of that?","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-01-09T12:08:26+00:00","tweet":"#LawEnforcementAppreciationDay remember the federal coverup of Ruby Ridge - and that one its architects, @DevalPatrick may run for president in 2020 …","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-09T10:56:43+00:00","tweet":"LETS GO!!!!!!!!! We can do this together to support our #children in @MASchoolsK12 @Patriots @DevalPatrick @MassEducation @massupt @MASCSchoolComm @massteacher #FBRC @KarenSpilka We need everyone to pay attention to this important legislative effort #ThankYou @SoniaChangDiaz …","name":"deval patrick","Sentiment":0.4},{"date":"2019-01-06T21:39:00+00:00","tweet":"Harris, Beto, Klobuchar are my top 3, would’ve liked Deval Patrick but he’s already said no.","name":"deval patrick","Sentiment":0.55},{"date":"2019-01-06T06:49:00+00:00","tweet":"A great 10th Annual Executives Forum by @IsraelinBoston @FourSeasons Boston on Friday with Former MA Governor @DevalPatrick.","name":"deval patrick","Sentiment":0.4},{"date":"2019-01-04T12:10:09+00:00","tweet":"It was an honor to host this morning former MA Gov @DevalPatrick to discuss about the importance of social impact through economic innovation in both American and Israeli societies. – at Four Seasons Hotel Boston","name":"deval patrick","Sentiment":0.0583333333},{"date":"2019-01-04T08:42:20+00:00","tweet":"Wonderful to have @DevalPatrick as the keynote this morning at our #Israel Annual Executives Forum in #Boston #mapoli","name":"deval patrick","Sentiment":1.0},{"date":"2019-01-04T05:27:52+00:00","tweet":"Mitt Romney hired 2x Dem Gov of Mass Deval Patrick for his company!Believe Romney will float Deval Patrick’s Name as possible 2020 candidate!Mitt May promote himself to be a running mate or at least involved","name":"deval patrick","Sentiment":-0.15},{"date":"2019-01-04T05:19:25+00:00","tweet":"Believe Mitt agreed w\/Obama’s Policies! Mitt hired (D) Governor Deval Patrick for his company! Possibility Mitt will endorse or put Deval Patrick’s name out as 2020 candidate!Mitt May try to run w\/him or be involved w\/spearheading Deval Patrick’s candidacy!","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-04T00:56:26+00:00","tweet":"Deval Patrick has some gravitas, if you look at the Democratic candidates as a group, gravitas is lacking. Most don't seem serious.","name":"deval patrick","Sentiment":0.0833333333},{"date":"2019-02-01T18:17:42+00:00","tweet":"*Looks at Deval Patrick & nods* …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-01T17:40:15+00:00","tweet":"Who are the two who weren't elected like Deval Patrick and Doug Wilder?","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-01T16:04:51+00:00","tweet":"Same folks also, by a strange coincidence, had problems with Deval Patrick when he was in consideration. Funny that.","name":"deval patrick","Sentiment":0.0666666667},{"date":"2019-01-31T23:39:40+00:00","tweet":"i’m waiting on Deval Patrick to toss his hat in.","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-31T11:52:18+00:00","tweet":"I agree 100%. Look at my tweets from a year ago asking her to Run. With @DevalPatrick","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-24T17:10:21+00:00","tweet":"Police Unions (Black Detectives) Call on President Obama, Governor Deval Patrick to Apologize for Comments about CPD, Sgt. James Crowley in Arrest of Henry L. Gates, Jr. - via @Shareaholic","name":"deval patrick","Sentiment":-0.1083333333},{"date":"2019-01-22T14:44:42+00:00","tweet":"I still hold hope that one day @DevalPatrick runs for president.","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-22T10:29:54+00:00","tweet":"For the new Orange Line cars you can thank Deval Patrick. Baker says they plan to upgrade the signal system sometime in the next 4 years. MBTA hasn't said why Orange Line is running 20 minutes late today. Lots of full trains are making people late #BosPoli","name":"deval patrick","Sentiment":-0.0227272727},{"date":"2019-01-21T18:09:42+00:00","tweet":"Kinda wish we were still in the era when there was a deep bench of D governors to pick from. Pity that Deval Patrick doesn’t seem to want to do it.","name":"deval patrick","Sentiment":-0.05},{"date":"2019-01-21T17:30:36+00:00","tweet":"Today, we remember the life of Dr. Martin Luther King, Jr. and his powerful impact on American Civil Rights. We look forward to celebrating his legacy when the BPYO and former Governor Deval Patrick perform Schwantner's \"New Morning for the World\" on February 24 at Symphony Hall.","name":"deval patrick","Sentiment":0.1090909091},{"date":"2019-01-21T13:25:53+00:00","tweet":"Don’t get me wrong I love Kamala Harris .She’s extremely smart, savvy and talented politician.Definitely better than a Corey Booker or Deval Patrick (ugh) but I need to know where she’s at on policies.","name":"deval patrick","Sentiment":0.2828571429},{"date":"2019-01-19T05:09:43+00:00","tweet":"You can’t have that nick name cause Deval Patrick already owns it","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-18T11:59:21+00:00","tweet":"Thank you @DevalPatrick for your time, wisdom and humor for speaking to the @WoodwardSchool students. The opportunity to engage with civic leaders are one they won’t forget #APGOV #mapoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-16T07:41:45+00:00","tweet":"“Any legitimate 2020 candidate who’s not reaching out to Gillum and Abrams right now is probably not going to win. I mean that’s just a smart play right now,” said Rubin, a former chief of staff to Gov. Deval Patrick.","name":"deval patrick","Sentiment":0.212202381},{"date":"2019-01-09T16:44:05+00:00","tweet":"“Mr. Steyer also recently retained a new senior adviser, Doug Rubin, who previously advised former Gov. Deval Patrick of Massachusetts on a possible 2020 run.” #mapoli …","name":"deval patrick","Sentiment":-0.0060606061},{"date":"2019-01-06T13:15:16+00:00","tweet":"#My2019CalendarHas twelve great presidential candidates listed. 1. Elizabeth Warren 2. Kamila Harris 3. Beto O’Rourke 4. Joe Biden 5. Bernie Sanders 6. Cory Booker 7. Sherrod Brown 8. Tulsi Gabbard 9. Deval Patrick 10. Amy Klobucher 11. TBA 12. TBA","name":"deval patrick","Sentiment":0.8},{"date":"2019-01-04T10:43:18+00:00","tweet":"I agree with @DevalPatrick - this was the measure that should have been implemented after 9\/11 to capture the energy and patriotism of that moment. A new core of teachers, volunteers, and military that creates a common experience among Americans. …","name":"deval patrick","Sentiment":-0.0878787879},{"date":"2019-01-04T09:37:33+00:00","tweet":"“If it were up to me, we would have mandatory service in the US. Not necessarily military, but compulsory service,” says former Gov. @DevalPatrick at Israel consulate execs forum.","name":"deval patrick","Sentiment":0.025},{"date":"2019-01-03T23:28:40+00:00","tweet":"Splendid. Reminded me of an old favorite (especially the ending) by Deval Patrick","name":"deval patrick","Sentiment":0.3583333333},{"date":"2019-01-03T21:08:36+00:00","tweet":"Don’t know enough about Deval Patrick…can he inspire people? If people will follow him, I’m prepared to give him some grace on Bain Capital! Reading his Wikipedia page erodes confidence in his electability. Has it been hacked? \/13 #warrengillum","name":"deval patrick","Sentiment":0.0},{"date":"2019-01-03T20:14:21+00:00","tweet":".@EricHolder sure wish Deval would run he is a clear contrast to Trump and a rare candidate because we don’t have many Centrist its primarily a progressive field. We need Deval in some capacity back in government.","name":"deval patrick","Sentiment":0.3},{"date":"2019-01-03T16:30:09+00:00","tweet":"When I first took that oath of office 8 years ago, I did so with a drive to make government work better for the residents of the Commonwealth. Later this month I’ll once again take that oath & that drive is still inside of me & stronger than ever. #TBT @DevalPatrick #MAPoli","name":"deval patrick","Sentiment":0.25},{"date":"2019-01-03T14:56:31+00:00","tweet":"Warren in her first press conference after being elected to her 1st term, had to have Gov Deval Patrick (another loser) take the questions for her.....and this woman wants to run for President?","name":"deval patrick","Sentiment":0.225},{"date":"2019-01-03T10:24:41+00:00","tweet":"Obama takes out another. The annoited one he has chosen is Beto. So far....Deval Patrick, Warren, Kamala, Bernie, Biden have either gotten extremely bad press to decrease probability or pulled from race.","name":"deval patrick","Sentiment":-0.7},{"date":"2019-01-03T08:01:21+00:00","tweet":"Writing a story on local media’s bias on the beer drinking bs. You criticized Warren, while Charlie Baker often raised beers while campaigning and don’t recall you ever doing a column on that? Did you ever criticize baker for campaign drinking? #mapoli","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-12T07:54:50+00:00","tweet":"Some prominent ‘outsiders’ who’ve thrived in Boston: Deval Patrick Ayanna Pressley Michelle Wu Marty Baron John Henry …","name":"deval patrick","Sentiment":0.5},{"date":"2018-12-10T16:36:22+00:00","tweet":"Deval Patrick likes Beto—and Gillum and Abrams. Loves a big, competitive primary. Has spoken recently to 44 about how nothing can prepare you for the presidency, but still thinks Joe Biden is great. We interviewed him near his office in Boston. …","name":"deval patrick","Sentiment":0.26},{"date":"2018-12-09T14:31:00+00:00","tweet":"Deval Patrick passed on running for president this week, saying the campaign process is too \"cruel.\" He's right — there are a lot of downsides to running for president.","name":"deval patrick","Sentiment":-0.3571428571},{"date":"2018-12-07T13:23:08+00:00","tweet":"The annoying defensiveness around Deval Patrick and Beto are a good reminder that people are going to be jerks about the primary. As they always are. Question. Should I talk about the primary or just how anti-monopoly policy is playing in the primary?","name":"deval patrick","Sentiment":0.22},{"date":"2018-12-06T20:25:05+00:00","tweet":"First Avenatti, now Deval Patrick?! They’re droppping like flies! Who’s next, Elizabeth Warren? #Faucahontas #SleezyPornLawyer @DevalPatrick …","name":"deval patrick","Sentiment":0.1953125},{"date":"2018-12-06T10:52:18+00:00","tweet":"One key reason Deval Patrick declined to run in 2020 was his wife, Diane, had recently been diagnosed w\/ uterine cancer & had surgery before Thanksgiving. Patrick opened up today to @WBUR about his decision. … w\/ @ArletteSaenz & @devancole1","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-06T09:13:18+00:00","tweet":"Deval Patrick is not perfect, but I remember sitting in the Roosevelt Room of the White House in the early 1990s when he was the only other person in the room besides me willing to defend the Employment Non Discrimination Act. I've never forgotten that. …","name":"deval patrick","Sentiment":-0.0458333333},{"date":"2018-12-06T09:00:57+00:00","tweet":"I hereby take myself out of the running as well. I demand a Wapo tweet about it because I had a better chance of becoming president than Deval Patrick.","name":"deval patrick","Sentiment":0.475},{"date":"2018-12-06T08:54:04+00:00","tweet":"How did Deval Patrick expect the Deval Patrick trial balloon to be received? …","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-06T08:42:27+00:00","tweet":"Deval Patrick takes himself out of the running for president in 2020","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-06T08:26:37+00:00","tweet":"Former Massachusetts Gov. Deval Patrick announces that he will not run for president in 2020, citing the \"cruelty of our elections process\"","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-06T07:25:26+00:00","tweet":"Totally get this decision, but bummed to hear it. This country could use some @DevalPatrick in the White House. \"Deval Patrick announces he won’t run for president in 2020, cites ‘cruelty of our elections process’\" …","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-06T07:24:50+00:00","tweet":"I have a great deal of respect for @DevalPatrick. Contrary to some flippant analysis yesterday, he was set to do extremely well in Iowa, NH, and S.C., while having momentum entering the SEC primary. Most importantly he’s a good hearted person. Onward! …","name":"deval patrick","Sentiment":0.3928571429},{"date":"2018-12-06T07:01:19+00:00","tweet":"Deval Patrick officially out for 2020: \"I’ve decided that a 2020 campaign for president is not for me. ... the cruelty of our elections process would ultimately splash back on people whom Diane and I love, but who hadn’t signed up for the journey, was more than I could ask.\"","name":"deval patrick","Sentiment":0.25},{"date":"2018-12-05T21:07:11+00:00","tweet":"This is scathing. “[Deval Patrick] didn’t just make a lot of money; he made a lot of money helping a Republican billionaire rip off the black middle class.” …","name":"deval patrick","Sentiment":-0.2555555556},{"date":"2018-12-05T19:43:22+00:00","tweet":"Former Massachusetts governor @DevalPatrick announced that he is not running for president, one day after @zachdcarter published this. If you’d been keeping up with Patrick’s shenanigans, you already knew that he had no chance. He had chosen his path.","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T17:48:47+00:00","tweet":"HELL NO TO BOTH @DevalPatrick & @BernieSanders FOR OUR DEMOCRATIC PRESIDENTIAL CANDIDATE !! @RepAdamSchiff @SenateDems @HouseDemocrats @TheDemocrats @SenWarren @NancyPelosi @sascat @YeshuaLover1970 @SenKamalaHarris Deval Patrick, Foreclosure Mogul …","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T13:38:55+00:00","tweet":"New: Deval Patrick's decision not to run in 2020 was personal. Reasons unknown, we do know the former MA governor is his family's fiercely protective patriarch who has felt the sting of intrusion into private matters. …","name":"deval patrick","Sentiment":0.0072727273},{"date":"2018-12-05T12:31:21+00:00","tweet":"Darn. @DevalPatrick was my preferred candidate for 2020. I do not support Elizabeth Warren, and as much as I adore Kamala Harris, she isn't the one either. | Deval Patrick bows out of 2020 presidential run","name":"deval patrick","Sentiment":0.2},{"date":"2018-12-05T10:41:29+00:00","tweet":"important thread on Deval Patrick's gruesome corruption …","name":"deval patrick","Sentiment":-0.3},{"date":"2018-12-05T09:26:30+00:00","tweet":"@DevalPatrick is nothing more than @BarackObama on steroids. While appearing to be a proponent of the middle class. They are and were never on the side of anyone but their selfish neoliberal selves.... Deval Patrick, #Foreclosure Mogul …","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T08:30:47+00:00","tweet":"The reason this is significant (even if Deval Patrick was no household name across the country) was that he had the support of key Obama veterans (Valerie Jarrett\/David Axelrod). Now, who knows where that support goes ... …","name":"deval patrick","Sentiment":0.1875},{"date":"2018-12-05T08:27:58+00:00","tweet":"A source close to Deval Patrick (former governor of Mass) confirmed to NPR that he has called close friends to let them know his decision - he will NOT be running for president in 2020.","name":"deval patrick","Sentiment":0.2},{"date":"2018-12-05T08:18:25+00:00","tweet":"Former Gov. Deval Patrick has decided not to run for President and plans to announce his decision soon, a source close to the Massachusetts Democrat tells CNN …","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T07:51:07+00:00","tweet":"I live in Massachusetts. Deval Patrick was a fine Governor. What’s your beef with him?","name":"deval patrick","Sentiment":0.2765151515},{"date":"2018-12-05T07:50:09+00:00","tweet":"@DevalPatrick, truly one of the most qualified people to be #POTUS said no, thank you. #2020election Deval Patrick to announce he won’t run for president, sources say via @politico","name":"deval patrick","Sentiment":0.5},{"date":"2018-12-05T07:41:49+00:00","tweet":"About as close as you can get to an official announcement. Deval Patrick telling staff he’ll pass on 2020 White House bid: report … @WGME @DevalPatrick #DevalPatrick","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T07:32:34+00:00","tweet":"#BREAKING: Deval Patrick telling staff he’ll pass on 2020 White House bid: report","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T00:55:42+00:00","tweet":"Very true about Deval Patrick. Also true about you! You should leave those doors cracked a bit too....","name":"deval patrick","Sentiment":0.44625},{"date":"2018-12-05T00:41:11+00:00","tweet":"Deval Patrick, the former Democratic governor of Massachusetts, plans to announce shortly that he will not run for president in 2020","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-05T00:20:24+00:00","tweet":"Just tweeted an article saying Deval Patrick is going to announce he is not running.","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-04T23:49:46+00:00","tweet":"I think the news about running for President is true for Gov.Deval Patrick. It was in the Sunday Boston Globe. Perhaps you could give some T A on strategies for debating with the likes of # 45 to some of the Democratic Candidates. Not your words or language, but your style.️","name":"deval patrick","Sentiment":0.35},{"date":"2018-12-04T23:40:30+00:00","tweet":"If the news about @DevalPatrick is true (I hope it is not), hopefully he will remain open to being a VP pick. He is an exceptional statesman. A good man and one of the most intelligent possible candidates.","name":"deval patrick","Sentiment":0.430952381},{"date":"2018-12-04T23:34:28+00:00","tweet":"Ex-Massachusetts Gov. Deval Patrick is telling allies he won't run for president in 2020, @politico reports","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-04T23:25:28+00:00","tweet":"Sources: Deval Patrick to announce he won’t run for president","name":"deval patrick","Sentiment":0.0},{"date":"2018-12-04T21:03:10+00:00","tweet":"@zachdcarter & @HuffPost delivered a scathing review that should end #AmericanDOS Black support for @DevalPatrick if he runs in 2020. How Deval Patrick & Ameriquest preyed on black middle class families: … @ryangrim @KWCosby @BreakingBrown @SandyDarity","name":"deval patrick","Sentiment":-0.2333333333},{"date":"2018-12-04T16:58:32+00:00","tweet":"I really hope Deval Patrick isn't so blinded to reality to think that this wouldn't come up in the course of a possible presidential campaign …","name":"deval patrick","Sentiment":0.1},{"date":"2019-03-01T13:03:16+00:00","tweet":"Imagine the reverse of this quote from a black elected official - like if Deval Patrick, another former governor from New England said, “Black people will not have anything to say. It’s only going to be the whites who would elect.” …","name":"deval patrick","Sentiment":0.1005050505},{"date":"2019-02-27T11:02:59+00:00","tweet":"This Sunday we invited students from the Epiphany School to our BPYO concert as part of our Community Partnership. The young audience members had the opportunity to meet Deval Patrick, Benjamin Zander, and attend the full concert free of charge!","name":"deval patrick","Sentiment":0.3166666667},{"date":"2019-02-27T00:54:53+00:00","tweet":"Former Massachusetts governor and @BainCapital Double Impact Managing Director @DevalPatrick speaks at @TuckSchool: “In a democracy, we get the government we deserve. If we want better, it’s up to us to demand more of our candidates.”","name":"deval patrick","Sentiment":0.25},{"date":"2019-02-26T09:57:26+00:00","tweet":"Governor Patrick’s eloquent encouragement to seek out common ground and shared values and “turn toward each other, rather than against one another” remains a guiding principle of our 351 community. #blackhistorymonth","name":"deval patrick","Sentiment":-0.2125},{"date":"2019-02-26T09:56:29+00:00","tweet":"Governor @DevalPatrick made history in Massachusetts as our first African American Governor. As our founding Honorary Chair, his relentless belief in the vision of Project 351 in our nine years has helped ensure 3,381 eighth graders have engaged as Ambassadors.","name":"deval patrick","Sentiment":0.0833333333},{"date":"2019-02-20T20:50:19+00:00","tweet":"Maybe he's #With @BTVJoan as well! (Plus here's one from the vault w\/ @BryanAubin @DevalPatrick & @MiroBTV)","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-19T22:49:30+00:00","tweet":"Jurisdictions with #RankedChoiceVoting are electing more women, have higher rates of turnout & civility, & are electing majority winners!","name":"deval patrick","Sentiment":0.40625},{"date":"2019-02-19T13:29:54+00:00","tweet":"We've had WEEKS of bad faith, nasty articles and online behavior vilifying Beto, Kamala, Deval Patrick, Klobuchar, and Warren. You clearly think that's fine.","name":"deval patrick","Sentiment":-0.2958333333},{"date":"2019-02-19T09:36:50+00:00","tweet":"LISTEN: our executive director Adam Friedman talks with former @massgop chair @JenniferNassour and former @DevalPatrick comms director @jessemermell about #RankedChoiceVoting on the @CommonWealthMag #Codcast #mapoli …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-18T11:10:26+00:00","tweet":"Today we celebrate the Democratic African American Governors! Thank you for your leadership and example! @GovernorWilder @DevalPatrick and @NYGovPaterson55","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-17T21:11:29+00:00","tweet":"“Policy only matters at the point at which it touches people,” Governor Deval Patrick. In our policy making around #ClimateAction we should think of the social & economic impact on our community, while simultaneously touching people ie saving the planet 4 future generations.(4\/4)","name":"deval patrick","Sentiment":0.1466666667},{"date":"2019-02-14T18:00:52+00:00","tweet":"Kamala Harris showing early strength with Deval Patrick’s loyal network with this fundraiser …","name":"deval patrick","Sentiment":0.2166666667},{"date":"2019-02-12T21:28:00+00:00","tweet":"#maddow we have got a great group of candidates. love (almost) all of them. Cory Booker definitely among them! Was hoping to see Deval Patrick in there too.","name":"deval patrick","Sentiment":0.4333333333},{"date":"2019-02-12T18:02:12+00:00","tweet":"Deval Patrick: Not the hero we need, but the hero we deserve. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-06T18:46:06+00:00","tweet":"Thank you @MarcRPacheco, Deval Patrick, et al. for the landmark GWSA. And TY @CLF, @GEConsumers & teen plaintiffs for winning the suit against the Baker admin to force baker to follow the law. … …","name":"deval patrick","Sentiment":0.25},{"date":"2019-02-06T14:15:50+00:00","tweet":"\"We believe that we owe the next generation a better country than we found and that every American has a stake in that. We believe that in times like these we should turn to each other, not on each other. [...] That's what Democrats believe.\" - Governor @DevalPatrick #BHM","name":"deval patrick","Sentiment":0.05},{"date":"2019-02-04T14:48:51+00:00","tweet":"Um former Massachusetts Governor Deval Patrick?","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-02T11:10:03+00:00","tweet":"Elected since Reconstruction? Two. Doug Wilder in Virginia and Deval Patrick in Massachusetts.","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-01T22:38:54+00:00","tweet":"Deval Patrick was the most recent iirc","name":"deval patrick","Sentiment":0.25},{"date":"2019-02-01T16:04:51+00:00","tweet":"Same folks also, by a strange coincidence, had problems with Deval Patrick when he was in consideration. Funny that.","name":"deval patrick","Sentiment":0.0666666667},{"date":"2019-02-27T22:16:57+00:00","tweet":"State: Ben Cardin Treasury: Claire McCaskill Defense: Jim Webb Interior: Jon Tester Justice: Deval Patrick Agriculture: Amy Klobuchar Labor: Sherrod Brown Energy: Jerry McNerney Education: Dave Loebsack VA: Kirsten Gillibrand …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-27T16:18:48+00:00","tweet":"I kinda look like @DevalPatrick in this picture 🤣🤣 …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-27T08:08:55+00:00","tweet":"Kamala iz the chosen one. Obama, Perkins Coie have been quietly working behind the scenes...Beto or Biden will emerge if she fails. They have been planting stories fir months to take out Warren, Bernie, Tulsi, Bloomberg...etc. Deval Patrick was out before it started.","name":"deval patrick","Sentiment":-0.3},{"date":"2019-02-22T16:46:45+00:00","tweet":"Bill De Blasio, John Delaney, Tulsi Gabbard, Eric Garcetti, Kirsten Gillibrand, Kamala Harris, John Hickenlooper, Eric Holder, Jay Inslee, Tim Kaine, John Kerry, Amy Klobuchar, Terry McAuliffe, Gavin Newsom, Beto O'Rourke, Michelle Obama, Richard Ojeda, Deval Patrick (cont.)","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-21T09:08:05+00:00","tweet":"When Deval Patrick was running for gov here in MA, Obama (still a Senator, but post-Convention speech) stumped for him at a rally at the Reggie Lewis center. I went to the rally with a friend who elbowed her way to the front after Obama spoke, so she could shake his hand.","name":"deval patrick","Sentiment":-0.1},{"date":"2019-02-19T00:06:31+00:00","tweet":"that bain capital guy, Deval Patrick? …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-13T18:13:31+00:00","tweet":"No, Deval Patrick took his name out a couple months ago.","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-13T17:30:25+00:00","tweet":"And I’m afraid there might be active animosity towards her (for sexist reasons possibly) that would not necessarily be there for a Stacey Abrams or an Eric Holder or Deval Patrick or even Beto. (I expect they’d have issues with Biden tho.)","name":"deval patrick","Sentiment":-0.1833333333},{"date":"2019-02-11T01:39:41+00:00","tweet":"Thread on Northam: @DevalPatrick put it perfectly when he said that the Democratic Party and the country need to make room for both the woke and the still waking. We should have an honest conversation about why things like blackface are so offensive. 1\/x","name":"deval patrick","Sentiment":0.8},{"date":"2019-02-07T17:13:11+00:00","tweet":"Yes, it happened in Massachusetts in 2012 when Governor Deval Patrick unrolled a plan to vastly expand the size of the state Public Defender’s office. The private bar, which had previously handled 90% of criminal cases, went apoplectic.","name":"deval patrick","Sentiment":-0.1133333333},{"date":"2019-02-07T10:48:55+00:00","tweet":".@ewarren should hire @DevalPatrick to speak for her (again) — she can handle his $7500\/day fee right? #mapoli #caring","name":"deval patrick","Sentiment":0.2857142857},{"date":"2019-02-07T10:29:00+00:00","tweet":"I absentmindedly ate half a block of cheddar reading this Deval Patrick profile last year and now he's not even running. …","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-02-06T16:56:21+00:00","tweet":"It’s annoying to me too. I don’t trust charisma in general. I can’t be purist on that concept though. MA has tendency to vote for GOP governors & Deval Patrick’s charisma was a big factor","name":"deval patrick","Sentiment":-0.25},{"date":"2019-02-06T13:12:34+00:00","tweet":"not necessarily, there's different factions at work, Harris is Clinton backed and O'Rourke is where the Obama side turned when Deval Patrick went down in flames. Those two elements don't like each other very much but that's an inter-party rift you'll never see talked about on tv","name":"deval patrick","Sentiment":-0.0041111111},{"date":"2019-02-05T15:22:07+00:00","tweet":"i don't think that @CoryBooker and @BarackObama were ever a thing. I did hear that @BarackObama and @DevalPatrick were boyfriends at one time though. Those two were super close. I don't remember him and Booker ever even liking each other.","name":"deval patrick","Sentiment":0.1041666667},{"date":"2019-02-02T16:56:05+00:00","tweet":"Interesting take. You're tired of oppressed people expressing what we deem racist by insisting coded racist language isn't offensive. Who do you recall being called eloquent: Obama, Oprah, Condoleezza Rice, Deval Patrick. Stringing together a sentence is unremarkable.","name":"deval patrick","Sentiment":0.05},{"date":"2019-02-01T21:53:16+00:00","tweet":"To me, Cory Booker and Deval Patrick are kinda the same guy. Good people, but bland. Without fire.","name":"deval patrick","Sentiment":0.1777777778},{"date":"2019-02-01T21:37:00+00:00","tweet":"Considering I worked for Eric Garcetti AND Deval Patrick if you had told me which of my bosses would be running for President I would not have believed you","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-01T17:40:15+00:00","tweet":"Who are the two who weren't elected like Deval Patrick and Doug Wilder?","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-03T17:02:32+00:00","tweet":"Falmouth Turbine Blows Deval Patrick Democratic Presidential Bid Former Gov. Deval Patrick Haunted By August 3, 2010, Hidden Wind Turbine Letter That Caused Massive Litigation, Health, Property Takings Falmouth Massachusetts USA Apr 2, 2019 …","name":"deval patrick","Sentiment":-0.0555555556},{"date":"2019-04-03T13:05:06+00:00","tweet":"Excited to speak at @ColumbiaEship's #StartupColumbia this Friday alongside leaders @DevalPatrick @abigaildisney @MsAnneHCZ plus #EGFellow @shivsiroya. An amazing group of people leading the charge to change the world!","name":"deval patrick","Sentiment":0.5625},{"date":"2019-03-26T17:37:40+00:00","tweet":"Apr 5, #StartupColumbia Festival - changemakers who step up to make a positive impact. Join @abigaildisney, @MsAnneHCZ of @hczorg, @DevalPatrick,... Tactics, strategies for activism and entrepreneurship. Lunch @Columbia food founders. $250K prizes. Tkts:","name":"deval patrick","Sentiment":0.2272727273},{"date":"2019-03-25T10:01:14+00:00","tweet":"At #StartupColumbia Festival 2019, hear from changemakers @abigaildisney, @MsAnneHCZ of @hczorg, @DevalPatrick, and more. Join the conversation and find out how to make your own impact on Apr 5:","name":"deval patrick","Sentiment":0.55},{"date":"2019-03-24T19:25:44+00:00","tweet":"I got my start in politics on a campaign (h\/t @DevalPatrick 2010)—it launched remarkable opportunities. Check out @orgcorps2020, a program to train and pay young people this summer to be organizers. Apply: . Deadline is April 8. #oc2020 #corpsvalues #mapoli","name":"deval patrick","Sentiment":0.425},{"date":"2019-03-24T11:51:39+00:00","tweet":"Great to see leaders in the #impinv Space choosing to use existing reporting approaches. @DevalPatrick chose @GIIRSRatings for his fund. The next step is to shift to using the data to actively manage impact. …","name":"deval patrick","Sentiment":0.2222222222},{"date":"2019-03-19T18:30:31+00:00","tweet":".@DevalPatrick …. Shame on you ! #J4B #BethBrodie","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-18T10:02:01+00:00","tweet":"Deval Patrick, managing director of Bain Capital’s Double Impact Fund and former Massachusetts governor, says that for long-term benefits, investors need to consider people and the planet, not just their financial returns.","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-15T14:01:02+00:00","tweet":"\"Because if you ignore people, If you ignore the planet, those issues will come around to bite your financial bottom line in time. For me, it’s not such a big leap from there to impact investing,\" former Gov. Deval Patrick says.","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-15T09:34:44+00:00","tweet":"Need something to listen to on your commute home tonight? Boston's own @WBUR and @MeghnaWBUR just did a deep dive into impact investing, featuring @MarcGunther @DevalPatrick and @aposner1984! #ESG #impinv …","name":"deval patrick","Sentiment":0.3},{"date":"2019-03-11T16:52:12+00:00","tweet":"I agree! Thank you @DevalPatrick! …","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-11T10:53:17+00:00","tweet":"Thank you, @DevalPatrick! #RCV continues to be one of the top electoral reforms to build a more just and inclusive democracy. …","name":"deval patrick","Sentiment":0.5},{"date":"2019-03-11T09:19:16+00:00","tweet":"MAJOR NEW ENDORSEMENT️ Former Massachusetts Governor @DevalPatrick: \"#RankedChoiceVoting is a great innovation to bring more citizens into civic life. It's just what democracy needs to stay fresh.\" 🇺🇸 #MApoli #MAleg : Rappaport Center, CC 2.0","name":"deval patrick","Sentiment":0.2426948052},{"date":"2019-03-07T12:45:02+00:00","tweet":"People who have said they will not run for president: -Michael Bloomberg -Tom Steyer -Eric Garcetti -Sherrod Brown -Hillary Clinton -Michelle Obama -Michael Avenatti -Jeff Merkeley -Oprah Winfrey -Deval Patrick -Eric Holder","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-06T07:03:15+00:00","tweet":"No Booker, Harris, Biden, & definitely No Bernie put the Clowns back in the Circus we look like the Republicans please help the country Mr Deval Patrick. Run for the Office of the Presidency I support you 100%","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-06T06:59:57+00:00","tweet":"Please Run for the Presidency Mr Deval Patrick the country needs help! Some One gave the Clown the Keys to the Circus & let out all the jokers in the Democratic tent help! This is an S.O. S","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-05T15:18:15+00:00","tweet":"So great to have @DevalPatrick, former Massachusetts Governor and current managing director of @BainCapital Double Impact, in Hanover last week! A big thanks to the Visiting Executive Program, the Center for Business, Government & Society, and Black Students at Tuck for hosting!","name":"deval patrick","Sentiment":0.0768518519},{"date":"2019-03-05T11:10:19+00:00","tweet":"Some notable Democratic names who have explicitly ruled out a 2020 presidential bid: @ericgarcetti @EricHolder @JeffMerkley @HillaryClinton @DevalPatrick @TomSteyer @MichaelAvenatti @Bob_Casey @GavinNewsom @Oprah","name":"deval patrick","Sentiment":0.5},{"date":"2019-03-05T08:10:26+00:00","tweet":"This week, @EricHolder & @JeffMerkley passed on 2020 presidential bids, adding to the growing list of Ds sitting out the contest. That includes: @TomSteyer, @ericgarcetti, @DevalPatrick, @NYGovCuomo, @MichaelAvenatti, @MartinOMalley, @ChrisMurphyCT, @MitchLandrieu, @JasonKander","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-03T12:00:29+00:00","tweet":"At #StartupColumbia Festival 2019, hear from changemakers @abigaildisney, @MsAnneHCZ of @hczorg, @DevalPatrick, and more. Join the conversation and find out how to make your own impact on April 5:","name":"deval patrick","Sentiment":0.55},{"date":"2019-04-02T10:46:52+00:00","tweet":"Can you find out why Tax Payers in Assachusetts during the Deval Patrick Admin. paid close to a Billion $s to a China Web designer for a Healthcare Website? When we already had one!!","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-30T21:03:40+00:00","tweet":"Sorry to see Al Macs Diner close. If you wanted to meet people on the campaign trail it was the spot! @DevalPatrick #mapoli","name":"deval patrick","Sentiment":-0.625},{"date":"2019-03-29T21:16:14+00:00","tweet":"A Reason to Believe by Gov Deval Patrick is an inspiration!#Service","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-27T13:06:42+00:00","tweet":"Gee, @DevalPatrick didn't run, @dank is a low level ward heel and @jay4ma is a laughing stock still. Can't imagine why your PAC is closing! Oh, well, John, keep aiming high!! #mapoli …","name":"deval patrick","Sentiment":0.125},{"date":"2019-03-27T09:41:13+00:00","tweet":"Talk about an interesting career.. former Chief of Staff for Massachusetts Governor Deval Patrick is the founder of @HUBweek, Boston's version of SXSW. I'm grateful to have sat down w\/ @brendanbrendan for the last episode of @BostonSpeaksUp … #BostonSpeaksUp","name":"deval patrick","Sentiment":0.0861111111},{"date":"2019-03-26T09:16:24+00:00","tweet":"Deval Patrick (Bain Capital) and Tracy Palandjian (Social Finance) starting off with their keynote presentation on impact investing and much more! #PartnerConnectEvents","name":"deval patrick","Sentiment":0.2194444444},{"date":"2019-03-23T11:44:15+00:00","tweet":"And the best part is Deval Patrick blew $23 million on tracks they didn't even use …","name":"deval patrick","Sentiment":1.0},{"date":"2019-03-22T21:43:29+00:00","tweet":"Yup. Once Deval Patrick exited the race, Obama, who appargently doesn't think a woman can win, looked around for a charismatic white male rather than go with Hillary's choice of a WOC, Kamala Harris. It would not shock me one bit to see thise two share a ticket.","name":"deval patrick","Sentiment":0.325},{"date":"2019-03-21T09:56:58+00:00","tweet":"It is time. Thank you @DevalPatrick for being MA Governor and signing this bill in support of the National Popular Vote …","name":"deval patrick","Sentiment":0.6},{"date":"2019-03-18T09:06:46+00:00","tweet":"Missing Abrams & Moulton in 🤔; Deval Patrick, Eric Holder, Tom Steyer, Howard Schultz in","name":"deval patrick","Sentiment":-0.2},{"date":"2019-03-13T16:52:54+00:00","tweet":"And there are lots more where that came from:","name":"deval patrick","Sentiment":0.5},{"date":"2019-03-13T13:56:15+00:00","tweet":"Lots of other endorsements too @Lalaluv420. bernie sanders, ayanna pressley, seth moulton, jill stein, andrew yang, etc. the list goes on. Its an easy thing for people to get behind","name":"deval patrick","Sentiment":-0.0305555556},{"date":"2019-03-12T20:30:01+00:00","tweet":"I realize, by the way, you know all this...I just like to recite stuff to make sure I know what I’m talking about.","name":"deval patrick","Sentiment":0.5},{"date":"2019-03-07T18:21:11+00:00","tweet":"@DNC Pres hopefuls rep states with the greatest disparity in non-white ed. spending. CA 20%<-@KamalaHarris TX 7%< @SecretaryCastro New York 10%< @SenGillibrand @HillaryClinton New Jersey <18% @SenBooker Mass 12%<@SenWarren and @DevalPatrick WA18%<@JayInslee All career politicians","name":"deval patrick","Sentiment":0.4242424242},{"date":"2019-03-06T09:51:30+00:00","tweet":"WHEN THE OCEANS DIE WE DIEWhen will someone finally speak of this horrifying emergency & step up?! #saveourocean @TomSteyer @DevalPatrick @JayInslee @amyklobuchar @TulsiGabbard @PeteButtigieg @JoeBiden @SenFeinstein @SenSchumer @JulianCastro @SenGillibrand @maziehirono @senator","name":"deval patrick","Sentiment":-0.5},{"date":"2019-03-05T15:31:48+00:00","tweet":"You could make it 8 not running\/ dropped out including @HillaryClinton …","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-05T15:10:08+00:00","tweet":"\"Sometimes the story behind the art is as compelling as the art itself.\" - Deval Patrick, Managing Director at Bain Capital","name":"deval patrick","Sentiment":-0.05},{"date":"2019-03-04T17:02:29+00:00","tweet":"I am very proud of my friend and former @DevalPatrick teammate @dan_burgess_ for his appointment as @GovJanetMills new Energy Director. He is a great choice to help Maine become a #cleanenergy and #ClimateAction leader.","name":"deval patrick","Sentiment":0.4840909091},{"date":"2019-03-01T13:03:16+00:00","tweet":"Imagine the reverse of this quote from a black elected official - like if Deval Patrick, another former governor from New England said, “Black people will not have anything to say. It’s only going to be the whites who would elect.” …","name":"deval patrick","Sentiment":0.1005050505},{"date":"2019-02-27T11:02:59+00:00","tweet":"This Sunday we invited students from the Epiphany School to our BPYO concert as part of our Community Partnership. The young audience members had the opportunity to meet Deval Patrick, Benjamin Zander, and attend the full concert free of charge!","name":"deval patrick","Sentiment":0.3166666667},{"date":"2019-02-27T00:54:53+00:00","tweet":"Former Massachusetts governor and @BainCapital Double Impact Managing Director @DevalPatrick speaks at @TuckSchool: “In a democracy, we get the government we deserve. If we want better, it’s up to us to demand more of our candidates.”","name":"deval patrick","Sentiment":0.25},{"date":"2019-02-26T09:57:26+00:00","tweet":"Governor Patrick’s eloquent encouragement to seek out common ground and shared values and “turn toward each other, rather than against one another” remains a guiding principle of our 351 community. #blackhistorymonth","name":"deval patrick","Sentiment":-0.2125},{"date":"2019-02-26T09:56:29+00:00","tweet":"Governor @DevalPatrick made history in Massachusetts as our first African American Governor. As our founding Honorary Chair, his relentless belief in the vision of Project 351 in our nine years has helped ensure 3,381 eighth graders have engaged as Ambassadors.","name":"deval patrick","Sentiment":0.0833333333},{"date":"2019-02-20T20:50:19+00:00","tweet":"Maybe he's #With @BTVJoan as well! (Plus here's one from the vault w\/ @BryanAubin @DevalPatrick & @MiroBTV)","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-19T22:49:30+00:00","tweet":"Jurisdictions with #RankedChoiceVoting are electing more women, have higher rates of turnout & civility, & are electing majority winners!","name":"deval patrick","Sentiment":0.40625},{"date":"2019-02-19T13:29:54+00:00","tweet":"We've had WEEKS of bad faith, nasty articles and online behavior vilifying Beto, Kamala, Deval Patrick, Klobuchar, and Warren. You clearly think that's fine.","name":"deval patrick","Sentiment":-0.2958333333},{"date":"2019-02-19T09:36:50+00:00","tweet":"LISTEN: our executive director Adam Friedman talks with former @massgop chair @JenniferNassour and former @DevalPatrick comms director @jessemermell about #RankedChoiceVoting on the @CommonWealthMag #Codcast #mapoli …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-19T00:06:31+00:00","tweet":"that bain capital guy, Deval Patrick? …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-18T11:10:26+00:00","tweet":"Today we celebrate the Democratic African American Governors! Thank you for your leadership and example! @GovernorWilder @DevalPatrick and @NYGovPaterson55","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-17T21:11:29+00:00","tweet":"“Policy only matters at the point at which it touches people,” Governor Deval Patrick. In our policy making around #ClimateAction we should think of the social & economic impact on our community, while simultaneously touching people ie saving the planet 4 future generations.(4\/4)","name":"deval patrick","Sentiment":0.1466666667},{"date":"2019-02-14T18:00:52+00:00","tweet":"Kamala Harris showing early strength with Deval Patrick’s loyal network with this fundraiser …","name":"deval patrick","Sentiment":0.2166666667},{"date":"2019-02-13T18:13:31+00:00","tweet":"No, Deval Patrick took his name out a couple months ago.","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-12T21:28:00+00:00","tweet":"#maddow we have got a great group of candidates. love (almost) all of them. Cory Booker definitely among them! Was hoping to see Deval Patrick in there too.","name":"deval patrick","Sentiment":0.4333333333},{"date":"2019-02-12T18:02:12+00:00","tweet":"Deval Patrick: Not the hero we need, but the hero we deserve. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-06T18:46:06+00:00","tweet":"Thank you @MarcRPacheco, Deval Patrick, et al. for the landmark GWSA. And TY @CLF, @GEConsumers & teen plaintiffs for winning the suit against the Baker admin to force baker to follow the law. … …","name":"deval patrick","Sentiment":0.25},{"date":"2019-02-06T14:15:50+00:00","tweet":"\"We believe that we owe the next generation a better country than we found and that every American has a stake in that. We believe that in times like these we should turn to each other, not on each other. [...] That's what Democrats believe.\" - Governor @DevalPatrick #BHM","name":"deval patrick","Sentiment":0.05},{"date":"2019-02-04T14:48:51+00:00","tweet":"Um former Massachusetts Governor Deval Patrick?","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-04T12:05:47+00:00","tweet":"ONLY the second African-American governor of Virginia?? How many have your state had? ONE is the record... held by 4 states. 2 elected, 2 appointed. Doug Wilder, Deval Patrick; Pinchback, Paterson. Message to Gov. Northam: The shoe polish NEVER comes off. ALL will see it FOREVER","name":"deval patrick","Sentiment":0.1666666667},{"date":"2019-02-04T11:49:45+00:00","tweet":"they said the same thing about Deval Patrick......he's disappeared from the scene","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-04T11:48:54+00:00","tweet":"While there were at least three non-elected African-American governors, only two were ever ELECTED to serve as governor in the history of the United States: Douglas Wilder and Deval Patrick.","name":"deval patrick","Sentiment":-0.15},{"date":"2019-02-04T07:44:28+00:00","tweet":"1989 Doug Wilder, Virginia; 2006 Deval Patrick, Mass were 1st and 2nd black governors","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-02-04T07:15:31+00:00","tweet":"@DevalPatrick Hope all is going well!! Book will be on Audio this month! Exciting!!","name":"deval patrick","Sentiment":0.46875},{"date":"2019-02-03T21:34:06+00:00","tweet":"@DevalPatrick you’ve been awfully quiet.","name":"deval patrick","Sentiment":0.0},{"date":"2019-02-03T20:30:49+00:00","tweet":"I’ve seen attacks on @KamalaHarris @CoryBooker & @DevalPatrick...& a very creepy centralized attack on those 3 in this article: … I’ve seen people I respect post this, & gleefully try to tear these 3 down, but let’s take a deeper dive into the “criticism.”","name":"deval patrick","Sentiment":-0.4027777778},{"date":"2019-02-03T14:41:10+00:00","tweet":"I also don't foresee many other African-Americans entering (Deval Patrick passed, maybe Eric Holder?). Harris, Booker, and Biden racing for that vote IMO","name":"deval patrick","Sentiment":0.1875},{"date":"2019-02-03T14:11:02+00:00","tweet":"I honestly think folks are overthinking it -- the guy just gives off a vibe that say Deval Patrick does not. It's the most like John Edwards of recent Dems -- a lack of comfort in his own skin.","name":"deval patrick","Sentiment":0.425},{"date":"2019-02-03T13:35:44+00:00","tweet":"Well young Adam P, if you paid attention efforts to properly fund transportation needs over the past 10-12 years have not been particularly successful despite the admirable efforts of @DevalPatrick","name":"deval patrick","Sentiment":0.15},{"date":"2019-02-03T10:55:50+00:00","tweet":"Why leftists don't trust Kamala Harris, Cory Booker, and Deval Patrick …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-02T13:53:44+00:00","tweet":"Congratulations @NorthernEssex and @NECCPrez on winning the Deval Patrick Award from the @bostonfdn … …","name":"deval patrick","Sentiment":0.5},{"date":"2019-05-01T21:30:52+00:00","tweet":"Thank you, @bostonfdn, for awarding @NCustodiaLora and @NorthernEssex the 2019 Deval Patrick Prize for Community Colleges for @PIESLatinosNECC, which has helped over 600 immigrants validate their educational credentials, improve English skills, and move into meaningful careers.","name":"deval patrick","Sentiment":0.25},{"date":"2019-05-01T15:32:12+00:00","tweet":"Thrilled to join our friends at the Boston Foundation @bostonfdn for discussion on preparing the future workforce and celebrating Deval Patrick Prize for innovative community college leadership with @JayAshMACP @bostonchamber @MassLWD","name":"deval patrick","Sentiment":0.3666666667},{"date":"2019-04-27T14:09:03+00:00","tweet":"4)\"UNMASKING THE COVERED-UP CONNECTION OF ROBERT MUELLER AND DEVAL PATRICK DOJ altered Massachusetts court docket to hide Robert S. Meuller’s prior associations with Deval Patrick—Obama’s choice to challenge Trump in 2020 Now that is a secret worth hiding, Mr. Mueller...","name":"deval patrick","Sentiment":-0.0333333333},{"date":"2019-04-23T12:24:14+00:00","tweet":"I’m still waiting for comment from MA-based presidential contenders @senwarren and @sethmoulton. And, for that matter, @DevalPatrick & @joekennedy.","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-20T19:22:48+00:00","tweet":"Rev. Haywood was one of my precinct captains for Deval Patrick back in 2006. A very good man. May his memory be a blessing. …","name":"deval patrick","Sentiment":0.455},{"date":"2019-04-18T22:06:06+00:00","tweet":"Deval Patrick was the first Democratic Governor since Dukakis.","name":"deval patrick","Sentiment":0.25},{"date":"2019-04-18T17:06:17+00:00","tweet":"Our President & Director-Counsel @Sifill_LDF was named a member of the @americanacad! @MichelleObama President of the Andrew W. Mellon Foundation @ProfessorEA & LDF alum @DevalPatrick were also inducted. Congrats to all the new members!","name":"deval patrick","Sentiment":0.1704545455},{"date":"2019-04-17T17:43:28+00:00","tweet":"Some of the advisers: Robert Gibbs, Ed Gillespie, Jennifer Granholm, Bill Kristol, Mike Morell, Mike Murphy, Penny Pritzker, Deval Patrick, Bret Stephens, Neera Tanden and Howard Wolfson. It's like a cable news contributor roster.","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-17T09:55:37+00:00","tweet":"New members of the American Academy of Arts and Sciences include @MichelleObama, @MichelMcQMartin, @JamesFallows, @emilybazelon, Judith Butler, Jonathan Franzen, Merrick Garland, @Sifill_LDF, @joesbigidea, @DevalPatrick, and @AnnaDeavereS: .","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-04-12T09:06:23+00:00","tweet":"\"The qualities of a leader, regardless whether the setting is political or business or law, are basically the same: Intellectual honesty, rigor, curiosity and humility.\" How Deval Patrick Shaped A Life Worth Living … @Real_Leaders @BCorporation @DevalPatrick","name":"deval patrick","Sentiment":0.15},{"date":"2019-04-10T22:52:27+00:00","tweet":"\"Legend and Teigen followed a rousing speech by Deval Patrick, the former governor of Massachusetts, who urged Democrats to fight for their beliefs — and to stick together doing it.\" Naturally a Bain Capital executive gets to inspire the Dem caucus.","name":"deval patrick","Sentiment":0.05},{"date":"2019-04-10T21:12:37+00:00","tweet":"Tonight, at the @HouseDemocrats conference, we were joined by my friend #MA Gov @DevalPatrick who asked, “Since when do we yell hate and whisper kindness?” Wise words. So much more can be accomplished when we listen & try to understand each other. #ForThePeople","name":"deval patrick","Sentiment":0.095},{"date":"2019-04-10T20:38:23+00:00","tweet":"Deval Patrick: Democrats need to be \"the party of the woke as well as the still waking\" I'm kinda falling asleep tho …","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-10T20:22:24+00:00","tweet":"Former Mass Gov Deval Patrick, pretty much the only high profile Dem not running for president, is urging House Dems to stop being wimps by cowing to GOP talking points and to stop fractionalizing into wings of the party. “Be Democrats,” he said","name":"deval patrick","Sentiment":0.122},{"date":"2019-04-10T20:16:30+00:00","tweet":"Deval Patrick tells House Democrats at their annual retreat, \"The Democratic Party was made for this moment” (Patrick's walkout song was Springsteen's \"We take care of our own\")","name":"deval patrick","Sentiment":0.6},{"date":"2019-04-10T08:00:52+00:00","tweet":"Falmouth Turbine Blows Deval Patrick Democratic Presidential Bid Former Gov. Deval Patrick Haunted By August 3, 2010, Hidden Wind Turbine Letter That Caused Massive Litigation, Health, Property Takings Falmouth Massachusetts USA Apr 2, 2019 …","name":"deval patrick","Sentiment":-0.0555555556},{"date":"2019-04-06T10:22:27+00:00","tweet":"Here I am with then MA governor @DevalPatrick, @SpfldMACityHall mayor Domenic Sarno, and Bishop Bryant Robinson looking over construction progress of Macedonia #COGIC after it was burned by 3 white supremacists the night of Obama‘s election. And in 2019...#LouisianaParish","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-05T16:26:44+00:00","tweet":"Have the pleasure of being in the company of several Black trailblazers today at #StartupColumbia: Gov. @DevalPatrick (Bain Capital Double Impact), @cheryldorsey (Echoing Green) & @MsAnneHCZ (Harlem Children's Zone). Happy to see the theme of social justice. @ColumbiaEship","name":"deval patrick","Sentiment":0.0777777778},{"date":"2019-05-02T21:30:49+00:00","tweet":"Seems like more than 2 years ago doesn't it, @BlendedValue @Kevindoylejones @RDFoxworth @DevalPatrick ? (thanks for the like @mattzieger ) …","name":"deval patrick","Sentiment":0.35},{"date":"2019-05-02T07:00:24+00:00","tweet":"WOW, what an experience! They must have such incredible memories of it. This just came out in paper. It was published online in Oct. …","name":"deval patrick","Sentiment":0.3416666667},{"date":"2019-05-01T20:20:27+00:00","tweet":"You bet I ordered the paper copy. @HowardJournal @DevalPatrick #Rhetoric @UofHartford","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-01T16:19:31+00:00","tweet":"Good turnout and discussion as we look at how paid internships can benefit community college students and employers. Next hour: we announce the winner of the 2019 Deval Patrick Prize for Community Colleges.","name":"deval patrick","Sentiment":0.35},{"date":"2019-04-30T16:19:06+00:00","tweet":"Tomorrow, @MassasoitPres joins the @bostonfdn's panel discussion on the landscape for #communitycollege internships in Mass. and elsewhere. The Deval Patrick Prize for Community Colleges will also be awarded:","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-30T15:33:22+00:00","tweet":"In these times of crisis, & in the words of former Governor @DevalPatrick, we must remember to “turn to each other rather than on each other.” I stand in solidarity with all Jewish people & encourage everyone to continue to show compassion toward all. #LoveTrumpsHate.","name":"deval patrick","Sentiment":-0.0625},{"date":"2019-04-28T17:36:20+00:00","tweet":"Don't forget, this Wednesday at 3, it's a big afternoon for community colleges - a new report and discussion of the opportunity for paid internships, followed by the announcement of The Deval Patrick Prize for Community Colleges","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-04-19T20:20:39+00:00","tweet":"Mitt was my governor. I voted for him. Then we got saddled with RomneyCare. Then he decided to become a one-term governor because, I could only surmise, he was afraid to lose. Then we got saddled with Deval Patrick. This man was a loser long before he got spanked by Obama.","name":"deval patrick","Sentiment":-0.2166666667},{"date":"2019-04-18T18:36:08+00:00","tweet":"I was a mediocre waitress at Porters near TD Garden on the Deval Patrick re-elect in 2010! Much better as a cater waitress back in high school in Wellington, West Palm Beach, & Palm Beach Working in service sector is both deeply credible & teaches you more than any internship","name":"deval patrick","Sentiment":0.1692857143},{"date":"2019-04-18T14:04:30+00:00","tweet":"We are pleased to announce that former Massachusetts Governor @DevalPatrick will be serving as our keynote speaker at #TMTS2019. Don’t forget to register here before early bird rates end TOMORROW:","name":"deval patrick","Sentiment":0.2},{"date":"2019-04-16T17:23:00+00:00","tweet":"Don't worry! If you missed our @asugsvsummit panel on how employers are investing in talent with @oates_jane, @DevalPatrick, @frankbritt, @CathiCanfield and @ZoeWeintraub, you can watch it here! #WorkingNationOverheard #asugsv2019 #asugsv #asugsvsummit","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-14T19:16:48+00:00","tweet":"Sorry but Pete is no Barack. Comparing him is offensive and belittles what Obama has accomplished so far in his life. There’s only one Barack, just know that. Pete is not even as good as Cory Booker or Deval Patrick in their speaking abilities. So disappointed in your tweet","name":"deval patrick","Sentiment":-0.0416666667},{"date":"2019-04-13T14:17:20+00:00","tweet":"Not sure who the woman is on @MSNBC commenting on the @CoryBooker speech, but I need her to know that he was not doing an Obama style speech. Booker has been giving impassioned speeches before Obama was known. Booker and @DevalPatrick have been doing this for years.","name":"deval patrick","Sentiment":-0.25},{"date":"2019-04-10T22:52:45+00:00","tweet":"Meanwhile, the Teigen\/Legend warm-up act @DevalPatrick gave a rousing speech that sounded like a version of a stump speech he would’ve given if he ran for president …","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-10T20:28:09+00:00","tweet":"He didn't say Trump but... pretty clear he means Trump. \"Just as you don't have to hate Republicans to be a good Democrat, leaders don't have to hate the faceless others to be a good leader,\" ex-Gov. Deval Patrick tells Democrats.","name":"deval patrick","Sentiment":0.025},{"date":"2019-04-10T20:15:20+00:00","tweet":"Rep. Ayanna Pressley introduces former Gov. Deval Patrick at the House Democratic retreat, says as a Kerry staffer she advised Kerry not to endorse Patrick. \"I’m damn proud to say that I was wrong\"","name":"deval patrick","Sentiment":0.1},{"date":"2019-04-09T18:16:26+00:00","tweet":"“The lives of people depend on their education and their skills development.” -@DevalPatrick #WorkingNationOverheard #ASUGSV19 #ASUGSVSummit2019 #ASUGSV @oates_jane @WorkingNation","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-09T18:15:38+00:00","tweet":"The lives of mpeople, meeting their needs to have economic mobility depends on education and skills development. -Honorable Deval Patrick. #devalpatrick #WorkingNationOverheard @BainCapital @asugsvsummit","name":"deval patrick","Sentiment":0.2},{"date":"2019-04-09T18:03:56+00:00","tweet":"“One of the key gaps to cross - is the connection between the learner and the employer.” -Hon. Deval Patrick @BainCapVC #WorkingNationOverheard #ASUGSV2019 #asugsvsummit2019 #asugsv @oates_jane @WorkingNation","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-05T16:02:03+00:00","tweet":"View from backstage as @DevalPatrick and @cheryldorsey talk about backing businesses and people who are making an impact and the power of collaboration to tackle challenges that are too big for any one section to deal with. #StartupColumbia","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-05T15:56:04+00:00","tweet":"Whatever you do, you don’t check your conscience at the door. You bring it to the work you do - @DevalPatrick at #StartupColumbia","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-05T15:43:29+00:00","tweet":"Interested in When Large Institutions Affect Social Change and When They Don’t? We have @DevalPatrick Managing Director of Bain Capital in conversation with @cheryldorsey president of @echoinggreen to unpack it for you. #StartupColumbia","name":"deval patrick","Sentiment":0.1658730159},{"date":"2019-04-05T15:05:16+00:00","tweet":"Beto Orourke and Deval Patrick 2020 #FridayFeeling #FridayMotivation","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-05T13:08:24+00:00","tweet":"Most \"plagiarism\" scandals in politics are penny-ante nonsense (\"Obama cribbed a line or two from Deval Patrick. The horror.\") but not Joe's. Oh no.","name":"deval patrick","Sentiment":0.5},{"date":"2019-04-05T10:41:00+00:00","tweet":"On 4\/9, @oates_jane will lead #asugsvsummit discussion, \"Investing in Talent: How Employers Are Driving Economic Mobility in the New Skills Economy,\" w\/ @DevalPatrick, @frankbritt, @CathiCanfield of @EmployBridge, & @ZoeWeintraub of @GuildEducation. …","name":"deval patrick","Sentiment":0.1681818182},{"date":"2019-04-05T09:06:02+00:00","tweet":"Excited to be speaking along with @abigaildisney @DevalPatrick @cheryldorsey and so many other inspirations today!","name":"deval patrick","Sentiment":0.2395833333},{"date":"2019-04-03T13:05:06+00:00","tweet":"Excited to speak at @ColumbiaEship's #StartupColumbia this Friday alongside leaders @DevalPatrick @abigaildisney @MsAnneHCZ plus #EGFellow @shivsiroya. An amazing group of people leading the charge to change the world!","name":"deval patrick","Sentiment":0.5625},{"date":"2019-04-02T10:46:52+00:00","tweet":"Can you find out why Tax Payers in Assachusetts during the Deval Patrick Admin. paid close to a Billion $s to a China Web designer for a Healthcare Website? When we already had one!!","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-27T13:06:42+00:00","tweet":"Gee, @DevalPatrick didn't run, @dank is a low level ward heel and @jay4ma is a laughing stock still. Can't imagine why your PAC is closing! Oh, well, John, keep aiming high!! #mapoli …","name":"deval patrick","Sentiment":0.125},{"date":"2019-03-27T09:41:13+00:00","tweet":"Talk about an interesting career.. former Chief of Staff for Massachusetts Governor Deval Patrick is the founder of @HUBweek, Boston's version of SXSW. I'm grateful to have sat down w\/ @brendanbrendan for the last episode of @BostonSpeaksUp … #BostonSpeaksUp","name":"deval patrick","Sentiment":0.0861111111},{"date":"2019-03-26T17:37:40+00:00","tweet":"Apr 5, #StartupColumbia Festival - changemakers who step up to make a positive impact. Join @abigaildisney, @MsAnneHCZ of @hczorg, @DevalPatrick,... Tactics, strategies for activism and entrepreneurship. Lunch @Columbia food founders. $250K prizes. Tkts:","name":"deval patrick","Sentiment":0.2272727273},{"date":"2019-03-25T10:01:14+00:00","tweet":"At #StartupColumbia Festival 2019, hear from changemakers @abigaildisney, @MsAnneHCZ of @hczorg, @DevalPatrick, and more. Join the conversation and find out how to make your own impact on Apr 5:","name":"deval patrick","Sentiment":0.55},{"date":"2019-03-24T19:25:44+00:00","tweet":"I got my start in politics on a campaign (h\/t @DevalPatrick 2010)—it launched remarkable opportunities. Check out @orgcorps2020, a program to train and pay young people this summer to be organizers. Apply: . Deadline is April 8. #oc2020 #corpsvalues #mapoli","name":"deval patrick","Sentiment":0.425},{"date":"2019-03-24T11:51:39+00:00","tweet":"Great to see leaders in the #impinv Space choosing to use existing reporting approaches. @DevalPatrick chose @GIIRSRatings for his fund. The next step is to shift to using the data to actively manage impact. …","name":"deval patrick","Sentiment":0.2222222222},{"date":"2019-03-22T21:43:29+00:00","tweet":"Yup. Once Deval Patrick exited the race, Obama, who appargently doesn't think a woman can win, looked around for a charismatic white male rather than go with Hillary's choice of a WOC, Kamala Harris. It would not shock me one bit to see thise two share a ticket.","name":"deval patrick","Sentiment":0.325},{"date":"2019-03-19T18:30:31+00:00","tweet":".@DevalPatrick …. Shame on you ! #J4B #BethBrodie","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-18T10:02:01+00:00","tweet":"Deval Patrick, managing director of Bain Capital’s Double Impact Fund and former Massachusetts governor, says that for long-term benefits, investors need to consider people and the planet, not just their financial returns.","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-15T14:01:02+00:00","tweet":"\"Because if you ignore people, If you ignore the planet, those issues will come around to bite your financial bottom line in time. For me, it’s not such a big leap from there to impact investing,\" former Gov. Deval Patrick says.","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-15T09:34:44+00:00","tweet":"Need something to listen to on your commute home tonight? Boston's own @WBUR and @MeghnaWBUR just did a deep dive into impact investing, featuring @MarcGunther @DevalPatrick and @aposner1984! #ESG #impinv …","name":"deval patrick","Sentiment":0.3},{"date":"2019-03-11T16:52:12+00:00","tweet":"I agree! Thank you @DevalPatrick! …","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-11T10:53:17+00:00","tweet":"Thank you, @DevalPatrick! #RCV continues to be one of the top electoral reforms to build a more just and inclusive democracy. …","name":"deval patrick","Sentiment":0.5},{"date":"2019-03-11T09:19:16+00:00","tweet":"MAJOR NEW ENDORSEMENT️ Former Massachusetts Governor @DevalPatrick: \"#RankedChoiceVoting is a great innovation to bring more citizens into civic life. It's just what democracy needs to stay fresh.\" 🇺🇸 #MApoli #MAleg : Rappaport Center, CC 2.0","name":"deval patrick","Sentiment":0.2426948052},{"date":"2019-03-07T12:45:02+00:00","tweet":"People who have said they will not run for president: -Michael Bloomberg -Tom Steyer -Eric Garcetti -Sherrod Brown -Hillary Clinton -Michelle Obama -Michael Avenatti -Jeff Merkeley -Oprah Winfrey -Deval Patrick -Eric Holder","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-06T09:51:30+00:00","tweet":"WHEN THE OCEANS DIE WE DIEWhen will someone finally speak of this horrifying emergency & step up?! #saveourocean @TomSteyer @DevalPatrick @JayInslee @amyklobuchar @TulsiGabbard @PeteButtigieg @JoeBiden @SenFeinstein @SenSchumer @JulianCastro @SenGillibrand @maziehirono @senator","name":"deval patrick","Sentiment":-0.5},{"date":"2019-03-06T07:03:15+00:00","tweet":"No Booker, Harris, Biden, & definitely No Bernie put the Clowns back in the Circus we look like the Republicans please help the country Mr Deval Patrick. Run for the Office of the Presidency I support you 100%","name":"deval patrick","Sentiment":0.0},{"date":"2019-03-06T06:59:57+00:00","tweet":"Please Run for the Presidency Mr Deval Patrick the country needs help! Some One gave the Clown the Keys to the Circus & let out all the jokers in the Democratic tent help! This is an S.O. S","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-05T10:58:08+00:00","tweet":"@adrane or @DevalPatrick - both amazing storytellers - but i'm betting you already have both on your list","name":"deval patrick","Sentiment":0.6},{"date":"2019-06-04T18:38:00+00:00","tweet":"Mayoral portrait of Tim Murray to be unveiled Friday in Worcester City Hall @NCKotsopoulos @chamberworc @TweetWorcester @DevalPatrick @MayorPetty","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-03T10:54:34+00:00","tweet":"Lol! Ken Kimmell is president of the Union of Concerned Scientists, former partner in \"BCK Law”, & former DEP Commissioner under MA Gov Deval Patrick. Ken Kimmell has a wind scam legacy detailed, here, in a copy of Public Comments to the State of MA- …","name":"deval patrick","Sentiment":0.28},{"date":"2019-06-01T10:15:53+00:00","tweet":"The Parole Board\/Advisory Board of Pardons (in Massachusetts the Parole Board is the Advisory Board of Pardons) held a clemency hearing for Arnie King (pic) in 2007 & unanimously supported his clemency. @DevalPatrick, MA Governor at the time, did not act. #reviveclemency #mapoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-31T09:14:20+00:00","tweet":"Thanks @AnnikaHom @BostonGlobe for spreading the great news that we received The Deval Patrick Prize for Community Colleges from the @bostonfdn for the PIÉS Latinos de NECC that helps immigrants pursue professional development.","name":"deval patrick","Sentiment":0.3666666667},{"date":"2019-05-28T23:23:10+00:00","tweet":"Warren is running the race she wants to run, not the race a garden-variety D consultant or horse-race commentator would have her run. Reminds me a little of Deval Patrick c. 2005-6. (+ more policy papers, obvs) …","name":"deval patrick","Sentiment":0.1708333333},{"date":"2019-05-23T20:10:00+00:00","tweet":"WATCH: Dean @RisaGoluboff discusses the political philosophy underpinning American democracy with @MelodyCBarnes, @DevalPatrick, @AmbassadorRice and @Peter_Wehner at @Miller_Center’s Presidential Ideas Festival. #PrezFest …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-22T11:10:00+00:00","tweet":"I’m looking forward to the “Why Democracy?” panel with @MelodyCBarnes, @DevalPatrick, @AmbassadorRice and @Peter_Wehner at @Miller_Center’s Presidential Ideas Festival on Thursday. It should be a fascinating discussion. #PrezFest","name":"deval patrick","Sentiment":0.7},{"date":"2019-05-17T09:21:11+00:00","tweet":"That’s offensive and absurd. He’s not a “serial harasser”. He had an affair. Bill Clinton is the first POTUS to so much as utter the word lesbian. It took him four tries to get an African American assistant AG appointed, Deval Patrick, who Republicans dubbed “quota king”.","name":"deval patrick","Sentiment":-0.0583333333},{"date":"2019-05-16T07:26:43+00:00","tweet":"I’m so grateful to @urbaninstitute for inviting me to join this panel yesterday at #UrbanNext50. A conversation about where change comes from w\/ @DevalPatrick @aijenpoo @MichaelDTubbs & @Citi’s Ed Skyler that inspired me so much. #RiseOfRest @RiseOfRest","name":"deval patrick","Sentiment":0.2},{"date":"2019-05-16T01:48:53+00:00","tweet":"Here's what I'm thinking right now: The Dem primary electorate really wants Barack Obama to be the nominee. But since that's not possible, they want the next closet thing. Obamaworld sensed this and were *really* pushing Deval Patrick to run. But bc of Bain etc, he didn't. \/1","name":"deval patrick","Sentiment":0.180952381},{"date":"2019-05-15T17:04:53+00:00","tweet":"‘Right now the character of our country is at play and it is exciting how many people are coming off the sidelines to engage’, @DevalPatrick #UrbanNext50","name":"deval patrick","Sentiment":0.3619047619},{"date":"2019-05-15T16:25:15+00:00","tweet":".@DevalPatrick leading a fascinating discussion with @aijenpoo @MichaelDTubbs @AnnaMasonDC @edskyler at @urbaninstitute: Where Does Change Come From? The Role of Business, Activists, and the Public Sector.","name":"deval patrick","Sentiment":0.35},{"date":"2019-05-15T16:16:06+00:00","tweet":"Another great #urbanNext50 panel: discussing where change comes from with Mayor @MichaelDTubbs of @StocktonUpdates, @aijenpoo of @domesticworkers, @DevalPatrick now of @BainCapital, @edskyler of @Citibank, and @AnnaMasonDC of @RiseOfRest. – at Urban Institute","name":"deval patrick","Sentiment":0.4},{"date":"2019-05-15T16:12:14+00:00","tweet":"Now: Where does change come from? feat. @DevalPatrick, @annamasondc, @aijenpoo, @edskyler, & @MichaelDTubbs. #UrbanNext50 …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-15T12:50:01+00:00","tweet":"Deval Patrick: Sense of Hillary Clinton Entitlement is ‘Off-Putting’ To Voters. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-14T16:55:10+00:00","tweet":"Last month @cheryldorsey, SICI's #BeckVSI and president of @echoinggreen, sat down with Gov @DevalPatrick for a conversation on race, sexism, and progress in the world of #entrepreneurship. The video is now live at via @YouTube @columbiaEship","name":"deval patrick","Sentiment":-0.0063973064},{"date":"2019-05-14T14:37:42+00:00","tweet":"GE exec William “Mo” Cowan will succeed Ann Klee as the leader of GE's Boston operations, @bygregryan reports. Cowan, joined GE in 2017 from local lobbying power ML Strategies, and was previously a top aide to Gov. Deval Patrick. $GE …","name":"deval patrick","Sentiment":0.25},{"date":"2019-05-13T14:18:01+00:00","tweet":"Secretary Rosalin Acosta awards Northern Essex Community College the Deval Patrick Prize for Community Colleges at the Boston Foundation. Congratulations, @NorthernEssex!","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-05T17:08:07+00:00","tweet":"Second time (or more) for Biden plagiarism. Also remember Deval Patrick speech of 2005? and Obama speech of 08? Just Words? - sounded awfully much alike.","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-06-05T11:49:03+00:00","tweet":"“There is power in collaboration, but only if it is real and not just everyone stating their position. There is humility in collaboration.” -Deval Patrick at #reworkinglunch @FoodCorps @BainCapital","name":"deval patrick","Sentiment":0.1},{"date":"2019-06-04T18:39:22+00:00","tweet":"Tim’s a great guy. Please let’s keep the comments positive.","name":"deval patrick","Sentiment":0.5136363636},{"date":"2019-06-04T15:08:29+00:00","tweet":"packed room today for environmental justice hearing. Gov Deval Patrick signed an EJ executive order 5 years ago, but the legislature has yet to pass legislation to codify it #mapoli #EJ4MA …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-30T16:07:11+00:00","tweet":"\"Sometimes the story behind the art is as compelling as the art itself.\" - Deval Patrick @BainCapital …","name":"deval patrick","Sentiment":-0.05},{"date":"2019-05-28T11:15:32+00:00","tweet":"I like my coffee at least Yaphet Kotto.","name":"deval patrick","Sentiment":-0.3},{"date":"2019-05-23T10:01:00+00:00","tweet":"Don't miss the 2019 William C. Battle Symposium at #PrezFest: \"Why Democracy?\" Participants: @RisaGoluboff, @DevalPatrick, @AmbassadorRice, and @Peter_Wehner, moderated by @UVADemocracy cochair @MelodyCBarnes. Tune in to watch live: …","name":"deval patrick","Sentiment":0.1363636364},{"date":"2019-05-23T08:00:01+00:00","tweet":"With abortion and impeachment dominating the political divide, in the 2020 election, will these be the only issues that matter to voters? @J_Braceras of the @IWF and @jessemermell, former Gov. @DevalPatrick communications director, discuss.","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-22T15:46:26+00:00","tweet":"Um my student loan principal always went down when I made payments. Did you take some sort of @DevalPatrick Ameriquest student loan?","name":"deval patrick","Sentiment":-0.1555555556},{"date":"2019-05-20T17:00:24+00:00","tweet":".@cheryldorsey in conversation with @DevalPatrick at the #StartupColumbia #entrepreneurship festival discussing racism, sexism, and the future of #socent @ColumbiaEship","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-19T15:14:38+00:00","tweet":"When Romney was Governor of Massachusetts he couldn't get out of town fast enough because he knew he'd lose to Deval Patrick","name":"deval patrick","Sentiment":0.1},{"date":"2019-05-16T09:08:34+00:00","tweet":"Now THAT is an impressive group of change agents on stage!","name":"deval patrick","Sentiment":1.0},{"date":"2019-05-15T16:40:06+00:00","tweet":"Where does change come from? Role of private\/public sector...Inspiring, invigorating reflections and ideas on a classic (but usually tiring) question @urbaninstitute #UrbanNext50 @DevalPatrick @AnnaMasonDC @MichaelDTubbs @aijenpoo @edskyler","name":"deval patrick","Sentiment":-0.0416666667},{"date":"2019-05-15T13:38:00+00:00","tweet":"Other less depressing options: Sherrod Brown, Margaret Atwood, Deval Patrick (but I don't think he's famous outside of Massachusetts)","name":"deval patrick","Sentiment":-0.0783333333},{"date":"2019-05-15T12:30:10+00:00","tweet":"Rolling up our sleeves on behalf of the future of American Cities. “What would it take to create a future in which everyone has a chance to thrive?”@TonyWilliamsDC @DevalPatrick #UrbanNext50","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-14T15:27:15+00:00","tweet":"Great question. Two good resources we have found: … and …","name":"deval patrick","Sentiment":0.75},{"date":"2019-05-13T23:45:03+00:00","tweet":"No, they already did this when Romney was Governor and then changed the laws back when Deval Patrick took office. They have yet to change the laws again because there isn't any pressing need to.","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-13T21:20:20+00:00","tweet":"Congratulations, @NorthernEssex on willing the Deval Patrick Award this year! …","name":"deval patrick","Sentiment":0.3125},{"date":"2019-05-11T23:08:08+00:00","tweet":"Among our TAW instructors that year, Michele Roberts, Ted Wells, Diane Bemus Patrick (with a cameo by future MA Gov. Deval Patrick.) All led by Prof. Ogletree in teaching us actually to practice the law.","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-08T11:30:26+00:00","tweet":"We're glad to see @IMPRINTproject recognize @NorthernEssex's PIÉS Latinos de NECC program on the #RoadMapTo100 campaign, especially given NECC's recent recognition with the Deval Patrick Prize for Community Colleges. Learn more about their great work here: … …","name":"deval patrick","Sentiment":0.36},{"date":"2019-05-07T09:40:07+00:00","tweet":"Today is National Teacher Day!! \"A great teacher who is full of excitement and love for her students can make all the difference in their lives.\" - Deval Patrick","name":"deval patrick","Sentiment":0.55},{"date":"2019-05-07T03:27:33+00:00","tweet":"I thought that was deval Patrick for a sec …","name":"deval patrick","Sentiment":-0.1},{"date":"2019-05-05T11:57:49+00:00","tweet":"Thanks to @EagleTrib for featuring @northernessex PIÉS de Latino program, winner of the @bostonfdn Deval Patrick Award, on the front page of today’s paper. @NCustodiaLora @neccprez …","name":"deval patrick","Sentiment":0.2},{"date":"2019-05-05T08:32:41+00:00","tweet":"When the @DevalPatrick alumni community shows up at the @walkforhunger to support @ErinMcAleer1! We’re about to walk 20mi to fight hunger. Can you help with a small donation? …","name":"deval patrick","Sentiment":-0.25},{"date":"2019-05-02T13:53:44+00:00","tweet":"Congratulations @NorthernEssex and @NECCPrez on winning the Deval Patrick Award from the @bostonfdn … …","name":"deval patrick","Sentiment":0.5},{"date":"2019-05-01T21:30:52+00:00","tweet":"Thank you, @bostonfdn, for awarding @NCustodiaLora and @NorthernEssex the 2019 Deval Patrick Prize for Community Colleges for @PIESLatinosNECC, which has helped over 600 immigrants validate their educational credentials, improve English skills, and move into meaningful careers.","name":"deval patrick","Sentiment":0.25},{"date":"2019-05-01T15:32:12+00:00","tweet":"Thrilled to join our friends at the Boston Foundation @bostonfdn for discussion on preparing the future workforce and celebrating Deval Patrick Prize for innovative community college leadership with @JayAshMACP @bostonchamber @MassLWD","name":"deval patrick","Sentiment":0.3666666667},{"date":"2019-04-27T14:09:03+00:00","tweet":"4)\"UNMASKING THE COVERED-UP CONNECTION OF ROBERT MUELLER AND DEVAL PATRICK DOJ altered Massachusetts court docket to hide Robert S. Meuller’s prior associations with Deval Patrick—Obama’s choice to challenge Trump in 2020 Now that is a secret worth hiding, Mr. Mueller...","name":"deval patrick","Sentiment":-0.0333333333},{"date":"2019-04-23T12:24:14+00:00","tweet":"I’m still waiting for comment from MA-based presidential contenders @senwarren and @sethmoulton. And, for that matter, @DevalPatrick & @joekennedy.","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-20T19:22:48+00:00","tweet":"Rev. Haywood was one of my precinct captains for Deval Patrick back in 2006. A very good man. May his memory be a blessing. …","name":"deval patrick","Sentiment":0.455},{"date":"2019-04-18T22:06:06+00:00","tweet":"Deval Patrick was the first Democratic Governor since Dukakis.","name":"deval patrick","Sentiment":0.25},{"date":"2019-04-18T17:06:17+00:00","tweet":"Our President & Director-Counsel @Sifill_LDF was named a member of the @americanacad! @MichelleObama President of the Andrew W. Mellon Foundation @ProfessorEA & LDF alum @DevalPatrick were also inducted. Congrats to all the new members!","name":"deval patrick","Sentiment":0.1704545455},{"date":"2019-04-17T17:43:28+00:00","tweet":"Some of the advisers: Robert Gibbs, Ed Gillespie, Jennifer Granholm, Bill Kristol, Mike Morell, Mike Murphy, Penny Pritzker, Deval Patrick, Bret Stephens, Neera Tanden and Howard Wolfson. It's like a cable news contributor roster.","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-17T09:55:37+00:00","tweet":"New members of the American Academy of Arts and Sciences include @MichelleObama, @MichelMcQMartin, @JamesFallows, @emilybazelon, Judith Butler, Jonathan Franzen, Merrick Garland, @Sifill_LDF, @joesbigidea, @DevalPatrick, and @AnnaDeavereS: .","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-04-12T09:06:23+00:00","tweet":"\"The qualities of a leader, regardless whether the setting is political or business or law, are basically the same: Intellectual honesty, rigor, curiosity and humility.\" How Deval Patrick Shaped A Life Worth Living … @Real_Leaders @BCorporation @DevalPatrick","name":"deval patrick","Sentiment":0.15},{"date":"2019-04-10T22:52:27+00:00","tweet":"\"Legend and Teigen followed a rousing speech by Deval Patrick, the former governor of Massachusetts, who urged Democrats to fight for their beliefs — and to stick together doing it.\" Naturally a Bain Capital executive gets to inspire the Dem caucus.","name":"deval patrick","Sentiment":0.05},{"date":"2019-04-10T21:12:37+00:00","tweet":"Tonight, at the @HouseDemocrats conference, we were joined by my friend #MA Gov @DevalPatrick who asked, “Since when do we yell hate and whisper kindness?” Wise words. So much more can be accomplished when we listen & try to understand each other. #ForThePeople","name":"deval patrick","Sentiment":0.095},{"date":"2019-04-10T20:38:23+00:00","tweet":"Deval Patrick: Democrats need to be \"the party of the woke as well as the still waking\" I'm kinda falling asleep tho …","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-10T20:22:24+00:00","tweet":"Former Mass Gov Deval Patrick, pretty much the only high profile Dem not running for president, is urging House Dems to stop being wimps by cowing to GOP talking points and to stop fractionalizing into wings of the party. “Be Democrats,” he said","name":"deval patrick","Sentiment":0.122},{"date":"2019-04-10T20:16:30+00:00","tweet":"Deval Patrick tells House Democrats at their annual retreat, \"The Democratic Party was made for this moment” (Patrick's walkout song was Springsteen's \"We take care of our own\")","name":"deval patrick","Sentiment":0.6},{"date":"2019-04-10T08:00:52+00:00","tweet":"Falmouth Turbine Blows Deval Patrick Democratic Presidential Bid Former Gov. Deval Patrick Haunted By August 3, 2010, Hidden Wind Turbine Letter That Caused Massive Litigation, Health, Property Takings Falmouth Massachusetts USA Apr 2, 2019 …","name":"deval patrick","Sentiment":-0.0555555556},{"date":"2019-04-09T18:15:38+00:00","tweet":"The lives of mpeople, meeting their needs to have economic mobility depends on education and skills development. -Honorable Deval Patrick. #devalpatrick #WorkingNationOverheard @BainCapital @asugsvsummit","name":"deval patrick","Sentiment":0.2},{"date":"2019-04-09T18:05:25+00:00","tweet":"@DevalPatrick @frankbritt @CathiCanfield @ZoeWeintraub and @oates_jane talking about innovative employers such as Employbridge, Lowe’s, Disney and others who are providing their employees with access to education and, therefore, economic mobility. #ASUGSV2019","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-04-09T18:03:56+00:00","tweet":"“One of the key gaps to cross - is the connection between the learner and the employer.” -Hon. Deval Patrick @BainCapVC #WorkingNationOverheard #ASUGSV2019 #asugsvsummit2019 #asugsv @oates_jane @WorkingNation","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-09T17:05:03+00:00","tweet":"@DevalPatrick talking about how Penn Foster is addressing a middle skills gap that the conventional economy has not been able to solve. Penn Foster is on a mission. Join us. #ASUGSV19","name":"deval patrick","Sentiment":0.119047619},{"date":"2019-04-09T16:16:10+00:00","tweet":"You forgot Deval Patrick in the X","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-09T14:59:59+00:00","tweet":"PF CEO @frankbritt will join @DevalPatrick, @CathiCanfield, @ZoeWeintraub, and @oates_jane to discuss how employers can invest in employee education\/training to drive greater retention and accelerate career mobility at #asugsvsummit2019. Learn more:","name":"deval patrick","Sentiment":0.5},{"date":"2019-04-09T14:01:58+00:00","tweet":"@DevalPatrick, former MA governor and current managing director of @baincapital double impact, talking about scaling impact #asugsvsummit2019 Humbled to be working in Impact work on behalf of the @AmFamInstitute #iwork4amfam – at Manchester Grand Hyatt San Diego","name":"deval patrick","Sentiment":0.125},{"date":"2019-04-09T13:58:17+00:00","tweet":"“Do not leave your conscience at the door [when you go to work],” advises @devalpatrick at @asugsvsummit #ASUGSV2019","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-09T07:55:41+00:00","tweet":"Falmouth Turbine Blows Deval Patrick Democratic Presidential Bid Massachusetts Wind Turbine Torture …","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-08T20:26:04+00:00","tweet":"I am grateful for each and everyone who chose NOT to run: Tom Steyer, Eric Holder, Deval Patrick, Sherrod Brown, Martin O'Malley, to name a few. Too bad Bernie, Beto and Biden didn't reach the same conclusion.","name":"deval patrick","Sentiment":-0.3},{"date":"2019-04-08T19:39:32+00:00","tweet":"RULED OUT: Michael Avenatti, Michael Bloomberg, Sherrod Brown, Bob Casey, Hillary Clinton, Andrew Cuomo, Eric Garcetti, Eric Holder, Jeff Merkley, Martin O’Malley, Deval Patrick, Tom Steyer …","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-08T15:00:53+00:00","tweet":"Looking forward to highlighting another opportunity to recognize the great work community colleges are doing in Mass. Join us May 1! | The Deval Patrick Prize for Community Colleges -","name":"deval patrick","Sentiment":1.0},{"date":"2019-04-08T14:45:14+00:00","tweet":"#OTD in 2011, a groundbreaking ceremony for the Institute was held w\/ then-Governor @DevalPatrick, @SenMarkey, & other officials in attendance. See a @UMassBoston report which published that day. ️ Watch coverage by @cspan. ️","name":"deval patrick","Sentiment":-0.125},{"date":"2019-04-08T11:25:40+00:00","tweet":"Former gubernatorial candidate Jay Gonzalez, who was secretary of administration and finance under Gov. Deval Patrick, has joined Hinckley Allen in Boston as a partner.","name":"deval patrick","Sentiment":0.0},{"date":"2019-04-08T00:38:52+00:00","tweet":"Boston Commemorate the 50th Anniversary of Martin Luther King Jr. Final Speech \/ April 2, 2018 Boston-- More than 120 participants included former Gov. Deval Patrick, City Council President Andrea... …","name":"deval patrick","Sentiment":0.1666666667},{"date":"2019-07-05T09:21:05+00:00","tweet":"Deval Patrick is one of the destroyers of the \"American Dream.\" While on the Board of Directors for ACC Capital Holdings, the company engaged in predatory mortgage lending practices for which they were later fined. They also fired thousands of employees with a phone call.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-05T09:06:00+00:00","tweet":"When Democrats talk about \"our commitment to reviving and restoring the American Dream, we win— and we deserve to win,\" says @DevalPatrick.","name":"deval patrick","Sentiment":0.4},{"date":"2019-07-03T16:16:41+00:00","tweet":"A big thank you to our team, co-chairs @StanMcChrystal @DevalPatrick @ariannahuff coalition partners @missioncontinue @pcorpsconnect @AmericasPromise @America_Forward @repairtheworld @CatholicVolNet @YouthBuildUSA @TheCorpsNetwork @states4service @Vets4AmerIdeals @Voices4Service …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-03T11:02:35+00:00","tweet":"#Service can bring us together. Good to see @PeteButtigieg taking leadership on #nationalservice and diversifying national service. @Inspire2ServeUS @ServiceYear @abbyfalik @TimShriver @WalterIsaacson @PaulforPGC @AlanKhazei @DanCardinali @msmithDC @JGreenblattADL @DevalPatrick …","name":"deval patrick","Sentiment":0.7},{"date":"2019-07-02T22:59:57+00:00","tweet":"“Gets past the question of blame” — a courtesy that was never extended to, say, Deval Patrick. Because it was always assumed that, as Governor, he was accountable. Somehow it’s different with Baker. How about that. 🤔🤷‍️ #mapoli …","name":"deval patrick","Sentiment":-0.125},{"date":"2019-07-02T10:18:28+00:00","tweet":"Nice to see former Gov. Deval Patrick who was at our @WWLP22News studios this morning for an appearance on @Morning_Joe","name":"deval patrick","Sentiment":0.3},{"date":"2019-07-02T08:41:47+00:00","tweet":"Joining us now: Fmr. Gov. Deval Patrick and Retired General Stanley McChrystal discuss 'Serve America. Together' @ServeUSA2gether","name":"deval patrick","Sentiment":0.05},{"date":"2019-06-30T01:13:22+00:00","tweet":"Deval Patrick, Jeff Merkely, and Sherrod Brown all passed on running for President. All three probably would have been more serious than a bunch of the people currently running.","name":"deval patrick","Sentiment":0.0555555556},{"date":"2019-06-28T11:14:59+00:00","tweet":"DEBATE DAY- DEVAL PATRICK CTM SOT FRI0091- Former MA Gov Deval Patrick was encouraged to run for the Dem presidential nomination this year. He said no, citing \"the cruelty of of our election process\" and how it could affect his loved ones. He is following the campaign though.","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-06-28T08:43:28+00:00","tweet":"Deval Patrick surprised by how \"awkward\" Biden was on busing question at Democratic debate Former aides to President Obama encouraged Deval Patrick, a former two-term Democratic governor of Massachusetts, to run for president this year. He declined citing “the cruelty of our…","name":"deval patrick","Sentiment":-0.125},{"date":"2019-06-28T08:41:45+00:00","tweet":"Former aides to Pres. Obama encouraged @DevalPatrick, a former 2-term governor of Massachusetts, to run for president. He declined citing “the cruelty of our elections process” and how it could affect his loved ones. He joins us to discuss what struck him about the #DemDebate.","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-06-27T22:07:00+00:00","tweet":"“Leave things better than how they were left to us. That means passing it on through acts of grace and kindness.” -@DevalPatrick #MLT15","name":"deval patrick","Sentiment":0.25},{"date":"2019-06-25T11:04:16+00:00","tweet":"Standing in front of @DevalPatrick's train. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-25T08:59:57+00:00","tweet":"Foreclosure King Deval Patrick is one of the reasons I left the Democratic Party","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-23T16:46:35+00:00","tweet":"Just like Third Way, Deval Patrick is a Republican that puts a deceptive (D) after his name. Pretty sure Democrats aren't putting much stock in anything Deval Patrick has to say...","name":"deval patrick","Sentiment":0.2375},{"date":"2019-06-19T22:57:05+00:00","tweet":"I was asked a similar question recently. My answer? Ursula Burns, Elie Wiesel, Deval Patrick and Misty Copeland, to name a few. @DevalPatrick @mistyonpointe #hero #rolemodel #inspiration","name":"deval patrick","Sentiment":-0.0666666667},{"date":"2019-06-18T15:23:32+00:00","tweet":"Thank you, @DevalPatrick, for this blessing bestowed on Massachusetts. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-14T07:49:10+00:00","tweet":"Deval Patrick's brother-in-law found guilty in kidnapping, rape case …","name":"deval patrick","Sentiment":-0.5},{"date":"2019-06-13T18:59:17+00:00","tweet":"Deval Patrick couldn’t be reached for comment. #mapoli …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-13T12:03:37+00:00","tweet":"Former Governor Deval Patrick's brother-in-law found guilty of rape and kidnapping could face 20 years in prison.","name":"deval patrick","Sentiment":-0.25},{"date":"2019-07-05T10:36:21+00:00","tweet":"The Dems 'American Dream' = Rigged Elections 30 mill who can't afford healthcare 40,000 dying\/yr without it War that never ends 660,000 homeless Staggering student debt Openly bribed govt No good jobs Nothing ever changing. #VoteProgressive #Bernie2020","name":"deval patrick","Sentiment":-0.1166666667},{"date":"2019-07-02T11:39:22+00:00","tweet":"Hey Twitter - The question of national service has re-emerged thks to @PeteButtigieg @DevalPatrick @StanMcChrystal @ServeUSA2gether I wrote a piece in the @nytimes (in 2010!) that argues for (non-military) service to counter polarization ... pls RT! …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-02T11:07:48+00:00","tweet":"ICYMI: Great clip from earlier today of @DevalPatrick and @StanMcChrystal on @Morning_Joe discussing the launch of @ServiceYear's new #ServeAmericaTogether campaign. …","name":"deval patrick","Sentiment":0.3121212121},{"date":"2019-07-02T11:01:12+00:00","tweet":"Deval Patrick AND national service — be still my heart! …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-02T09:14:20+00:00","tweet":"Falmouth Turbine Blows Deval Patrick Democratic Presidential Bid Former Gov. Deval Patrick Haunted By August 3, 2010, Hidden Wind Turbine Letter That Caused Massive Litigation, Health, Property Takings …","name":"deval patrick","Sentiment":-0.0555555556},{"date":"2019-07-01T16:16:18+00:00","tweet":"Tomorrow morning, 8:30AM on @MSNBC’s @Morning_Joe: @StanMcChrystal & @DevalPatrick will be talking @ServeUSA2gether. Don’t miss it! #ServeAmericaTogeher","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-30T11:53:41+00:00","tweet":"What a stark contrast this would have been - when thousands of migrant children needed shelter in '14, Gov @DevalPatrick passionately made the case that MA would shelter them. “I don’t know what good there is in faith if we can’t, and won’t, turn to it in moments of human need.”","name":"deval patrick","Sentiment":0.1125},{"date":"2019-06-30T08:59:30+00:00","tweet":"It’s an incredible loss for the party that Gov. @DevalPatrick decided not to run. He’s far better than most candidates. “I think Medicare being available for everyone is a fabulous idea - Medicare being required of everybody is something I’m less warm to.” …","name":"deval patrick","Sentiment":0.4041666667},{"date":"2019-06-29T03:18:37+00:00","tweet":"Deval Patrick surprised by Biden's \"awkward\" answer on busing question at Democratic debate","name":"deval patrick","Sentiment":-0.25},{"date":"2019-06-27T22:09:17+00:00","tweet":"Christy Haubegger in conversation with Gov. Deval Patrick and former NBA Commissioner David Stern. Celebrating ⁦@MLTOrg⁩ 15th anniversary gala! Celebrating 15 years of transformational impact. ⁦@MLTJohnRice⁩","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-27T20:03:56+00:00","tweet":"Tonight’s @MLTOrg program features special guests @GayleKing, @ChakaKhan, @DevalPatrick and David Stern. #MLT15","name":"deval patrick","Sentiment":0.3571428571},{"date":"2019-06-27T14:34:56+00:00","tweet":"\"I still meet business leaders who believe that focusing narrowly on their financial bottom line is all that’s required,\" says @BainCapital's Deval Patrick. \"That time has passed. The times require leaders to take a broader view of value, and to manage accordingly.” #SMLC19","name":"deval patrick","Sentiment":-0.1},{"date":"2019-06-26T13:46:39+00:00","tweet":"Great meeting w fr Governor Deval Patrick at Harvard University in Boston, learning strategies he pursued during his tenure as a Governor to transform the state’s workforce systems and strengthening MA’s innovation economy. @GovTimWalz @LtGovFlanagan @mndeed @grove","name":"deval patrick","Sentiment":0.8},{"date":"2019-06-21T12:23:41+00:00","tweet":"\"In my view, the Democratic Party was made for this moment.\" @DevalPatrick on the #WaytoWin","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-13T06:52:46+00:00","tweet":"It was honor to work with you and @DevalPatrick’s team to try and push for better funding for the MBTA. Unimaginable to me that we’re still stuck in this mess a decade later.","name":"deval patrick","Sentiment":0.1083333333},{"date":"2019-06-12T23:34:38+00:00","tweet":"Both have a ton of Black voters. Ed Brooke and Deval Patrick did not: …","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-06-11T21:36:09+00:00","tweet":"When Deval Patrick wanted real funding for transportation, Speaker DeLeo blocked him. And Charlie Baker has been choosing tax breaks for millionaires over fixing the T for years, as A+F and @massgov. #mapoli #derailment","name":"deval patrick","Sentiment":0.2},{"date":"2019-06-07T21:24:16+00:00","tweet":"It was so great to see Deval Patrick and Tim Murray back together again! Congratulations to Tim for today’s tribute and new portrait at City Hall to honor his years and tremendous impact as Mayor of Worcester!","name":"deval patrick","Sentiment":0.3382575758},{"date":"2019-06-07T15:16:52+00:00","tweet":"Former Mayor Tim Murray, former Gov. Deval Patrick, and Mayor Joe Petty talk before a ceremony to unveil the official portrait of Tim Murray in #Worcester City Hall. @telegramdotcom","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-07T09:40:11+00:00","tweet":"Certainly in more ways than one & certainly not all of them for the better.","name":"deval patrick","Sentiment":0.2976190476},{"date":"2019-06-07T09:33:38+00:00","tweet":"But the real wrench in all of this was @DevalPatrick. He left office with some fair criticism of being not radical enough (some might say neoliberal today) BUT he disrupted the system because a Dem governor naturally pushes the legislature in ways a GOP governor doesn't.","name":"deval patrick","Sentiment":0.2},{"date":"2019-06-07T08:02:25+00:00","tweet":"Just like every Democrat. Obama and Deval Patrick used the same speech at least 2 times. They are all empty suits and paid to say and do whatever their wealthy donors tell them to do.","name":"deval patrick","Sentiment":0.025},{"date":"2019-06-07T00:09:00+00:00","tweet":"Yes, this makes Deval Patrick’s election so amazing and hard to understand. Or maybe Senator Brooks was really 200 years ahead of this time. What are you, 87 years old?","name":"deval patrick","Sentiment":0.1520833333},{"date":"2019-06-05T10:58:08+00:00","tweet":"@adrane or @DevalPatrick - both amazing storytellers - but i'm betting you already have both on your list","name":"deval patrick","Sentiment":0.6},{"date":"2019-06-04T18:38:00+00:00","tweet":"Mayoral portrait of Tim Murray to be unveiled Friday in Worcester City Hall @NCKotsopoulos @chamberworc @TweetWorcester @DevalPatrick @MayorPetty","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-03T10:54:34+00:00","tweet":"Lol! Ken Kimmell is president of the Union of Concerned Scientists, former partner in \"BCK Law”, & former DEP Commissioner under MA Gov Deval Patrick. Ken Kimmell has a wind scam legacy detailed, here, in a copy of Public Comments to the State of MA- …","name":"deval patrick","Sentiment":0.28},{"date":"2019-06-01T10:15:53+00:00","tweet":"The Parole Board\/Advisory Board of Pardons (in Massachusetts the Parole Board is the Advisory Board of Pardons) held a clemency hearing for Arnie King (pic) in 2007 & unanimously supported his clemency. @DevalPatrick, MA Governor at the time, did not act. #reviveclemency #mapoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-31T09:14:20+00:00","tweet":"Thanks @AnnikaHom @BostonGlobe for spreading the great news that we received The Deval Patrick Prize for Community Colleges from the @bostonfdn for the PIÉS Latinos de NECC that helps immigrants pursue professional development.","name":"deval patrick","Sentiment":0.3666666667},{"date":"2019-05-28T23:23:10+00:00","tweet":"Warren is running the race she wants to run, not the race a garden-variety D consultant or horse-race commentator would have her run. Reminds me a little of Deval Patrick c. 2005-6. (+ more policy papers, obvs) …","name":"deval patrick","Sentiment":0.1708333333},{"date":"2019-05-23T20:10:00+00:00","tweet":"WATCH: Dean @RisaGoluboff discusses the political philosophy underpinning American democracy with @MelodyCBarnes, @DevalPatrick, @AmbassadorRice and @Peter_Wehner at @Miller_Center’s Presidential Ideas Festival. #PrezFest …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-22T11:10:00+00:00","tweet":"I’m looking forward to the “Why Democracy?” panel with @MelodyCBarnes, @DevalPatrick, @AmbassadorRice and @Peter_Wehner at @Miller_Center’s Presidential Ideas Festival on Thursday. It should be a fascinating discussion. #PrezFest","name":"deval patrick","Sentiment":0.7},{"date":"2019-05-17T09:21:11+00:00","tweet":"That’s offensive and absurd. He’s not a “serial harasser”. He had an affair. Bill Clinton is the first POTUS to so much as utter the word lesbian. It took him four tries to get an African American assistant AG appointed, Deval Patrick, who Republicans dubbed “quota king”.","name":"deval patrick","Sentiment":-0.0583333333},{"date":"2019-05-16T07:26:43+00:00","tweet":"I’m so grateful to @urbaninstitute for inviting me to join this panel yesterday at #UrbanNext50. A conversation about where change comes from w\/ @DevalPatrick @aijenpoo @MichaelDTubbs & @Citi’s Ed Skyler that inspired me so much. #RiseOfRest @RiseOfRest","name":"deval patrick","Sentiment":0.2},{"date":"2019-05-16T01:48:53+00:00","tweet":"Here's what I'm thinking right now: The Dem primary electorate really wants Barack Obama to be the nominee. But since that's not possible, they want the next closet thing. Obamaworld sensed this and were *really* pushing Deval Patrick to run. But bc of Bain etc, he didn't. \/1","name":"deval patrick","Sentiment":0.180952381},{"date":"2019-05-15T17:04:53+00:00","tweet":"‘Right now the character of our country is at play and it is exciting how many people are coming off the sidelines to engage’, @DevalPatrick #UrbanNext50","name":"deval patrick","Sentiment":0.3619047619},{"date":"2019-05-15T16:25:15+00:00","tweet":".@DevalPatrick leading a fascinating discussion with @aijenpoo @MichaelDTubbs @AnnaMasonDC @edskyler at @urbaninstitute: Where Does Change Come From? The Role of Business, Activists, and the Public Sector.","name":"deval patrick","Sentiment":0.35},{"date":"2019-05-15T16:16:06+00:00","tweet":"Another great #urbanNext50 panel: discussing where change comes from with Mayor @MichaelDTubbs of @StocktonUpdates, @aijenpoo of @domesticworkers, @DevalPatrick now of @BainCapital, @edskyler of @Citibank, and @AnnaMasonDC of @RiseOfRest. – at Urban Institute","name":"deval patrick","Sentiment":0.4},{"date":"2019-05-15T16:12:14+00:00","tweet":"Now: Where does change come from? feat. @DevalPatrick, @annamasondc, @aijenpoo, @edskyler, & @MichaelDTubbs. #UrbanNext50 …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-15T12:50:01+00:00","tweet":"Deval Patrick: Sense of Hillary Clinton Entitlement is ‘Off-Putting’ To Voters. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-14T16:55:10+00:00","tweet":"Last month @cheryldorsey, SICI's #BeckVSI and president of @echoinggreen, sat down with Gov @DevalPatrick for a conversation on race, sexism, and progress in the world of #entrepreneurship. The video is now live at via @YouTube @columbiaEship","name":"deval patrick","Sentiment":-0.0063973064},{"date":"2019-05-14T14:37:42+00:00","tweet":"GE exec William “Mo” Cowan will succeed Ann Klee as the leader of GE's Boston operations, @bygregryan reports. Cowan, joined GE in 2017 from local lobbying power ML Strategies, and was previously a top aide to Gov. Deval Patrick. $GE …","name":"deval patrick","Sentiment":0.25},{"date":"2019-05-13T14:18:01+00:00","tweet":"Secretary Rosalin Acosta awards Northern Essex Community College the Deval Patrick Prize for Community Colleges at the Boston Foundation. Congratulations, @NorthernEssex!","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-12T19:08:01+00:00","tweet":"Basically Kate Brown, Gina Raimondo, Deval Patrick, David Paterson (black and disabled) are staying out because they see a rising popularity contest that has about no respect for executive experience...(Gary Lock is a Chinese American ex governor of the state of Washington...","name":"deval patrick","Sentiment":-0.0916666667},{"date":"2019-05-11T23:08:08+00:00","tweet":"Among our TAW instructors that year, Michele Roberts, Ted Wells, Diane Bemus Patrick (with a cameo by future MA Gov. Deval Patrick.) All led by Prof. Ogletree in teaching us actually to practice the law.","name":"deval patrick","Sentiment":0.0},{"date":"2019-05-11T16:30:00+00:00","tweet":"Deval Patrick is the only other #Black person elected governor thus far, for the state of Massachusetts, as of 2007","name":"deval patrick","Sentiment":-0.0479166667},{"date":"2019-05-10T22:57:36+00:00","tweet":"Well in 1988 he got wrecked by a plagiarism scandal. And not a, \"Barack Obama forgot to attribute a line to Deval Patrick after asking Patrick if he could use it,\" kind of plagiarism scandal.","name":"deval patrick","Sentiment":0.6},{"date":"2019-05-10T15:29:01+00:00","tweet":"Round of applause for teachers around the world ‍‍ “A great teacher who is full of excitement and love for her students can make all the difference in their lives.” Deval Patrick","name":"deval patrick","Sentiment":0.3625},{"date":"2019-05-10T12:36:58+00:00","tweet":"I Truly want to believe this is Not real. Sadly I know it is. Liberals go to great lengths to protect pedophiles and criminals Especially in Massachusetts.Former governor Deval Patrick loaded our courts with liberal Judges that hand out soft sentencing to these pieces of Trash. …","name":"deval patrick","Sentiment":0.2666666667},{"date":"2019-05-09T16:40:00+00:00","tweet":"Ahhh Massachusetts, the place where carpetbaggers like Mitt Romney, Deval Patrick and Elizabeth Warren pitch their tents to launch political careers. The Commonwealth is filled with limpwristed, elbow-patched bleeding 's who everything and everyone except the United States.","name":"deval patrick","Sentiment":0.2},{"date":"2019-05-09T14:00:38+00:00","tweet":"'The admin of Gov. Deval Patrick agreed to purchase special diesel trains designed to accelerate and brake faster than traditional, locomotive-driven commuter trains, thereby allowing for more frequency on the line, the admin of Gov. Baker backed away from that commitment.'","name":"deval patrick","Sentiment":0.2857142857},{"date":"2019-05-09T11:48:58+00:00","tweet":"The major sponsor of the 2016 Democratic convention was....Uber. Also, when drivers staged a strike here in Boston, Deval Patrick sided with Uber (which isn't even based in MA) … …","name":"deval patrick","Sentiment":0.0625},{"date":"2019-05-08T11:30:26+00:00","tweet":"We're glad to see @IMPRINTproject recognize @NorthernEssex's PIÉS Latinos de NECC program on the #RoadMapTo100 campaign, especially given NECC's recent recognition with the Deval Patrick Prize for Community Colleges. Learn more about their great work here: … …","name":"deval patrick","Sentiment":0.36},{"date":"2019-08-06T22:12:03+00:00","tweet":"“A great teacher who is full of excitement and love for her students can make all the difference in their lives.” -Deval Patrick #EdChat #SusanColton","name":"deval patrick","Sentiment":0.55},{"date":"2019-08-03T19:07:47+00:00","tweet":"You reap what you sow. @DevalPatrick has a whole speech on this and it could not be more true. We have the option to sow better seeds America. We must sow better seeds. …","name":"deval patrick","Sentiment":0.41},{"date":"2019-08-03T14:50:00+00:00","tweet":"Fantastic show coming tonight with former MA Gov. Deval Patrick, @dianeguerrero__ from @OITNB & author @Chris_arnade. Tune in 7ET on @CNN","name":"deval patrick","Sentiment":0.2},{"date":"2019-08-03T14:12:06+00:00","tweet":"7pm tonight, @DevalPatrick and @dianeguerrero__ join @VanJones68 for the #VanJonesShow and I can’t wait! Tune in!","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-02T18:18:00+00:00","tweet":"Dumpy reporter Cheryl Fiandaca has a Deval Patrick appointed Judge for a brother. Three months ago he had Torrie Jenkins in his courtroom on a drug dealing charge, and despite 25 previous arrests at the time, he let him off with probation. …","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-08-02T15:37:02+00:00","tweet":"My man, Van. A walking best practice in journalism. (Taking your advice & going social with this.) Thank you for fighting the good fight. Shoutout to OG @DevalPatrick for calling out the silence across the aisle today. @VanJones68 #FeelingInspired","name":"deval patrick","Sentiment":0.5777777778},{"date":"2019-07-31T14:33:06+00:00","tweet":"happy birthday to two former Massachusetts governors, only one of whom is running for president: @GovBillWeld and @DevalPatrick","name":"deval patrick","Sentiment":0.2666666667},{"date":"2019-07-31T08:38:42+00:00","tweet":"Happy birthday to two of my favorite folks, both of whom have influenced my life and career significantly: @DevalPatrick and @jk_rowling","name":"deval patrick","Sentiment":0.5583333333},{"date":"2019-07-31T07:58:23+00:00","tweet":"Howie knew Warren back when she was still an Indian hiding behind @DevalPatrick s apron strings.","name":"deval patrick","Sentiment":-0.2},{"date":"2019-07-24T16:01:31+00:00","tweet":"The #ServeAmericaTogether Presidential Challenge #2020Election @CNN @DevalPatrick @MSNBC","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-24T15:48:17+00:00","tweet":"Boston is THRILLED to welcome the @NAACP National Convention in 2020. I am honored and proud to represent Boston in this video with trailblazers like @attorneytanisha, @DevalPatrick, and Rev. Liz Walker.","name":"deval patrick","Sentiment":0.7333333333},{"date":"2019-07-23T20:09:35+00:00","tweet":"Here is a 100% true story: one time I drank all of Deval Patrick’s gin and he was pretty upset about it so I had to leave","name":"deval patrick","Sentiment":0.3},{"date":"2019-07-23T16:50:56+00:00","tweet":"Check out @DevalPatrick's appearance on @BloombergTV today! Learn more about his take on #nationalservice and the #ServeAmericaTogether campaign— … @ServeUSA2gether @ServiceYear","name":"deval patrick","Sentiment":0.5},{"date":"2019-07-23T16:33:30+00:00","tweet":"Tune in at 5:33 for our extended interview with former Governor @DevalPatrick. He talks about his national service idea - plus the Democratic presidential field and the @mbta. 106.1 Boston\/92.9 HD 2 @bloombergbaybiz @BainCapital","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-23T14:59:54+00:00","tweet":"We had a chance to speak with former Massachusetts Governor Deval Patrick about his new Serve America Together initiative, and we asked him about the MBTA, of course...hear it tonight at 5:33 on Bloomberg Baystate Business.","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-07-23T12:51:03+00:00","tweet":"\"We are at a time when the nation needs everyone on deck…and serving together is a wonderful way to encourage coming together.” -@DevalPatrick on @BloombergTV #ServeAmericaTogether","name":"deval patrick","Sentiment":1.0},{"date":"2019-07-19T00:29:29+00:00","tweet":"There have only been 2 elected African-American Governors in history: Douglas Wilder and Deval Patrick.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-15T23:32:21+00:00","tweet":"At least a few instantly recognizable names on @mjhegar's Q2 filing: Rosie O'Donnell, Deval Patrick, Kristen Bell and Cecile Richards #txsen","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-07-15T19:16:25+00:00","tweet":"On my way back the thought hit me: Can you imagine the #mapoli fireworks if the MBTA melt-down happened on Deval Patrick's watch? He wouldn't have heard the end of it. The Herald would be dragging him DAILY. Yet Charlie Baker, for whatever dumb reason, is getting a free pass.","name":"deval patrick","Sentiment":0.00625},{"date":"2019-07-10T09:29:58+00:00","tweet":"Massachusetts Governor Deval Patrick is the son of Pat Patrick, the baritone saxophone player in Sun Ra’s Intergalactic Solar Arkestra. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-31T04:24:26+00:00","tweet":"Happy birthday Former Governor @DevalPatrick the 2nd African American elected Governor of a state, Massachusetts #mapoli #Blackhistory #DevalPatrick #massachusetts","name":"deval patrick","Sentiment":0.16},{"date":"2019-07-30T22:29:09+00:00","tweet":"She cant answer anything without @DevalPatrick speaking for her.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-27T20:32:06+00:00","tweet":"Yes on the 60. 2-3x as many people here tonight as were here with @McCreadyForNC and Deval Patrick two weeks before election day in 2018. The increased energy is palpable. #ReadyForMcCready #nc09 …","name":"deval patrick","Sentiment":0.25},{"date":"2019-07-25T17:01:37+00:00","tweet":"She's my rep and this is 100% not surprising. Still have high hopes she'll get better on this, but one of her main campaign advisers was Alex Goldstein (used to work for Deval Patrick) who is a rabid anti-BDS guy.","name":"deval patrick","Sentiment":0.1191666667},{"date":"2019-07-23T23:46:49+00:00","tweet":"One time I drank some of Jeffrey Wright’s whiskey and he just bought me my own drink. Jeffrey Wright > Deval Patrick.","name":"deval patrick","Sentiment":0.6},{"date":"2019-07-23T19:14:18+00:00","tweet":"Again, just a reminder that when Deval Patrick was Governor, Beacon Hill leadership insisted that new transportation $$ needs to be accompanied by cost-cutting. #mapoli …","name":"deval patrick","Sentiment":0.1363636364},{"date":"2019-07-23T18:17:55+00:00","tweet":"Please schedule our @SenWarren for an event at Reggie Lewis Center in Roxbury again. Last time I met a bunch of people from Boston I'd read about but never met, and I got to hear Gov. Deval Patrick, Rep. John Lewis and Prof. Warren speak. Three days later she was senator-elect.","name":"deval patrick","Sentiment":-0.0333333333},{"date":"2019-07-23T12:53:43+00:00","tweet":"Thanks @DevalPatrick for highlighting #serveamericatogether","name":"deval patrick","Sentiment":0.2},{"date":"2019-07-23T12:48:53+00:00","tweet":"Tune in now to @BloombergTV to watch @DevalPatrick & @DavidWestin talk about @ServeUSA2gether — a campaign to make national service part of growing up in America.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-23T11:01:17+00:00","tweet":"Tune in at 12:40pm ET to @BloombergTV! Gov. @DevalPatrick will be talking about @ServeUSA2gether & the #ServeAmericaTogether Presidential Challenge. Which candidate will accept the challenge next?","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-23T03:52:20+00:00","tweet":"Advocates for #homeless people have been trying for years to repeal this rule, which was put in place under former Gov. Deval Patrick in 2012 and kept by Gov. Charlie Baker @MassGovernor @MarjorieDecker #NAEH2019 …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-19T08:30:05+00:00","tweet":"Your are another stain in a long list of ineffective, incompetent and intellectually bankrupt pols (see: @ewarren @EdMarkey @sethmoulton @RepMcGovern @JohnKerry @DevalPatrick @MassGovernor @marty_walsh etc etc). Or as we like to say here in Massachusetts....a HACK! #oneanddown","name":"deval patrick","Sentiment":-0.0083333333},{"date":"2019-07-17T15:54:23+00:00","tweet":"[4\/x] Deval Patrick “pounding the table” to get our legislature to raise revenue for transit …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-15T23:36:23+00:00","tweet":"Thank you @IMKristenBell @DevalPatrick and others helping Texans rid us of @JohnCornyn 🇺🇸","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-15T21:09:47+00:00","tweet":"Labor- Robert Reich Returns (or Deval Patrick) HUD- Martin O'Malley CIA- Avril Haines Small Business- Andrew Yang? Sally Jewell? USTR- no idea. Probably a career beaurocrat.","name":"deval patrick","Sentiment":-0.25},{"date":"2019-07-15T08:40:06+00:00","tweet":"Before Polito the LG position was vacant for half of 2013 and all 2014. Deval Patrick's separately elected LG Tim Murray resigned to take a chamber of commerce presidency, though the decision was clouded by a campaign finance investigation he subsequently settled.","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-07-15T03:54:16+00:00","tweet":"and deval patrick was from chicago, and warren’s from oklahoma, and nicki tsongas was born in california, and and and","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-13T14:51:48+00:00","tweet":"For sure. In her defense though, John Lewis didn't back her in her primary. The entire CBC abandoned her. Deval Patrick didn't back her. She probably feels like she doesn't owe anything politically to anybody.","name":"deval patrick","Sentiment":0.15},{"date":"2019-07-11T18:22:29+00:00","tweet":"If this man had been permitted by Deval Patrick to soldier on as Sec'y, the MA transportation system might look very different today. #mapoli …","name":"deval patrick","Sentiment":-0.05},{"date":"2019-07-10T09:27:00+00:00","tweet":"Great reminder that government matters to economic development beyond just taxes and regulation. Seed investments & help from Dan O'Connell, @GregBialecki, @DevalPatrick and @Mass_Tech (continued by @MassGovernor today) are a big piece of the incredible success of @MassChallenge …","name":"deval patrick","Sentiment":0.44},{"date":"2019-07-09T23:07:57+00:00","tweet":"Start with the WHY? WHY did 20 Democratic candidates raise their hands and put the welfare of border-jumpers and their rugrats ahead of American Citizens and their Children? THAT IS A BIG WHY BECAUSE IT COST DEMOCRATS THE ELECTION...THAT'S WHY.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-09T23:03:30+00:00","tweet":"The moment being clowns for the world to see.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-09T03:14:51+00:00","tweet":"Nobody can spew mindless platitudes and drivel like Democrats. Their followers eagerly take it hook,line, and sinker.","name":"deval patrick","Sentiment":-0.2},{"date":"2019-07-09T03:04:15+00:00","tweet":"Putting forward a managing director at Bain Capital as the face of the Democratic Party might be peak Third Way.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-08T06:49:18+00:00","tweet":"Y'all are in such bad faith. Deval Patrick can't win exactly because he is a corporate centrist democrat that sold out his constituency, especially teachers. You only advocate one losing strategy - keep the Democratic party from going left.","name":"deval patrick","Sentiment":0.04375},{"date":"2019-07-05T09:21:05+00:00","tweet":"Deval Patrick is one of the destroyers of the \"American Dream.\" While on the Board of Directors for ACC Capital Holdings, the company engaged in predatory mortgage lending practices for which they were later fined. They also fired thousands of employees with a phone call.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-05T09:06:00+00:00","tweet":"When Democrats talk about \"our commitment to reviving and restoring the American Dream, we win— and we deserve to win,\" says @DevalPatrick.","name":"deval patrick","Sentiment":0.4},{"date":"2019-07-03T16:16:41+00:00","tweet":"A big thank you to our team, co-chairs @StanMcChrystal @DevalPatrick @ariannahuff coalition partners @missioncontinue @pcorpsconnect @AmericasPromise @America_Forward @repairtheworld @CatholicVolNet @YouthBuildUSA @TheCorpsNetwork @states4service @Vets4AmerIdeals @Voices4Service …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-03T11:02:35+00:00","tweet":"#Service can bring us together. Good to see @PeteButtigieg taking leadership on #nationalservice and diversifying national service. @Inspire2ServeUS @ServiceYear @abbyfalik @TimShriver @WalterIsaacson @PaulforPGC @AlanKhazei @DanCardinali @msmithDC @JGreenblattADL @DevalPatrick …","name":"deval patrick","Sentiment":0.7},{"date":"2019-07-02T22:59:57+00:00","tweet":"“Gets past the question of blame” — a courtesy that was never extended to, say, Deval Patrick. Because it was always assumed that, as Governor, he was accountable. Somehow it’s different with Baker. How about that. 🤔🤷‍️ #mapoli …","name":"deval patrick","Sentiment":-0.125},{"date":"2019-07-02T10:18:28+00:00","tweet":"Nice to see former Gov. Deval Patrick who was at our @WWLP22News studios this morning for an appearance on @Morning_Joe","name":"deval patrick","Sentiment":0.3},{"date":"2019-07-02T08:41:47+00:00","tweet":"Joining us now: Fmr. Gov. Deval Patrick and Retired General Stanley McChrystal discuss 'Serve America. Together' @ServeUSA2gether","name":"deval patrick","Sentiment":0.05},{"date":"2019-06-30T01:13:22+00:00","tweet":"Deval Patrick, Jeff Merkely, and Sherrod Brown all passed on running for President. All three probably would have been more serious than a bunch of the people currently running.","name":"deval patrick","Sentiment":0.0555555556},{"date":"2019-06-28T11:14:59+00:00","tweet":"DEBATE DAY- DEVAL PATRICK CTM SOT FRI0091- Former MA Gov Deval Patrick was encouraged to run for the Dem presidential nomination this year. He said no, citing \"the cruelty of of our election process\" and how it could affect his loved ones. He is following the campaign though.","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-06-28T08:43:28+00:00","tweet":"Deval Patrick surprised by how \"awkward\" Biden was on busing question at Democratic debate Former aides to President Obama encouraged Deval Patrick, a former two-term Democratic governor of Massachusetts, to run for president this year. He declined citing “the cruelty of our…","name":"deval patrick","Sentiment":-0.125},{"date":"2019-06-28T08:41:45+00:00","tweet":"Former aides to Pres. Obama encouraged @DevalPatrick, a former 2-term governor of Massachusetts, to run for president. He declined citing “the cruelty of our elections process” and how it could affect his loved ones. He joins us to discuss what struck him about the #DemDebate.","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-06-25T11:04:16+00:00","tweet":"Standing in front of @DevalPatrick's train. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-25T08:59:57+00:00","tweet":"Foreclosure King Deval Patrick is one of the reasons I left the Democratic Party","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-23T16:46:35+00:00","tweet":"Just like Third Way, Deval Patrick is a Republican that puts a deceptive (D) after his name. Pretty sure Democrats aren't putting much stock in anything Deval Patrick has to say...","name":"deval patrick","Sentiment":0.2375},{"date":"2019-06-19T22:57:05+00:00","tweet":"I was asked a similar question recently. My answer? Ursula Burns, Elie Wiesel, Deval Patrick and Misty Copeland, to name a few. @DevalPatrick @mistyonpointe #hero #rolemodel #inspiration","name":"deval patrick","Sentiment":-0.0666666667},{"date":"2019-06-18T15:23:32+00:00","tweet":"Thank you, @DevalPatrick, for this blessing bestowed on Massachusetts. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-14T07:49:10+00:00","tweet":"Deval Patrick's brother-in-law found guilty in kidnapping, rape case …","name":"deval patrick","Sentiment":-0.5},{"date":"2019-06-13T18:59:17+00:00","tweet":"Deval Patrick couldn’t be reached for comment. #mapoli …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-13T12:03:37+00:00","tweet":"Former Governor Deval Patrick's brother-in-law found guilty of rape and kidnapping could face 20 years in prison.","name":"deval patrick","Sentiment":-0.25},{"date":"2019-06-13T08:20:08+00:00","tweet":"The Deval Patrick defense is really something. State wide office running vs a woman in a state that has never elected a woman gov.","name":"deval patrick","Sentiment":0.05},{"date":"2019-06-13T07:53:33+00:00","tweet":"Because that's just how Boston is. And the chickens are coming home to roost. Hope you're all proud of yourselves.","name":"deval patrick","Sentiment":0.8},{"date":"2019-06-13T07:35:38+00:00","tweet":"And does anyone even remember the irresponsible woman who uttered that phrase? What was her name? Theresa Something?","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-13T07:16:02+00:00","tweet":"However, it was .@DevalPatrick who didn't have the spine to back up his own Secretary","name":"deval patrick","Sentiment":0.3},{"date":"2019-06-13T06:52:46+00:00","tweet":"It was honor to work with you and @DevalPatrick’s team to try and push for better funding for the MBTA. Unimaginable to me that we’re still stuck in this mess a decade later.","name":"deval patrick","Sentiment":0.1083333333},{"date":"2019-06-12T23:41:19+00:00","tweet":"think the answer is Mass. Senator Edward Brooke and governor deval patrick","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-12T23:36:20+00:00","tweet":"Even worse, if you exclude the US Virgin Islands, Douglas Wilder (Virginia) and Deval Patrick (Mass) are the only two African Americans ever ELECTED as governors among the 50 states","name":"deval patrick","Sentiment":-0.1333333333},{"date":"2019-06-12T23:34:38+00:00","tweet":"Both have a ton of Black voters. Ed Brooke and Deval Patrick did not: …","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-06-12T20:11:27+00:00","tweet":"Why leftists don't trust Kamala Harris, Cory Booker, and Deval Patrick …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-12T17:04:05+00:00","tweet":"Two more reasons you won’t want to miss #MLT15 Anniversary Gala: special guests Deval Patrick, former Governor of MA & David Stern, @NBA Commissioner emeritus. #MLT15 More details at:","name":"deval patrick","Sentiment":0.3392857143},{"date":"2019-06-11T21:46:28+00:00","tweet":"Democrats have a history of plagiarizing speeches. Especially @JoeBiden's former boss, @BarackObama. He stole chunks of speeches from Deval Patrick and John Edwards. Let's reminisce, shall we... …","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-11T21:36:09+00:00","tweet":"When Deval Patrick wanted real funding for transportation, Speaker DeLeo blocked him. And Charlie Baker has been choosing tax breaks for millionaires over fixing the T for years, as A+F and @massgov. #mapoli #derailment","name":"deval patrick","Sentiment":0.2},{"date":"2019-06-11T10:58:13+00:00","tweet":"Baker is running the 3rd and 4th terms of the Deval Patrick administration with one tiny little difference that makes him so popular...","name":"deval patrick","Sentiment":0.103125},{"date":"2019-06-11T10:47:09+00:00","tweet":"Maybe the last time they tried anyone as close to progressive as a Jay Inslee or a Jerry Brown for his time was in 1991. Often the things their Republican governors block poll well in Massachusetts since Dukakis they've had 6 Republicans and 1 Democrat and that was Deval Patrick.","name":"deval patrick","Sentiment":0.0},{"date":"2019-06-10T20:20:32+00:00","tweet":"Here’s her song for Women’s Equality Pay. She Works Hard for the Money by Donna Summer. …","name":"deval patrick","Sentiment":-0.2916666667},{"date":"2019-06-10T16:30:40+00:00","tweet":"I think we had Massachusetts’ history in 4th grade, but it really all melded together with the standard US History content, since, as Deval Patrick said, “We invented America.” #NeverTaughtUsHumility 🤷‍️","name":"deval patrick","Sentiment":0.1},{"date":"2019-06-10T05:20:31+00:00","tweet":"Massachusetts Gay Pride Fella Posted this:Are they talking about Mueller's USA vs. William J. Cintolo,Disbarred Bill Cintolo,Attorney David Rifkin said he is a Mob Lawyer @BarackObama @DevalPatrick @CharlieBakerMA @SenWarren @Brad4Justice You will Reap what you sow..","name":"deval patrick","Sentiment":0.4166666667},{"date":"2019-06-09T09:38:44+00:00","tweet":"It has happened in the past - we need to ask @MassGovernor to speak to @DevalPatrick","name":"deval patrick","Sentiment":-0.25},{"date":"2019-09-06T16:08:55+00:00","tweet":".@jennkliu is a rockstar! I’ve admired and looked up to her ever since she was a fierce finance minx and I was a green organizer on Team @DevalPatrick\/@TimMurray_MA 2010. I’m so proud to see her making waves in the big leagues of American politics. …","name":"deval patrick","Sentiment":0.15},{"date":"2019-09-05T21:40:30+00:00","tweet":"John Brittain does it again! @UDCLaw prof @jbrittatty will receive a 2019 CLEO EDGE Award the same night @DevalPatrick is awarded the #VernonEJordanJr Heritage Award! Stay tuned...","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-04T17:16:22+00:00","tweet":"#WhatWereReading: Six former top #MAEconDev and housing officials who worked for Govs. Mitt Romney, Deval Patrick and Charlie Baker came to the Statehouse Wednesday to show support for @MassGovernor's #HousingChoice bill. More from @masslivenews:","name":"deval patrick","Sentiment":0.3333333333},{"date":"2019-08-27T09:35:26+00:00","tweet":"Reminder: Deval Patrick was very public about wanting to raise taxes to fix the T. Our public transit would've been in a much better state if the Democratic supermajority in the Legislature hadn't opposed him #mapoli …","name":"deval patrick","Sentiment":0.1666666667},{"date":"2019-08-23T18:02:59+00:00","tweet":"What's ominous for Markey is how Massachusetts pols, who are ostensibly for the incumbent now, change their tune when asked what they'd do if Kennedy is in the race. Lots of praise for both of em and equivocation.","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-23T15:51:18+00:00","tweet":"To be fair, I'm pretty sure Deval Patrick has forgotten about Deval Patrick","name":"deval patrick","Sentiment":0.4833333333},{"date":"2019-08-23T15:50:16+00:00","tweet":"I forgot Deval Patrick","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-23T14:39:51+00:00","tweet":"Walsh makes clear he'd only look at Senate if it's an open seat: “I’m not going to run against Ed Markey,\" he said. Mass Dems are split on Kennedy taking on Markey @BarneyFrank: \"I think it’s a mistake\" But @DevalPatrick says \"I like the idea of competitive primaries\"","name":"deval patrick","Sentiment":0.0333333333},{"date":"2019-08-23T11:14:41+00:00","tweet":"I moved to #Beijing in 2008. I left 2 months ago. During that time, they've built the equivalent of an entire @NYCTSubway + more. Meanwhile, the @MBTA hasn't even been able to get a bus onto a ramp. I blame @govbaker. (Congestion wasn't as bad when @DevalPatrick was Gov.) \/3","name":"deval patrick","Sentiment":0.06},{"date":"2019-08-21T20:12:41+00:00","tweet":"Federal killings at Ruby Ridge became a lasting outrage after Asst. Atty. Gen. Deval Patrick ruled that an FBI sniper did not use \"excessive force\" when he gunned down Vicki Weaver standing in her Idaho cabin door holding her baby. …","name":"deval patrick","Sentiment":-0.1351851852},{"date":"2019-08-21T10:52:43+00:00","tweet":"You didn't even ride the train. You got in your black SUV and left. Also, the new Red & Orange Line cars are not \"your effort\" they are @DevalPatrick's effort.","name":"deval patrick","Sentiment":-0.0075757576},{"date":"2019-08-17T20:34:15+00:00","tweet":"I respect Murkowski. I live in Mass. and there were some good things Romney did as Gov. that I didn't hate, though I preferred Deval Patrick. There are definitely some Republicans no longer in office who I think are basically intelligent, good people.","name":"deval patrick","Sentiment":0.2560606061},{"date":"2019-08-17T20:07:14+00:00","tweet":"Deval Patrick gives hope and logic to current chaos.Hope to see him run for President or other higher office.He is wonderful to hear speak, just what the country needs.I think it's awesome that he dropped presidential bid to be there for his wife. Peace to you and family.","name":"deval patrick","Sentiment":0.425},{"date":"2019-08-17T19:49:46+00:00","tweet":"“You were Obama before Obama.” So right, Van. Deval Patrick is one of my favorite human beings. I have witnessed his intellect, heart and integrity consistently. Wish he was in this race! I would not hesitate to vote for him. Glad his wife is healthy! @DevalPatrick @VanJones68","name":"deval patrick","Sentiment":0.3705357143},{"date":"2019-08-17T18:19:52+00:00","tweet":"Heads up @DevalPatrick fans. Tonight at 7pm on @CNN @VanJones68 ... #mapoli …","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-17T12:17:26+00:00","tweet":"Watch an all new episode of the #VanJonesShow featuring presidential candidate @jayinslee, former MA Gov. @DevalPatrick and @dianeguerrero__ from @OITNB TONIGHT at 7pm ET on @CNN.","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-08-14T15:11:26+00:00","tweet":"I know it’s politics and all, but of Charlie Baker had had his way, we probably would have just tried to reform the old orange line cars. Thanks @DevalPatrick …","name":"deval patrick","Sentiment":0.15},{"date":"2019-08-14T13:53:17+00:00","tweet":"Friendly reminder that these Orange Line cars were ordered under Governor @DevalPatrick and not Governor @CharlieBakerMA #mapoli","name":"deval patrick","Sentiment":0.375},{"date":"2019-08-14T11:51:27+00:00","tweet":"Retweet to thank Governor @DevalPatrick for showing the leadership and foresight to invest in new Orange Line cars. #mapoli …","name":"deval patrick","Sentiment":0.1363636364},{"date":"2019-08-14T10:55:41+00:00","tweet":"Ooh press conference … somewhere else. Applause. (PS thank you Governor @DevalPatrick)","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-04T15:35:08+00:00","tweet":"Both Dan O’Connell and Greg Bialecki, who each served as EOHED secretary for @DevalPatrick, call on the legislature to adopt @MassGovernor's #HousingChoice legislation saying that adequate housing supply is a critical component of ensuring MA's economic competitiveness.","name":"deval patrick","Sentiment":0.1777777778},{"date":"2019-09-03T09:27:03+00:00","tweet":"The biggest failure of the Deval Patrick admin was not getting rid of the lucrative overtime details that cops use to double their salary, instead of using cheaper civilian flagmen like the other 49 states do. I get that he couldn't b\/c of the cop unions, but taxpayers lost out.","name":"deval patrick","Sentiment":-0.1472222222},{"date":"2019-09-01T11:53:23+00:00","tweet":"I personally was supporting Deval Patrick this time last year. At times, I also wanted Bullock, Brown, and Holder.","name":"deval patrick","Sentiment":0.0833333333},{"date":"2019-08-30T16:57:14+00:00","tweet":"Something we Lefty Dems need to think about: If Sanders wins the nomination, Vermont will hold a special election to fill his Senate seat. If Warren wins the nomination, Massachusetts' GOP Gov. Deval Patrick gets to fill her Senate seat. Just sayin'... …","name":"deval patrick","Sentiment":0.319047619},{"date":"2019-08-28T20:54:05+00:00","tweet":"Governor @DevalPatrick introduced @ewarren","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-23T15:15:14+00:00","tweet":"The idea of cashiering a 42-year incumbent like Markey (house included) or a Ways & Means chair like Neal once would've been anathema in Mass The state LOVED pols who were both nationally prominent *and* took care of home w that Big Dig + DoD $$$: EMK, Kerry, Barney, Moakley","name":"deval patrick","Sentiment":0.4},{"date":"2019-08-23T14:48:14+00:00","tweet":"Talked to lots of Mass Dems who said some version of \"this would be out of character for Joe\" BUT: Kennedys have a history of primarying incumbents! RFK, Joe's grandfather, helped push LBJ out in '68 and EMK took on Carter in '80.","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-22T10:09:47+00:00","tweet":"you mean the ones governor @devalpatrick ordered in 2013? that you appear to be taking credit for? …","name":"deval patrick","Sentiment":-0.3125},{"date":"2019-08-21T23:55:09+00:00","tweet":"Agree 100% that's the American dream.However that's not her.And while your point is valid, it has nothing to do with the original tweet. E has no business experience and for her to say she will fix the middle class is ridiculous. she was manufactured by the MA democratic machine","name":"deval patrick","Sentiment":0.0104166667},{"date":"2019-08-21T13:48:13+00:00","tweet":"#Investing for #Impact at Scale: @DevalPatrick with @LisaGreenHall You don’t have to trade returns for Impact Going beyond comfort zone: when u figure out how to figure things out, it changes EVERYTHING We’re pretty good at innovation, but not transition #ImpInv #SUGlobalSummit","name":"deval patrick","Sentiment":0.475},{"date":"2019-08-21T13:40:45+00:00","tweet":"\"It's not the government's role to do good for everyone. It's everyone's.\"- @DevalPatrick #SUGlobalSummit #profitforpurpose","name":"deval patrick","Sentiment":0.7},{"date":"2019-08-21T13:25:12+00:00","tweet":"Bain Capital exec. & former Mass. governor Deval Patrick talks about impact investing and how it can contribute to the public good. #SUGlobalSummit","name":"deval patrick","Sentiment":0.2333333333},{"date":"2019-08-21T10:18:36+00:00","tweet":"So excited to be here in San Francisco for this energizing, one of a kind, conference. Honored by the opportunity to share a stage with @DevalPatrick and talk about #impinv. What challenges and potential does the new economy present for the field of #impact? …","name":"deval patrick","Sentiment":0.2222727273},{"date":"2019-08-17T20:01:39+00:00","tweet":"#Zechariah5:1-4 @gtconway3d @WillieGeist @HillaryClinton (1Kings18:27 @SXMUrbanView #Artemis @Adrienne_DNC @GOPChairwoman #DitchMoscowMitch @CorbieCrow @Pontifex @RevDrBarber @Gospel1590AM @DevalPatrick @csmonitor @TheRealReggieB2 @WomenintheWorld","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-14T21:35:18+00:00","tweet":"When Deval Patrick wanted to raise more revenue for transportation, House leadership insisted that it be accompanied by cost-cutting. (sending this tweet from a delayed train)","name":"deval patrick","Sentiment":0.5},{"date":"2019-08-14T21:28:41+00:00","tweet":"She is a complete buffoon. Deval Patrick had to hold her hand all the way through her first senate race, I mean it was totally pathetic. If you are not from MA I guess you wouldn't know, but she has been totally coached the whole way. She is an empty shell and will collapse.","name":"deval patrick","Sentiment":-0.1232142857},{"date":"2019-08-14T15:33:11+00:00","tweet":"Thank you Governor Deval Patrick! …","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-14T15:13:20+00:00","tweet":"Thanks for making this happen, @DevalPatrick! #mapoli #OrangeLine …","name":"deval patrick","Sentiment":0.25},{"date":"2019-08-14T13:19:49+00:00","tweet":"Thanks to the administration of @DevalPatrick you mean?","name":"deval patrick","Sentiment":-0.05625},{"date":"2019-08-14T13:18:06+00:00","tweet":"THANKS DEVAL PATRICK …","name":"deval patrick","Sentiment":0.2},{"date":"2019-08-14T12:12:06+00:00","tweet":"Thank you, @DevalPatrick. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-14T11:56:44+00:00","tweet":"I hear the customers from Dot are Red with anger, while Eastie riders are blue they once again are second class citizens and Allston riders are Green with envy! Orange you glad you live in Charlestown? Charlie on the MTA may never return. “Fight the fair increase, vote...”","name":"deval patrick","Sentiment":0.0482954545},{"date":"2019-08-14T11:52:24+00:00","tweet":"Be sure to send your blessings to Deval Patrick today #orangelinecars","name":"deval patrick","Sentiment":0.5},{"date":"2019-08-14T11:36:32+00:00","tweet":"Thank you @DevalPatrick A Patrick Adminstration Legacy Investment …","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-14T09:44:22+00:00","tweet":"Smug arrogant deval patrick clone","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-12T22:54:23+00:00","tweet":"The elitist, politician who never worked an hour outside academia is going to rebuild the middle class. Yup....sure. OK. Got it. Free college...free healthcare, just like no more property taxes. Right @DevalPatrick? Clowns. @AMSweather @Feminina","name":"deval patrick","Sentiment":0.155952381},{"date":"2019-08-12T19:45:24+00:00","tweet":".@BainCapital Double Impact’s @DevalPatrick and @Patagonia’s Rose Marcario Share How Business Can Build an #Inclusive and #Regenerative Economy |@BCorporation #BtheChange #BCorp #socent #impinv #equity","name":"deval patrick","Sentiment":0.3},{"date":"2019-08-12T12:57:17+00:00","tweet":"Everybody be sure to thank @DevalPatrick …","name":"deval patrick","Sentiment":0.5},{"date":"2019-08-11T23:08:39+00:00","tweet":"As my former governor Deval Patrick would say, “Optimism and effort is how you dig yourself out of a hole!”","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-11T19:49:35+00:00","tweet":"Democratic State Senator Dan Sutton of Flandreau, South Dakota accused of fondling a male page. … Carl Stanley McGee, 38, prominent gay activist, assistant secretary for policy and planning and top aid to democrat governor Deval Patrick of Massachuttsettes,","name":"deval patrick","Sentiment":0.3541666667},{"date":"2019-08-11T07:33:34+00:00","tweet":"I told Hillary Clinton if you listened to me one voice in Massachusetts she would have won...if she did the right thing, she would be in jail, expose Massachusetts @DevalPatrick Obama & Hillary ask them to read my affidavits they can't get out of this one. @CharlieBakerMA @VP","name":"deval patrick","Sentiment":0.0928571429},{"date":"2019-08-11T07:27:54+00:00","tweet":"Think how wonderful it would have been if you \"Listened to Every Voice\" From Massachusetts I left a beautiful public information paper trailublic Corruption, Concealing Evidence start with @DevalPatrick ask him Why did you fire Jean Pontikas, investigate Whitey's B. death","name":"deval patrick","Sentiment":0.4625},{"date":"2019-08-10T19:00:19+00:00","tweet":"A great teacher who is full of excitement and love for her students can make all the difference in their lives - Deval Patrick #fulkersonservices #family","name":"deval patrick","Sentiment":0.55},{"date":"2019-08-10T07:59:03+00:00","tweet":"@ewarren Same old speech. Same old \"white\" Democrat. Who does your tweeting for you? Saw your 1st press conference, Deval Patrick former Assachusetts Governor had to take over for you. You were like a deer caught in headlights. Stop murdering people to gun grab.","name":"deval patrick","Sentiment":0.0333333333},{"date":"2019-08-08T22:53:31+00:00","tweet":"Good morning from Manila! \"A great teacher who is full of excitement and love for her students can make all the difference in their lives.\" Deval Patrick","name":"deval patrick","Sentiment":0.63125},{"date":"2019-08-08T18:00:16+00:00","tweet":"Former MA Governor and current managing director at @BainCapital @DevalPatrick knows that impact-driven businesses will lead the world to a better future. Gov. Patrick will be a keynote speaker at Champions Retreat.","name":"deval patrick","Sentiment":0.125},{"date":"2019-08-03T19:07:47+00:00","tweet":"You reap what you sow. @DevalPatrick has a whole speech on this and it could not be more true. We have the option to sow better seeds America. We must sow better seeds. …","name":"deval patrick","Sentiment":0.41},{"date":"2019-08-03T14:50:00+00:00","tweet":"Fantastic show coming tonight with former MA Gov. Deval Patrick, @dianeguerrero__ from @OITNB & author @Chris_arnade. Tune in 7ET on @CNN","name":"deval patrick","Sentiment":0.2},{"date":"2019-08-03T14:12:06+00:00","tweet":"7pm tonight, @DevalPatrick and @dianeguerrero__ join @VanJones68 for the #VanJonesShow and I can’t wait! Tune in!","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-02T18:18:00+00:00","tweet":"Dumpy reporter Cheryl Fiandaca has a Deval Patrick appointed Judge for a brother. Three months ago he had Torrie Jenkins in his courtroom on a drug dealing charge, and despite 25 previous arrests at the time, he let him off with probation. …","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-08-02T15:37:02+00:00","tweet":"My man, Van. A walking best practice in journalism. (Taking your advice & going social with this.) Thank you for fighting the good fight. Shoutout to OG @DevalPatrick for calling out the silence across the aisle today. @VanJones68 #FeelingInspired","name":"deval patrick","Sentiment":0.5777777778},{"date":"2019-07-31T14:33:06+00:00","tweet":"happy birthday to two former Massachusetts governors, only one of whom is running for president: @GovBillWeld and @DevalPatrick","name":"deval patrick","Sentiment":0.2666666667},{"date":"2019-07-31T08:38:42+00:00","tweet":"Happy birthday to two of my favorite folks, both of whom have influenced my life and career significantly: @DevalPatrick and @jk_rowling","name":"deval patrick","Sentiment":0.5583333333},{"date":"2019-07-24T16:01:31+00:00","tweet":"The #ServeAmericaTogether Presidential Challenge #2020Election @CNN @DevalPatrick @MSNBC","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-24T15:48:17+00:00","tweet":"Boston is THRILLED to welcome the @NAACP National Convention in 2020. I am honored and proud to represent Boston in this video with trailblazers like @attorneytanisha, @DevalPatrick, and Rev. Liz Walker.","name":"deval patrick","Sentiment":0.7333333333},{"date":"2019-07-23T20:09:35+00:00","tweet":"Here is a 100% true story: one time I drank all of Deval Patrick’s gin and he was pretty upset about it so I had to leave","name":"deval patrick","Sentiment":0.3},{"date":"2019-07-23T16:50:56+00:00","tweet":"Check out @DevalPatrick's appearance on @BloombergTV today! Learn more about his take on #nationalservice and the #ServeAmericaTogether campaign— … @ServeUSA2gether @ServiceYear","name":"deval patrick","Sentiment":0.5},{"date":"2019-07-23T16:33:30+00:00","tweet":"Tune in at 5:33 for our extended interview with former Governor @DevalPatrick. He talks about his national service idea - plus the Democratic presidential field and the @mbta. 106.1 Boston\/92.9 HD 2 @bloombergbaybiz @BainCapital","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-23T14:59:54+00:00","tweet":"We had a chance to speak with former Massachusetts Governor Deval Patrick about his new Serve America Together initiative, and we asked him about the MBTA, of course...hear it tonight at 5:33 on Bloomberg Baystate Business.","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-07-23T12:51:03+00:00","tweet":"\"We are at a time when the nation needs everyone on deck…and serving together is a wonderful way to encourage coming together.” -@DevalPatrick on @BloombergTV #ServeAmericaTogether","name":"deval patrick","Sentiment":1.0},{"date":"2019-07-19T00:29:29+00:00","tweet":"There have only been 2 elected African-American Governors in history: Douglas Wilder and Deval Patrick.","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-15T23:32:21+00:00","tweet":"At least a few instantly recognizable names on @mjhegar's Q2 filing: Rosie O'Donnell, Deval Patrick, Kristen Bell and Cecile Richards #txsen","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-07-15T19:16:25+00:00","tweet":"On my way back the thought hit me: Can you imagine the #mapoli fireworks if the MBTA melt-down happened on Deval Patrick's watch? He wouldn't have heard the end of it. The Herald would be dragging him DAILY. Yet Charlie Baker, for whatever dumb reason, is getting a free pass.","name":"deval patrick","Sentiment":0.00625},{"date":"2019-07-15T17:08:02+00:00","tweet":"She grew up in Chicago, you know, that city where the failure that is Deval Patrick is from. And what exactly has she done for the citizens who elected her? Nothing. And she voted against humanitarian aid for the illegal aliens that are storming our borders. She’s disgraceful!","name":"deval patrick","Sentiment":-0.2305555556},{"date":"2019-07-15T15:15:08+00:00","tweet":"Sorry you were right. Another black usurper from Chicago. Barack Obama, Deval Patrick, Alyanna Pressley.","name":"deval patrick","Sentiment":-0.126984127},{"date":"2019-07-15T11:43:52+00:00","tweet":"Yep and when Deval Patrick got to office he didn’t try to dismantle it because it was created by a Republican. He made it better.","name":"deval patrick","Sentiment":0.5},{"date":"2019-07-15T08:40:06+00:00","tweet":"Before Polito the LG position was vacant for half of 2013 and all 2014. Deval Patrick's separately elected LG Tim Murray resigned to take a chamber of commerce presidency, though the decision was clouded by a campaign finance investigation he subsequently settled.","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-07-15T03:54:16+00:00","tweet":"and deval patrick was from chicago, and warren’s from oklahoma, and nicki tsongas was born in california, and and and","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-14T11:16:53+00:00","tweet":"That doesn't exclude minorities, of course. I could see him being comfortable with or picking Booker for example. Or Deval Patrick. He will (without much hesitation) pick Harris if he needs to, but not unless he needs to.","name":"deval patrick","Sentiment":0.3},{"date":"2019-07-13T21:31:26+00:00","tweet":"Yeah let's seize private citizen's and companies' assets and spend them the way I see fit. Why do all the screwballs migrate to MA and set up political HQ, Mitt Romney, Deval Patrick, and this human sponge who's never accomplished a damn thing in life CARPETBAGGERS ARE TOXIC","name":"deval patrick","Sentiment":0.06},{"date":"2019-07-13T14:51:48+00:00","tweet":"For sure. In her defense though, John Lewis didn't back her in her primary. The entire CBC abandoned her. Deval Patrick didn't back her. She probably feels like she doesn't owe anything politically to anybody.","name":"deval patrick","Sentiment":0.15},{"date":"2019-07-12T22:59:37+00:00","tweet":"aoc\/justice democrats align with the same people whom made targets of 3 black politicians listed as potential candidates for 2020. this was in 2017. their biggest fear was a black candidate running. they began targeting for smears kamala harris, deval patrick and corey booker","name":"deval patrick","Sentiment":-0.0833333333},{"date":"2019-07-12T22:02:54+00:00","tweet":"You know, the @TheDemocrats lost any moral high ground they may of had over the Republicans, when the corrupt Clintons (Epstein's Good Friends...ew) single handedly hijacked the party. Just Stop It! Whatever influence you once had on social media is over. #cancelled","name":"deval patrick","Sentiment":0.0506746032},{"date":"2019-07-12T20:28:37+00:00","tweet":"Just words #devalpatrick","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-12T20:14:58+00:00","tweet":"Deval Patrick (D) was MA Governor when a certain Scott Brown (R) won a special election in MA... Nothing is a guarantee. You don't want to give up what you already have. Especially a senate seat.","name":"deval patrick","Sentiment":0.1904761905},{"date":"2019-07-12T15:05:10+00:00","tweet":"#AriannaHuff, Laura Lauder, Andrew Hauptman #StanMcChrystal @StanMcChrystal #SecDef Robert Gates #DevalPatrick Pls retweet #YouthWakeUpCall 4 #EveryZipCode Challenge 1-year 17 to 18 debate on #CivicED & AmeriCorps … @ServeUSA2gether","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-11T18:22:29+00:00","tweet":"If this man had been permitted by Deval Patrick to soldier on as Sec'y, the MA transportation system might look very different today. #mapoli …","name":"deval patrick","Sentiment":-0.05},{"date":"2019-07-11T12:30:52+00:00","tweet":"They are so stop stepping on it Third Way. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-07-11T10:46:33+00:00","tweet":"@dbongino Dan its time to put Deval Patrick on the campaign radar. Former Mass Gov. claim to fame “Yes we can” He’s the perfect candidate coming off the bench, polished in Obama tactics.","name":"deval patrick","Sentiment":0.5},{"date":"2019-07-11T05:50:41+00:00","tweet":"Connolly and his supporters don’t like Deval Patrick. They believe he is a neoliberal shill. Getting a job at Bain didn’t help his image.","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-05T19:45:43+00:00","tweet":"Nobody scared Deval Patrick out of running in 2016. Where did he come up with that?","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-05T19:39:08+00:00","tweet":"Go get Deval Patrick he's our ticket to 8 years of peace and stability. Go get Deval Patrick and make him run the field is weak","name":"deval patrick","Sentiment":-0.375},{"date":"2019-10-03T21:15:58+00:00","tweet":"Reflection:10 yrs ago @JosianeMartinez @wilnelia_rivera & I busting our butts on Gov @DevalPatrick re-elect b\/c #RepresentationMatters. 2day Wil receives award by @MassVOTE Josie a keynote @HubWeek & I’m at event as a city council candidate. #puñeta & we still #JennyFromTheBlock","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-02T20:10:55+00:00","tweet":"Honored to share the stage tonight with @DevalPatrick to talk about impact investing and mission-driven entrepreneurship. #KeepTheNorthCold","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-01T19:36:06+00:00","tweet":"Jesse Mermell, former Deval Patrick aide, to declare for Joe Kennedy seat","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-01T16:11:25+00:00","tweet":"Jesse Mermell, a former Deval Patrick aide and Brookline selectwoman, will formally launch a campaign for the congressional seat held by Representative Joe Kennedy III. #mapoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-01T16:00:00+00:00","tweet":"NEW: @jessemermell is running for congress. She'll launch her campaign for @joekennedy's seat tomorrow in Fall River. Mermell recently resigned as president of the Alliance for Business Leadership & was a top aide to Gov. Deval Patrick. She lives in Brookline. #MA04 #MA4 #mapoli","name":"deval patrick","Sentiment":0.2121212121},{"date":"2019-10-01T15:59:00+00:00","tweet":"Former Brookline selectwoman, progressive business group head and Deval Patrick aide @jessemermell will announce her candidacy for the congressional seat being given up by JKIII tomorrow in Fall River. #MApoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-25T11:18:13+00:00","tweet":"More “democrat truths” vs facts from Deval Patrick","name":"deval patrick","Sentiment":0.5},{"date":"2019-09-22T09:28:35+00:00","tweet":"\"David Halbert, who used to work for Governor Deval Patrick, has also made waves in the at-large race and picked up several progressive endorsements”. Check out @votehalbert for his incredibly thoughtful proposals on housing and BPS. Make him 1\/4 at-large votes Tuesday! #bospoli","name":"deval patrick","Sentiment":0.25},{"date":"2019-09-18T12:38:32+00:00","tweet":"“Government is the name we give to the things we do together” says @DevalPatrick per Barney Frank this morning at the @BCorporation #ChampionsRetreat2019","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-18T12:34:24+00:00","tweet":"Launching into the final day of #ChampionsRetreat2019, former Massachusetts governor @DevalPatrick discusses the future of capitalism: “Everybody has a role, every single sector ... in creating a future worthy of the love we have for our children and grandchildren.”","name":"deval patrick","Sentiment":0.1088435374},{"date":"2019-09-17T21:15:26+00:00","tweet":"The moment Trump was elected I had already made up in my mind I was either supporting Cory Booker, Kamala Harris, or Deval Patrick. When the Senate Intel committee hearings took place, it was THEN when Kamala won my support. I didn’t know much about her accomplishments back then.","name":"deval patrick","Sentiment":0.15},{"date":"2019-09-15T19:16:00+00:00","tweet":"\"A great teacher who is full of excitement and love for her students can make all the difference in their lives.\" Deval Patrick","name":"deval patrick","Sentiment":0.55},{"date":"2019-09-13T18:42:45+00:00","tweet":"Love Deval Patrick.","name":"deval patrick","Sentiment":0.5},{"date":"2019-09-13T18:19:38+00:00","tweet":"Former Massachusetts Governor Deval Patrick calls Julian Castro's attack on Joe Biden \"unnecessary\"","name":"deval patrick","Sentiment":-0.2},{"date":"2019-09-13T15:39:12+00:00","tweet":"Welcome to our new @CBSNews Political Contributor @DevalPatrick! Hope to have him join @margbrennan on @FaceTheNation soon! …","name":"deval patrick","Sentiment":0.3121212121},{"date":"2019-09-13T10:19:05+00:00","tweet":"Former Massachusetts Gov. Deval Patrick joins CBS News as contributor","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-13T09:11:28+00:00","tweet":"It's not relevant to Doyle's but @JamieEldridgeMA has a bill that would remove the cap on liquor licenses. It should pass because the cap is prohibitionist nonsense. S\/o to @AyannaPressley & @DevalPatrick who've also worked to reform MA's liquor licensing …","name":"deval patrick","Sentiment":-0.2},{"date":"2019-09-13T08:53:18+00:00","tweet":"We're excited to announce that former Massachusetts Governor @DevalPatrick is our newest @CBSNews Political Contributor. He'll provide his insights to us throughout the 2020 election.","name":"deval patrick","Sentiment":0.125},{"date":"2019-10-09T11:13:00+00:00","tweet":"Looking forward to joining @DevalPatrick, @CNCS_CEO, @isawhill, @BillGalston & others at @BrookingsInst tomorrow to discuss the importance of expanding #nationalservice. Register to attend in person or watch via livestream:","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-09T09:16:32+00:00","tweet":"S\/o to @MittRomney, @DevalPatrick and @CharlieBakerMA, because it was really a bipartisan effort to let public transit continue to atrophy to such an extent.","name":"deval patrick","Sentiment":0.0666666667},{"date":"2019-10-08T16:51:30+00:00","tweet":"I’ll miss you MarDee. You used to call me “chickadee” when I was a young field organizer for @devalpatrick in your neck of the woods, and I looked up to you as a true mentor. May your memory be a blessing. …","name":"deval patrick","Sentiment":0.225},{"date":"2019-10-07T08:12:33+00:00","tweet":"1. You are a total cheeseball. 2. We already knew that. 3. This is incredibly awesome and beyond well deserved.","name":"deval patrick","Sentiment":0.5},{"date":"2019-10-02T08:02:40+00:00","tweet":"Big news about ⁦@BostonJCRC⁩ Council member ⁦@jessemermell⁩. Jesse Mermell, former Deval Patrick aide, to declare for Joe Kennedy seat - The Boston Globe …","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-29T15:34:14+00:00","tweet":"This is going to be an awesome event and @CAIAAssociation certainly appreciates the star-studded speaker line-up. Thanks @DevalPatrick, @ericdayton and all of our local Members! …","name":"deval patrick","Sentiment":0.3535714286},{"date":"2019-09-28T12:05:05+00:00","tweet":"Senator Tammy Duckworth for Homeland Security. Leave the red state senators alone and mine the states with Dem majorities to fill the cabinet. Deval Patrick's out there too. He could probably use a job.","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-26T09:14:25+00:00","tweet":"Public lecture today at 4:30pm! @DevalPatrick will talk about #climatechange, #environmentalpolicy, #cleanenergy, #greenhousegas initiatives, and corporate sustainability efforts. Details:","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-25T16:44:03+00:00","tweet":"Great event today! We learned about tackling #digitaltransformation from some of the country’s top CIOs and IT leaders at @carsdotcom @Parkmobile @UPS and @BeaconHealthOpts. Former Gov. of Mass. Deval Patrick kicked off the event with an inspiring message on leadership.","name":"deval patrick","Sentiment":0.5},{"date":"2019-09-25T14:20:49+00:00","tweet":"Don’t miss tomorrow’s 9\/26, 4:30pm lecture with @DevalPatrick discussing #climatechange, #environmentalpolicy, #cleanenergy, #greenhousegas initiatives, corporate sustainability efforts. Details at","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-25T10:37:19+00:00","tweet":"Hectic day of back to back meetings. Just ran into our former First Lady Diane Patrick! So great to chat about Niagara Falls, @gencitizen, @TeamProject351, and all things civics. I miss her and @DevalPatrick. #mapoli #togetherwecan","name":"deval patrick","Sentiment":0.2225},{"date":"2019-09-24T09:01:50+00:00","tweet":"EVENT: Join us this Thursday from 4:30 - 5:45 for @UMichLaw's Environmental Law and Policy Program's discussion with @DevalPatrick on #cleanenergy, corporate #sustainability and more!","name":"deval patrick","Sentiment":0.3125},{"date":"2019-09-18T14:41:53+00:00","tweet":"My first real life sighting of the new orange line trains ordered under the @DevalPatrick administration! Unfortunately, this one was headed the wrong direction for me so I have to hope on al old train. #mapoli @massdems #FixTheT","name":"deval patrick","Sentiment":-0.0465909091},{"date":"2019-09-18T12:16:59+00:00","tweet":"10 Years of MassChallenge and the innovation community of Boston has boomed! @DevalPatrick, @bussgang, @Linda_Pizzuti","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-13T17:26:15+00:00","tweet":"News: Former #MA Governor @DevalPatrick joins @CBSNews #wbz #mapoli ⤵️ …","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-13T14:13:22+00:00","tweet":"It’s been a hectic day but kicking it off with @AndrewGillum on @NewDayCNN and @DevalPatrick on @CBSThisMorning got me ready for it. We’re ready to elect @TheDemocrats up and down the ballot. #FlaPol #mapoli #2020election","name":"deval patrick","Sentiment":0.2611111111},{"date":"2019-09-13T10:09:39+00:00","tweet":"Deval Patrick calls Castro's attack on Biden \"unnecessary\"","name":"deval patrick","Sentiment":-0.4},{"date":"2019-09-13T09:59:49+00:00","tweet":"Former Massachusetts Gov. Deval Patrick, a new @CBSNews political contributor, said he was put off by Julian Castro's attack on former VP Joe Biden during Thursday's debate, saying he \"groaned\" while watching the events unfold","name":"deval patrick","Sentiment":0.0340909091},{"date":"2019-09-10T23:06:40+00:00","tweet":"I got to appreciate how iconic @DoylesCafe is b\/c of @MattOMalley He introduced me to @MartinOMalley, @DevalPatrick,@MassAGO & @replizmalia there. Matt & @KathrynNiforos hosted a Doyle’s brunch for their wedding guests This is a big loss for the Clr, #JamaicaPlain & #Boston …","name":"deval patrick","Sentiment":0.25},{"date":"2019-09-10T21:45:22+00:00","tweet":"@DevalPatrick @CharlieBakerMA @marty_walsh @SenWarren @SenMarkey @maura_healey @AyannaPressley @RepStephenLynch @RepKClark @RepLoriTrahan @sethmoulton @RepMcGovern all @massdems Each and everyone of these degenerates are just as useless as the spineless @SenatorRomney.","name":"deval patrick","Sentiment":-0.5},{"date":"2019-09-10T15:22:02+00:00","tweet":"Well, @CharlieBakerMA could do a bloody lot of good by removing the Weymouth compressor cudgel lawfully deny all permits. The power is and always has been in his administration's hands.","name":"deval patrick","Sentiment":-0.0333333333},{"date":"2019-09-10T09:14:45+00:00","tweet":"@MassGovernor following the route of another non-rider?","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-10T08:58:06+00:00","tweet":"Which one?","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-10T08:30:47+00:00","tweet":"Deval Patrick. Gavin Newsome. Mark Warner. about 200 congressmen. There are a LOT of VP prospects at any given time.","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-10T07:38:29+00:00","tweet":"A member of former Gov. @devalpatrick’s press team weighed in on what might be behind Baker’s decision. It’s a “check the box” move that removes a cudgel used by critics of his leadership. …","name":"deval patrick","Sentiment":-0.2},{"date":"2019-09-06T16:08:55+00:00","tweet":".@jennkliu is a rockstar! I’ve admired and looked up to her ever since she was a fierce finance minx and I was a green organizer on Team @DevalPatrick\/@TimMurray_MA 2010. I’m so proud to see her making waves in the big leagues of American politics. …","name":"deval patrick","Sentiment":0.15},{"date":"2019-09-05T21:40:30+00:00","tweet":"John Brittain does it again! @UDCLaw prof @jbrittatty will receive a 2019 CLEO EDGE Award the same night @DevalPatrick is awarded the #VernonEJordanJr Heritage Award! Stay tuned...","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-04T17:16:22+00:00","tweet":"#WhatWereReading: Six former top #MAEconDev and housing officials who worked for Govs. Mitt Romney, Deval Patrick and Charlie Baker came to the Statehouse Wednesday to show support for @MassGovernor's #HousingChoice bill. More from @masslivenews:","name":"deval patrick","Sentiment":0.3333333333},{"date":"2019-08-27T09:35:26+00:00","tweet":"Reminder: Deval Patrick was very public about wanting to raise taxes to fix the T. Our public transit would've been in a much better state if the Democratic supermajority in the Legislature hadn't opposed him #mapoli …","name":"deval patrick","Sentiment":0.1666666667},{"date":"2019-08-23T18:02:59+00:00","tweet":"What's ominous for Markey is how Massachusetts pols, who are ostensibly for the incumbent now, change their tune when asked what they'd do if Kennedy is in the race. Lots of praise for both of em and equivocation.","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-23T15:51:18+00:00","tweet":"To be fair, I'm pretty sure Deval Patrick has forgotten about Deval Patrick","name":"deval patrick","Sentiment":0.4833333333},{"date":"2019-08-23T15:50:16+00:00","tweet":"I forgot Deval Patrick","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-23T14:39:51+00:00","tweet":"Walsh makes clear he'd only look at Senate if it's an open seat: “I’m not going to run against Ed Markey,\" he said. Mass Dems are split on Kennedy taking on Markey @BarneyFrank: \"I think it’s a mistake\" But @DevalPatrick says \"I like the idea of competitive primaries\"","name":"deval patrick","Sentiment":0.0333333333},{"date":"2019-08-23T11:14:41+00:00","tweet":"I moved to #Beijing in 2008. I left 2 months ago. During that time, they've built the equivalent of an entire @NYCTSubway + more. Meanwhile, the @MBTA hasn't even been able to get a bus onto a ramp. I blame @govbaker. (Congestion wasn't as bad when @DevalPatrick was Gov.) \/3","name":"deval patrick","Sentiment":0.06},{"date":"2019-08-21T20:12:41+00:00","tweet":"Federal killings at Ruby Ridge became a lasting outrage after Asst. Atty. Gen. Deval Patrick ruled that an FBI sniper did not use \"excessive force\" when he gunned down Vicki Weaver standing in her Idaho cabin door holding her baby. …","name":"deval patrick","Sentiment":-0.1351851852},{"date":"2019-08-21T10:52:43+00:00","tweet":"You didn't even ride the train. You got in your black SUV and left. Also, the new Red & Orange Line cars are not \"your effort\" they are @DevalPatrick's effort.","name":"deval patrick","Sentiment":-0.0075757576},{"date":"2019-08-17T20:34:15+00:00","tweet":"I respect Murkowski. I live in Mass. and there were some good things Romney did as Gov. that I didn't hate, though I preferred Deval Patrick. There are definitely some Republicans no longer in office who I think are basically intelligent, good people.","name":"deval patrick","Sentiment":0.2560606061},{"date":"2019-08-17T20:07:14+00:00","tweet":"Deval Patrick gives hope and logic to current chaos.Hope to see him run for President or other higher office.He is wonderful to hear speak, just what the country needs.I think it's awesome that he dropped presidential bid to be there for his wife. Peace to you and family.","name":"deval patrick","Sentiment":0.425},{"date":"2019-08-17T19:49:46+00:00","tweet":"“You were Obama before Obama.” So right, Van. Deval Patrick is one of my favorite human beings. I have witnessed his intellect, heart and integrity consistently. Wish he was in this race! I would not hesitate to vote for him. Glad his wife is healthy! @DevalPatrick @VanJones68","name":"deval patrick","Sentiment":0.3705357143},{"date":"2019-08-17T18:19:52+00:00","tweet":"Heads up @DevalPatrick fans. Tonight at 7pm on @CNN @VanJones68 ... #mapoli …","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-17T12:17:26+00:00","tweet":"Watch an all new episode of the #VanJonesShow featuring presidential candidate @jayinslee, former MA Gov. @DevalPatrick and @dianeguerrero__ from @OITNB TONIGHT at 7pm ET on @CNN.","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-08-14T15:11:26+00:00","tweet":"I know it’s politics and all, but of Charlie Baker had had his way, we probably would have just tried to reform the old orange line cars. Thanks @DevalPatrick …","name":"deval patrick","Sentiment":0.15},{"date":"2019-08-14T13:53:17+00:00","tweet":"Friendly reminder that these Orange Line cars were ordered under Governor @DevalPatrick and not Governor @CharlieBakerMA #mapoli","name":"deval patrick","Sentiment":0.375},{"date":"2019-08-14T11:51:27+00:00","tweet":"Retweet to thank Governor @DevalPatrick for showing the leadership and foresight to invest in new Orange Line cars. #mapoli …","name":"deval patrick","Sentiment":0.1363636364},{"date":"2019-08-14T10:55:41+00:00","tweet":"Ooh press conference … somewhere else. Applause. (PS thank you Governor @DevalPatrick)","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-14T09:44:22+00:00","tweet":"Smug arrogant deval patrick clone","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-12T22:54:23+00:00","tweet":"The elitist, politician who never worked an hour outside academia is going to rebuild the middle class. Yup....sure. OK. Got it. Free college...free healthcare, just like no more property taxes. Right @DevalPatrick? Clowns. @AMSweather @Feminina","name":"deval patrick","Sentiment":0.155952381},{"date":"2019-08-12T19:45:24+00:00","tweet":".@BainCapital Double Impact’s @DevalPatrick and @Patagonia’s Rose Marcario Share How Business Can Build an #Inclusive and #Regenerative Economy |@BCorporation #BtheChange #BCorp #socent #impinv #equity","name":"deval patrick","Sentiment":0.3},{"date":"2019-08-12T12:57:17+00:00","tweet":"Everybody be sure to thank @DevalPatrick …","name":"deval patrick","Sentiment":0.5},{"date":"2019-08-11T23:08:39+00:00","tweet":"As my former governor Deval Patrick would say, “Optimism and effort is how you dig yourself out of a hole!”","name":"deval patrick","Sentiment":0.0},{"date":"2019-08-11T19:49:35+00:00","tweet":"Democratic State Senator Dan Sutton of Flandreau, South Dakota accused of fondling a male page. … Carl Stanley McGee, 38, prominent gay activist, assistant secretary for policy and planning and top aid to democrat governor Deval Patrick of Massachuttsettes,","name":"deval patrick","Sentiment":0.3541666667},{"date":"2019-08-11T07:33:34+00:00","tweet":"I told Hillary Clinton if you listened to me one voice in Massachusetts she would have won...if she did the right thing, she would be in jail, expose Massachusetts @DevalPatrick Obama & Hillary ask them to read my affidavits they can't get out of this one. @CharlieBakerMA @VP","name":"deval patrick","Sentiment":0.0928571429},{"date":"2019-08-11T07:27:54+00:00","tweet":"Think how wonderful it would have been if you \"Listened to Every Voice\" From Massachusetts I left a beautiful public information paper trailublic Corruption, Concealing Evidence start with @DevalPatrick ask him Why did you fire Jean Pontikas, investigate Whitey's B. death","name":"deval patrick","Sentiment":0.4625},{"date":"2019-11-08T15:35:06+00:00","tweet":"GROSS. Just awful. Deval Patrick?!?! My lord. Is she serious? I can’t even.","name":"deval patrick","Sentiment":-0.4444444444},{"date":"2019-11-08T10:41:13+00:00","tweet":"In case you missed it, Bain Capital Managing Director Deval Patrick is on @ewarren’s shortlist for a cabinet position. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-08T09:45:02+00:00","tweet":"Deval Patrick is not going to fight wall Street","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-08T09:43:17+00:00","tweet":"Deval Patrick is business as usual to the maximum, which is why Warren name checking him is antithetical to her proclaimed vision. This isn’t hard Chuck","name":"deval patrick","Sentiment":-0.2708333333},{"date":"2019-11-08T09:01:45+00:00","tweet":"I was sorry when @DevalPatrick opted out of the 2020 contest. So this makes my day: \"Bloomberg is not the only Democrat taking a second look at a presidential bid... Eric Holder and former Gov. Deval Patrick have had conversations with supporters about campaigns as well.\"","name":"deval patrick","Sentiment":-0.125},{"date":"2019-11-08T04:50:03+00:00","tweet":"Deval Patrick was a great governor","name":"deval patrick","Sentiment":0.8},{"date":"2019-11-07T23:27:32+00:00","tweet":"Elizabeth Warren suggests Deval Patrick and Melody Barnes as possible cabinet members in her admin who are AA Patrick is with Bain Capital - Mitt Romney's vulture capital company - and Barnes worked at CAP with Neera Tanden HELLO SOMEBODY.... #ThatsNotProgressive","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T22:38:16+00:00","tweet":".@ewarren, whom I really like, has -- in this particular instance -- given real ammunition to those who say she is Obama 2.0. Absolutely appalling and unacceptable. Deval Patrick is a non-starter.","name":"deval patrick","Sentiment":0.0541666667},{"date":"2019-11-07T21:44:23+00:00","tweet":"Deval Patrick was also the governor of Massachusetts which seems more notable","name":"deval patrick","Sentiment":0.5},{"date":"2019-11-07T21:35:43+00:00","tweet":"Yeah Deval Patrick is not good. Very not good. Democratic former Gov. Deval Patrick’s biography isn’t an uplifting rags-to-riches story but an ugly tale of corruption among the American power elite. …","name":"deval patrick","Sentiment":-0.2},{"date":"2019-11-07T21:05:00+00:00","tweet":"Bain Capital was co-founded by Mitt Romney. Deval Patrick is a Managing Director. Elizabeth Warren wants Patrick in her administration. @EmmaVigeland @atrios @NomikiKonst @_michaelbrooks @BernieBroStar","name":"deval patrick","Sentiment":0.2},{"date":"2019-11-07T20:19:29+00:00","tweet":"Deval Patrick sucks.","name":"deval patrick","Sentiment":-0.3},{"date":"2019-11-07T20:05:40+00:00","tweet":"Deval Patrick served on the board at subprime mortgage giant Ameriquest. Melody Barnes is on the board at bigwig defense contractor Booz Allen Hamilton. Textbook cases of the revolving door corruption Warren frequently attacks. …","name":"deval patrick","Sentiment":0.05},{"date":"2019-11-07T15:49:55+00:00","tweet":"Warren struggles to name 3 Black People she'd want in her Cabinet. She finally remembered Deval Patrick and her friend Melanie Barnes. She's bad at this.","name":"deval patrick","Sentiment":-0.2888888889},{"date":"2019-11-07T14:08:09+00:00","tweet":"Worth noting that the two people @ewarren floated as potential cabinet members today have worked in industries she regularly slams on the trail as “corrupt.” @DevalPatrick is a managing director an Bane Capital and @MelodyCBarnes lobbied in 2003-04 for liberal advocacy groups …","name":"deval patrick","Sentiment":-0.05},{"date":"2019-11-03T12:11:46+00:00","tweet":"Deval Patrick is a thief who spent thousands on his office when he was governor. Wanted it too look like a palace. No wonder he got out of politics.","name":"deval patrick","Sentiment":-0.1},{"date":"2019-10-22T15:48:00+00:00","tweet":"Not the Onion: New York Times piece speculates Democratic Party insiders might try to lure John Kerry, Hillary Clinton, Deval Patrick, Mike Bloomberg, or Eric Holder as “white knight” saviors in the presidential race. …","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-10-16T09:37:37+00:00","tweet":"Love Deval Patrick, but Elizabeth Warren capitulated you If Not Now like Nancy Pelosi has. The Democratic Party is in danger of being Corbynized, but our media doesn’t see this.","name":"deval patrick","Sentiment":0.5},{"date":"2019-10-14T11:44:46+00:00","tweet":"Celebrated the #AcademyInduction ceremony with some fellow inductees: Michel Martin @NPRMichel beloved NPR & CNN host, Deval Patrick @DevalPatrick former Gov of Massachusetts, Don Berwick @donberwick President Emeritus & Fellow of the Institute for healthcare improvement @theIHI","name":"deval patrick","Sentiment":0.35},{"date":"2019-10-12T13:44:09+00:00","tweet":"Wes Moore Sir! You were certainly giving Johnathan a run for his money in the suit, head to toe game. Sharp as a #2 pencil! -Elsewhere on Black Twitter. And, I hope, one day I get to vote for Deval Patrick as a candidate for President of the United States. Godspeed to all!","name":"deval patrick","Sentiment":-0.1375744048},{"date":"2019-11-09T01:14:44+00:00","tweet":"You actually believe Warren ever said that someone who lobbied for the ACLU 15 years ago is \"corrupt\"? As for Deval Patrick, he only works on an environmental fund that invests in companies in order to drive social and environmental impact, similar to what Al Gore does.","name":"deval patrick","Sentiment":-0.0933333333},{"date":"2019-11-08T09:13:52+00:00","tweet":"I like the idea of Big Structural Change. But, when I see names like Deval Patrick floated it becomes clear that there is a belief that you can have Big Structural Change without needing Big Cultural Change","name":"deval patrick","Sentiment":0.04},{"date":"2019-11-07T23:56:53+00:00","tweet":"Excited for Warren to staff her entire administration out of Bain Capital, BlackRock, and CAP.","name":"deval patrick","Sentiment":0.1875},{"date":"2019-11-07T23:45:32+00:00","tweet":"This is why some on the left are skeptical of Warren. She floated having Deval Patrick, a Managing Director at Bain Capital, in her cabinet. …","name":"deval patrick","Sentiment":-0.25},{"date":"2019-11-07T23:01:22+00:00","tweet":"Ah cool, two big criminal corporatists. Nice big structural change you got there, Liz","name":"deval patrick","Sentiment":0.11},{"date":"2019-11-07T23:00:52+00:00","tweet":"Note Liz Warren's body language when asked what Blacks might be in her cabinet. After a minute or 2 of stalling, she drop's Deval Patrick's name and then IMMEDIATELY touches her nose with *the fingers of her left hand*. That's what she did when asked about her health care plan. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T22:00:18+00:00","tweet":"Angela Rye asks Elizabeth Warren to name 3 African Americans she'd choose to be in her Admin. Warren: Melody Barnes: Board member of Ventas REIT- invests in health systems and big real estate developments. Deval Patrick: Dir. of BainCapital …","name":"deval patrick","Sentiment":0.0666666667},{"date":"2019-11-07T21:25:58+00:00","tweet":"Hey @WorkingFamilies, you going to back Warren wanting to put someone from Bain in her cabinet? I remember when Occupy railed against Romney for being at Bain Capital.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T21:18:18+00:00","tweet":"The first person she names is a vulture capitalist... totally progressive.","name":"deval patrick","Sentiment":0.125},{"date":"2019-11-07T21:17:38+00:00","tweet":"Bain Capital is a client of Warren's daughter's company BTG.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T21:08:46+00:00","tweet":"This is not a progressive.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T20:12:04+00:00","tweet":"Deval Patrick is a MANAGING DIRECTOR AT BAIN CAPITAL—YES, THE MITT ROMNEY PLACE …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T16:37:04+00:00","tweet":"She got people from Citibank and DeutscheBank to run the CFPB and it's head later went off to make a fortune in the industry he oversaw. This is a pattern with Warren.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T12:48:55+00:00","tweet":"Asked which 3 African Americans she’d want in her White House, @ewarren says she won’t name any current politicians, but drops @DevalPatrick’s name, adds “someone like” @MelodyCBarnes","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T12:33:33+00:00","tweet":"Deval Patrick who works for Bain Capital? …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-05T06:25:43+00:00","tweet":"She did everything thing she could to undermine me & block every significant transit reform I proposed when I was Deval Patrick’s Transportation Secretary. She was an uncompromising GOP partisan. So vote for her at your peril if you care about a sustainable Boston, folks: …","name":"deval patrick","Sentiment":0.375},{"date":"2019-11-04T10:28:35+00:00","tweet":"Fun fact about Planet Fitness, which I also use! Former Massachusetts Governor @DevalPatrick helped fund the national expansion to reach underserved communities.","name":"deval patrick","Sentiment":0.1875},{"date":"2019-10-22T08:07:57+00:00","tweet":"It says a lot that after 2016 Hillary Clinton, John Kerry, Eric Holder, Micheal Bloomberg, Deval Patrick, and so many others think just the right centrist *might* be what the country really wants Their day is over …","name":"deval patrick","Sentiment":0.3285714286},{"date":"2019-10-21T18:52:54+00:00","tweet":"\"It takes time for people to learn to see.The woke need to make room for the still waking,” because we all still are, to some degree. “It’s the only way to get through this with a little bit of grace.” … @ellmcgirt @DevalPatrick @Choo_EK #WhiteFragility","name":"deval patrick","Sentiment":-0.09375},{"date":"2019-10-12T12:21:06+00:00","tweet":"Philanthropy and government have a critical role to play in the poverty fight, and both bear complicity for the state of inequality we have today. I was honored to join these leaders @DevalPatrick and @CapehartJ in discussion at my friend @darrenwalker’s #NewGospelOfWealth – at Ford Foundation","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-12T10:53:35+00:00","tweet":"Blessings and love","name":"deval patrick","Sentiment":0.5},{"date":"2019-10-12T09:55:41+00:00","tweet":"Put your hat in the ring Sir","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-11T10:35:53+00:00","tweet":"Thank you again to Deval Patrick (@DevalPatrick) for visiting #UMichLaw as part of the Environmental Law and Policy Program's Lecture Series. Read more about his discussions of innovation, clean energy, and a green economy:","name":"deval patrick","Sentiment":0.2222222222},{"date":"2019-10-10T14:26:53+00:00","tweet":"\"It is inspiring to be associated with entrepreneurs trying to make our democracy work for everyone\" We're inspired by you, @DevalPatrick! Excited to have you join the @highergroundlab Advisory Board: …","name":"deval patrick","Sentiment":0.5},{"date":"2019-10-10T10:59:23+00:00","tweet":"Welcome to @highergroundlab, Governor @DevalPatrick! You know a thing or two about winning tough campaigns. We're beyond thrilled to have you on side to build a strong progressive campaign tech & data ecosystem. …","name":"deval patrick","Sentiment":0.4288888889},{"date":"2019-10-10T09:28:31+00:00","tweet":"Proud to work with one of my political idols, @DevalPatrick. Welcome to @highergroundlab, Governor. …","name":"deval patrick","Sentiment":0.5333333333},{"date":"2019-10-10T08:03:46+00:00","tweet":".@DevalPatrick’s new gig, @ShannonForMA’s new video, @AlexBMorse’s fundraising haul and @AyannaPressley’s Boston City Council at-large picks. It’s all in your inbox! #mapoli","name":"deval patrick","Sentiment":0.1534090909},{"date":"2019-10-03T21:15:58+00:00","tweet":"Reflection:10 yrs ago @JosianeMartinez @wilnelia_rivera & I busting our butts on Gov @DevalPatrick re-elect b\/c #RepresentationMatters. 2day Wil receives award by @MassVOTE Josie a keynote @HubWeek & I’m at event as a city council candidate. #puñeta & we still #JennyFromTheBlock","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-01T19:36:06+00:00","tweet":"Jesse Mermell, former Deval Patrick aide, to declare for Joe Kennedy seat","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-01T16:11:25+00:00","tweet":"Jesse Mermell, a former Deval Patrick aide and Brookline selectwoman, will formally launch a campaign for the congressional seat held by Representative Joe Kennedy III. #mapoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-10-01T16:00:00+00:00","tweet":"NEW: @jessemermell is running for congress. She'll launch her campaign for @joekennedy's seat tomorrow in Fall River. Mermell recently resigned as president of the Alliance for Business Leadership & was a top aide to Gov. Deval Patrick. She lives in Brookline. #MA04 #MA4 #mapoli","name":"deval patrick","Sentiment":0.2121212121},{"date":"2019-10-01T15:59:00+00:00","tweet":"Former Brookline selectwoman, progressive business group head and Deval Patrick aide @jessemermell will announce her candidacy for the congressional seat being given up by JKIII tomorrow in Fall River. #MApoli","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-25T11:18:13+00:00","tweet":"More “democrat truths” vs facts from Deval Patrick","name":"deval patrick","Sentiment":0.5},{"date":"2019-09-22T09:28:35+00:00","tweet":"\"David Halbert, who used to work for Governor Deval Patrick, has also made waves in the at-large race and picked up several progressive endorsements”. Check out @votehalbert for his incredibly thoughtful proposals on housing and BPS. Make him 1\/4 at-large votes Tuesday! #bospoli","name":"deval patrick","Sentiment":0.25},{"date":"2019-09-18T12:34:24+00:00","tweet":"Launching into the final day of #ChampionsRetreat2019, former Massachusetts governor @DevalPatrick discusses the future of capitalism: “Everybody has a role, every single sector ... in creating a future worthy of the love we have for our children and grandchildren.”","name":"deval patrick","Sentiment":0.1088435374},{"date":"2019-09-17T21:15:26+00:00","tweet":"The moment Trump was elected I had already made up in my mind I was either supporting Cory Booker, Kamala Harris, or Deval Patrick. When the Senate Intel committee hearings took place, it was THEN when Kamala won my support. I didn’t know much about her accomplishments back then.","name":"deval patrick","Sentiment":0.15},{"date":"2019-09-15T19:16:00+00:00","tweet":"\"A great teacher who is full of excitement and love for her students can make all the difference in their lives.\" Deval Patrick","name":"deval patrick","Sentiment":0.55},{"date":"2019-09-13T18:42:45+00:00","tweet":"Love Deval Patrick.","name":"deval patrick","Sentiment":0.5},{"date":"2019-09-13T18:19:38+00:00","tweet":"Former Massachusetts Governor Deval Patrick calls Julian Castro's attack on Joe Biden \"unnecessary\"","name":"deval patrick","Sentiment":-0.2},{"date":"2019-09-13T15:39:12+00:00","tweet":"Welcome to our new @CBSNews Political Contributor @DevalPatrick! Hope to have him join @margbrennan on @FaceTheNation soon! …","name":"deval patrick","Sentiment":0.3121212121},{"date":"2019-09-13T10:19:05+00:00","tweet":"Former Massachusetts Gov. Deval Patrick joins CBS News as contributor","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-13T08:53:18+00:00","tweet":"We're excited to announce that former Massachusetts Governor @DevalPatrick is our newest @CBSNews Political Contributor. He'll provide his insights to us throughout the 2020 election.","name":"deval patrick","Sentiment":0.125},{"date":"2019-09-13T08:18:27+00:00","tweet":"@CBSNews @CBSThisMorning @DevalPatrick please bring political objectify to your new commentary role at CBS.","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-09-13T08:08:00+00:00","tweet":"@JoeBiden “Relax when challeged” says Deval Patrick. Good advice. @DrBiden @BarackObama","name":"deval patrick","Sentiment":0.7},{"date":"2019-09-13T08:05:23+00:00","tweet":"Deval Patrick added to the lineup of political analysts for CBS. Excellent choice.","name":"deval patrick","Sentiment":0.5},{"date":"2019-09-13T08:05:04+00:00","tweet":"So nice to see Former #MA Governor @DevalPatrick on @CBSThisMorning!!","name":"deval patrick","Sentiment":0.3},{"date":"2019-09-13T06:44:37+00:00","tweet":"Coming up on @CBSThisMorning: - @MajorCBS, @edokeefe, & @DevalPatrick break down lat night's debate - @lauriesantos talks about her new podcast \"The Happiness Lab\" and tells us how people can find happiness even when things don't go their way ++ HAPPY FRIDAY!!","name":"deval patrick","Sentiment":0.4761616162},{"date":"2019-09-13T06:09:15+00:00","tweet":"Deval Patrick must have coached him.","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-13T01:50:56+00:00","tweet":"Barry was said to be grooming Deval Patrick, but I think he has issues. I expect there is a sleeper out there..perhaps Stacy Abrams. She has issues too. My fear: Biden wins with a sleeper. He steps down after a few months and we end up with a VP rising to Pres we didn’t elect","name":"deval patrick","Sentiment":0.1861111111},{"date":"2019-09-12T22:00:21+00:00","tweet":"I’m sorry to say that this is an underwhelming field. It’s too bad we don’t have someone like Deval Patrick taking part in the conversation. He’s a voice that Dems need to hear.","name":"deval patrick","Sentiment":-0.6},{"date":"2019-09-12T21:32:04+00:00","tweet":"Watching this debate and being from Massachusetts can’t help but think that America lost out when Deval Patrick decided not to run for President.","name":"deval patrick","Sentiment":0.0},{"date":"2019-09-12T00:30:33+00:00","tweet":"That would be the last sermon I ever heard from that pastor! Ex-Governor #DevalPatrick called it a \"failure of human understanding\". #Clown …","name":"deval patrick","Sentiment":-0.1494791667},{"date":"2019-12-05T19:53:25+00:00","tweet":"If we want big change that lasts we have to bring other people in. To win, we need everybody, everywhere. We need the people who feel left out and feel left back, the people who participate all the time and those never do— and everyone in between. …","name":"deval patrick","Sentiment":0.1125},{"date":"2019-12-05T15:33:28+00:00","tweet":"I have watching tv’s today last 2 interviews have been Steyer and deval Patrick go figure …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-05T15:03:47+00:00","tweet":"Time Change for Deval Patrick: Now 11:00 AM on Saturday - …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-05T14:59:09+00:00","tweet":"Excited for Matthew to bring his knowledge and experience to my team. …","name":"deval patrick","Sentiment":0.375},{"date":"2019-12-05T11:20:09+00:00","tweet":"Democracy demands accountability, and elections deserve integrity. Thank you @SpeakerPelosi for standing up for all of us. We can't afford to wait. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-05T09:40:17+00:00","tweet":"Democrats, you had 4 black candidates, incl newest entry Deval Patrick. He too will drop out soon Apparently the Party of Lynching Negroes has been FOUND OUT! And you wonder if the polls showing @realDonaldTrump with 34% black approval is real? #TeamKJ","name":"deval patrick","Sentiment":-0.0177083333},{"date":"2019-12-05T00:00:00+00:00","tweet":"From Clinton to Obama, top Democrats have long been beholden to the predatory and socially useless private equity industry. Finance bros are donating in droves to Biden, Buttigieg . . . and Deval Patrick (?). They just really want to stop Bernie Sanders. …","name":"deval patrick","Sentiment":0.03},{"date":"2019-12-04T18:04:51+00:00","tweet":"My grandmother used to say that we weren't poor, just broke, because broke was temporary. Like so many others, we used food stamps at times. This cruel move by the Trump administration just makes it harder for families to get on their feet and for kids to succeed. …","name":"deval patrick","Sentiment":-0.25},{"date":"2019-12-04T14:14:29+00:00","tweet":"We are so excited and can't wait to visit South Carolina again a few days! …","name":"deval patrick","Sentiment":0.0625},{"date":"2019-12-03T21:47:40+00:00","tweet":"Deval Patrick Julian Castro Andrew Yang Tulsi Gabbard Didn't know they were white...","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-03T21:22:22+00:00","tweet":"One month ago I never imagined I’d be the National Organizing Director for @DevalPatrick for President. Tonight was a dream come true. Thank you Gov for joining hundreds of volunteers for tonight’s National Volunteer Call. Hope for the best, and work for it! #DevalForAll","name":"deval patrick","Sentiment":0.675},{"date":"2019-12-03T19:37:31+00:00","tweet":"Thank you Governor @DevalPatrick for stopping by the @NHDems building today. The team enjoyed meeting you and letting you know our plans for a 2020 Democratic sweep in N.H. #NHPolitics","name":"deval patrick","Sentiment":0.5},{"date":"2019-12-03T15:34:04+00:00","tweet":"I hope that @SenKamalaHarris will have a long and productive career in public service. We are better, as a Party and as a Nation, with her talent, her dedication, and her voice in the public square. I look forward to working with her in the years ahead.","name":"deval patrick","Sentiment":0.1125},{"date":"2019-12-03T14:06:18+00:00","tweet":"Kamala Harris was never my first choice, but MY GOD was she a better choice than: Michael Bennet Joe Biden Michael Bloomberg Pete Buttigieg John Delaney Tulsi Gabbard Deval Patrick Tom Steyer and Marianne Williamson","name":"deval patrick","Sentiment":0.375},{"date":"2019-12-03T13:50:58+00:00","tweet":"Sen. Harris had already qualified for the upcoming Democratic debate on December 19. Now that she has dropped out, the debate lineup is currently entirely white — as of today, Andrew Yang, Cory Booker, Julian Castro, Tulsi Gabbard, and Deval Patrick have not yet qualified.","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-01T17:56:08+00:00","tweet":"Everyone dunking on Sestak, but Deval Patrick jumped in with a lot more hype and you *already* forgot he was running.","name":"deval patrick","Sentiment":0.5},{"date":"2019-12-01T12:00:31+00:00","tweet":"It was great speaking with @Melanie4Senate in NH yesterday. Inspired by her leadership.","name":"deval patrick","Sentiment":0.8},{"date":"2019-11-30T15:35:28+00:00","tweet":"Great stop at Buckley's Bakery in Hollis, NH this afternoon. Proud to support #SmallBusinessSaturday.","name":"deval patrick","Sentiment":0.8},{"date":"2019-11-29T08:06:32+00:00","tweet":"Baby Yoda is driving almost twice as many average social media interactions as any 2020 Democrat. …","name":"deval patrick","Sentiment":0.1277777778},{"date":"2019-11-28T15:47:11+00:00","tweet":"I have a lot to be thankful for today. When we embarked on this journey, I asked for your time, energy, and support as we fight for a better American Dream for all. I’ve been blown away by this grassroots team’s commitment. Wishing you and your family a happy Thanksgiving.","name":"deval patrick","Sentiment":0.4333333333},{"date":"2019-12-05T20:28:37+00:00","tweet":"WATCH DEVAL PATRICK’S MSNBC INTERVIEW WITH ALI VELSHI ️Learn more about his record & future policy rollouts ️Proven experience. Proven Record. Proven Success. #DevalForAll …","name":"deval patrick","Sentiment":0.2666666667},{"date":"2019-12-05T17:28:58+00:00","tweet":"So, @DevalPatrick. what's up?","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-05T15:30:49+00:00","tweet":"Bain Capital alum? No thanks, @DevalPatrick #DealBreaker @AliVelshi","name":"deval patrick","Sentiment":-0.1},{"date":"2019-12-05T12:05:10+00:00","tweet":"John Kerry is bypassing the senior senator from Massachusetts, Elizabeth Warren (as well as former governor Deval Patrick) to back Joe Biden. “I just think Joe is the person for the moment,” Kerry said. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-05T10:54:35+00:00","tweet":"I got an invite to a Deval Patrick house party and... I forgot he was running?","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-04T16:16:22+00:00","tweet":"Kamala Harris, Cory Booker, Deval Patrick & Julian Castro are all being completely rejected by Democrats. Wonder why they hate minorities so much?","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-12-04T12:18:44+00:00","tweet":"Endorse Biden! America needs his cool leadership🇺🇸🇺🇸","name":"deval patrick","Sentiment":0.35},{"date":"2019-12-04T09:17:51+00:00","tweet":"Okay, I’m also really liking Deval Patrick","name":"deval patrick","Sentiment":0.35},{"date":"2019-12-02T14:15:23+00:00","tweet":"Two more candidates have filed for the Oklahoma Presidential Preferential Primary: Andrew Yang (D) and Deval Patrick (D). Find the complete list of candidates at: .","name":"deval patrick","Sentiment":0.3333333333},{"date":"2019-12-02T09:43:09+00:00","tweet":"Gov. Steve Bullock (D-MT) suspends campaign for President. Bad year for D Governors, unless Ex-Gov. Deval Patrick of Massachusetts—the most recent candidate—surprises.","name":"deval patrick","Sentiment":-0.0666666667},{"date":"2019-12-01T21:42:22+00:00","tweet":"Dreaming in Progress #CSPAN #Election2020 #DevalPatrick 🇺🇸","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-01T10:26:12+00:00","tweet":"Deval Patrick: Listening to PEOPLE not pollsters & pundits, campaigning through GRASSROOTS, bringing varied experiences & skills from a PROVEN RECORD","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-30T14:20:00+00:00","tweet":"Baby Yoda, the juggernaut character from Disney+'s Star Wars series \"The Mandalorian,\" is driving almost twice as many average social media interactions on news stories about it as any 2020 Democrat. …","name":"deval patrick","Sentiment":0.1277777778},{"date":"2019-11-29T20:35:00+00:00","tweet":"Baby Yoda is driving almost twice as many average social media interactions as any 2020 Democrat. …","name":"deval patrick","Sentiment":0.1277777778},{"date":"2019-11-29T09:08:48+00:00","tweet":"Baby Yoda, Michael Bloomberg, and Deval Patrick all made their big splashes in mid-November, but only one really resonated with people online. (Hint: It's the tiny green one.) …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-28T19:06:31+00:00","tweet":"Can you imagine anyone door knocking for Joe Biden or Buttigieg, or Bloombucks or Deval Patrick?","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-28T07:42:52+00:00","tweet":"Breaking tradition this year and having crab-stuffed salmon and asparagus with friends who bring really good wine! Of the many things for which I'm thankful, I recently learned about the Bard Prison Initiative (BPI) making a college education available to inmates. #DevalPatrick","name":"deval patrick","Sentiment":0.44375},{"date":"2019-11-27T15:35:53+00:00","tweet":"Tomorrow is Thanksgiving, and it also marks two weeks since our launch. It’s been a whirlwind trip — all powered by people giving whatever they can to support our campaign. Help us keep building. Pitch in here: …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-27T15:31:00+00:00","tweet":"Deval Patrick: \"I do sense that there's still space for what I offer.\"","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-27T14:14:51+00:00","tweet":"The #obesity candidate? Former @CocaCola General Counsel @DevalPatrick is running for president. A trip down memory lane, via @lawdotcom","name":"deval patrick","Sentiment":-0.0351851852},{"date":"2019-12-05T16:11:21+00:00","tweet":"I’m sure #DevalPatrick, #TomSteyer and #MikeBloomberg all think they have something that’s needed. But I have no interest in hearing from any of them. They’re all sneaking into the marathon at mile 20. Care to change my mind? #Election2020 #PeteButtigieg","name":"deval patrick","Sentiment":0.5},{"date":"2019-12-05T12:46:20+00:00","tweet":"The Governor also proposed the Class Act of 2022, which would allow individiaul communities, not the state to take over underperforming schools. The Governor says he borrows the idea from @DevalPatrick MA Gov. and Democratic candidate for President. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-04T19:42:24+00:00","tweet":".@ryanlcooper Ryan L. Cooper @TheWeek amplified Dayen's article in this horrendously racist article 8\/2017. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-04T18:41:34+00:00","tweet":"Trump seems really proud of this in the pictures.","name":"deval patrick","Sentiment":0.8},{"date":"2019-12-04T12:11:29+00:00","tweet":"No Thanks~ Too Late","name":"deval patrick","Sentiment":-0.2},{"date":"2019-12-04T09:12:13+00:00","tweet":"From Clinton to Obama, top Democrats have long been beholden to the predatory and socially useless private equity industry. Finance bros are donating in droves to Biden, Buttigieg . . . and Deval Patrick (?). They just really want to stop Bernie Sanders. …","name":"deval patrick","Sentiment":0.03},{"date":"2019-12-04T08:35:19+00:00","tweet":"Kamala dropped out before any of these people? What the fuck are we doing here? Michael Bennet John Delaney Deval Patrick Tom Steyer Marianne Williamson Michael Bloomburg Tulsi Gabbard","name":"deval patrick","Sentiment":-0.4},{"date":"2019-12-04T04:19:52+00:00","tweet":"Yang is rich?! SMH","name":"deval patrick","Sentiment":0.46875},{"date":"2019-12-04T01:32:28+00:00","tweet":"Cory and Castro are both out, I don't even know who Deval is and I've watched all the debates so... It's just Yang and Tulsi left, either of which are better choices than what people are pushing as the \"frontrunners\"","name":"deval patrick","Sentiment":0.25},{"date":"2019-12-03T18:11:22+00:00","tweet":".@DevalPatrick on how we can't take anyone for granted and can't just show up for communities when it's time to cast ballots: …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-03T17:44:55+00:00","tweet":"Trump Campaign Mocks ⁦@KamalaHarris ⁩ Kamala Harris Dropping Out: 'Congratulations Tulsi!' #KamalaHarris ⁦@DevalPatrick⁩ …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-03T15:58:20+00:00","tweet":"Deval Patrick Coming to Kittery on Saturday - …","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-03T13:42:21+00:00","tweet":"deval patrick looking at the lane opening up","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-03T13:27:58+00:00","tweet":"Could departure of #KamalaHarris provide new energy for @CoryBooker's campaign? #DevalPatrick is generating scant excitement, so Booker's now the major African-American candidate remaining. If he aims more directly at \"moderate lane\" why not compete with Biden & Buttigieg?","name":"deval patrick","Sentiment":0.1747159091},{"date":"2019-12-02T19:33:13+00:00","tweet":"Deval Patrick will speak to a small gathering of @AMEchurch leaders, a “winter executive board” meeting in Atlanta on Wed. He’s the “only one who requested to come,” an AME official said.","name":"deval patrick","Sentiment":-0.125},{"date":"2019-12-02T15:15:37+00:00","tweet":"Irrespective of what you all think of the candidates, what are your favorite logos? Mine is probably Kamala Harris's, with the runner ups being Deval Patrick and Joe Biden. …","name":"deval patrick","Sentiment":0.5},{"date":"2019-12-01T10:49:08+00:00","tweet":"The former “Democrat”Massachusetts Gov. Deval Patrick devalpatrick Canceled his presidential campaign at Morehouse college Because Only Two People Showed Up. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-30T13:11:47+00:00","tweet":"WATCH DEVAL PATRICK’S MSNBC INTERVIEW FROM THIS MORNING, 11\/30\/19 #DevalPatrick #DevalForAll …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-28T21:36:27+00:00","tweet":"Go for the big picture. We need someone to help us heal after this administration. #DevalPatrick …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-27T10:28:17+00:00","tweet":"The Democrats are desperately trying to shuffle around to find a candidate to beat President Trump. They tried Biden and it's not working. Now they're going to pivot to Deval Patrick and 'Mike' Bloomberg. NEWS FLASH! No one can beat Donald J Trump!","name":"deval patrick","Sentiment":-0.9375},{"date":"2019-12-05T12:07:53+00:00","tweet":"Kerry's early choice of Biden over his home state Senator, @ewarren, along with the decision of @DevalPatrick to run, suggests big money in Massachusetts is playing it safe and moderate, maybe hoping to keep Warren in the Senate? …","name":"deval patrick","Sentiment":0.15},{"date":"2019-12-05T09:01:14+00:00","tweet":"Top 3 Viral 2020 US Presidential Candidates on Instagram 1. @DevalPatrick 2. @TulsiGabbard 3. @GovBillWeld Top 3 Popular 2020 US Presidential Candidates on Instagram 1. @realDonaldTrump 2. @BernieSanders 3. @TulsiGabbard","name":"deval patrick","Sentiment":0.5333333333},{"date":"2019-12-05T08:35:26+00:00","tweet":"She’s an A+ senator even if Steyer tried it he would lose. Something else is afoot. When Obama’s bff, Deval Patrick, entered the race I knew there was something going on behind the scenes. Obama sent him into that race not to win but to block.","name":"deval patrick","Sentiment":0.2},{"date":"2019-12-04T09:26:40+00:00","tweet":"Someone better tell Cory Booker and Deval Patrick that one.","name":"deval patrick","Sentiment":0.5},{"date":"2019-12-03T19:27:32+00:00","tweet":"Deval Patrick hasn’t even been running for president for a full three weeks and he’s already on the “why are they still running” graphic","name":"deval patrick","Sentiment":0.175},{"date":"2019-12-03T14:13:44+00:00","tweet":"Now that Kamala is out, we need to replace her with another Top-Tier candidate - Deval Patrick.","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-03T13:33:30+00:00","tweet":"Women candidates like Kamala Harris and Gillibrand closed their campaigns while billionaires are still buying their spots and other male candidates refuse to concede. Did you know John Delaney and Michael Bennett are still running? Or Deval Patrick?","name":"deval patrick","Sentiment":-0.075},{"date":"2019-12-03T07:56:37+00:00","tweet":"Deval Patrick’s logo is miles ahead of all others. Great use of space, not pretending first-name familiarity, got the “2020” in there to establish purpose, distinctive colors, aesthetically pleasing. Great design job.","name":"deval patrick","Sentiment":0.8},{"date":"2019-12-02T17:04:06+00:00","tweet":"Do a rally","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-02T01:30:09+00:00","tweet":"As of today: Joe Biden Michael Bloomberg Cory Booker Pete Buttigieg Julian Castro Tulsi Gabbard Kamala Harris Amy Klobuchar Deval Patrick Bernie Sanders Tom Steyer Elizabeth Warren Andrew Yang TLR the Democratic lineup is pathetic.","name":"deval patrick","Sentiment":-1.0},{"date":"2019-12-01T17:18:59+00:00","tweet":"Volunteers are hard at work across the country working to get @DevalPatrick on the ballot. Curious to figure out how you can help? Sign up and we’ll invite you to our next national volunteer call to learn more: #DevalforAll …","name":"deval patrick","Sentiment":0.0270833333},{"date":"2019-11-30T11:51:50+00:00","tweet":"Will Deval Patrick be president? Not if his past scandals have anything to say about it. …","name":"deval patrick","Sentiment":-0.25},{"date":"2019-11-29T23:18:29+00:00","tweet":"100% yes. Bloomberg campaign is playing dirty fully intent on buying the Presidency. Overheard campaign employee: - Paying rooms of people to tweet he’s the only way to beat Trump - plans to speak at HBC but plan paying for attendance to prevent a Deval Patrick like scenario","name":"deval patrick","Sentiment":-0.3},{"date":"2019-11-29T10:00:40+00:00","tweet":"Deval Patrick’s Role in Whitewashing the Ruby Ridge Shooting …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-29T08:50:21+00:00","tweet":"That's definitely not the move.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-28T09:57:47+00:00","tweet":"Maybe you support Deval Patrick’s presidential campaign but do you know he only gave out fun size whoppers when I trick or treated at his house?","name":"deval patrick","Sentiment":0.15},{"date":"2019-11-27T18:49:38+00:00","tweet":"STORY: This week, @DevalPatrick made his 2nd visit to SC since launching his presidential campaign. There are two states that are likely to play a critical role in the outcome of his run—the “first in the South” primary state is one of them. #covering2020 …","name":"deval patrick","Sentiment":0.13},{"date":"2019-11-27T15:37:13+00:00","tweet":"Excellent 40 minute C-SPAN Interview w\/ Deval Patrick ️Learn more about him as a person ️Hear about his background, experiences, & skills ️Find out what sets him apart & why he’d be complete contrast to Trump ️Learn about his moral values & vision …","name":"deval patrick","Sentiment":0.4},{"date":"2019-11-27T13:05:55+00:00","tweet":"I don't know which one made me sadder: the obviously homemade Deval Patrick sign or the Hillary sign.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-27T10:02:37+00:00","tweet":"So great to see @WhipClyburn for dinner last night. We went to Kikis in Columbia — my second time there in a week!","name":"deval patrick","Sentiment":0.2666666667},{"date":"2019-12-04T17:45:44+00:00","tweet":"1% for Deval Patrick! Watch out y’all!","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-04T12:18:53+00:00","tweet":"I'm good. Thanks though.","name":"deval patrick","Sentiment":0.45},{"date":"2019-12-03T21:12:19+00:00","tweet":"Deval Patrick, you should consider dropping out. Seriously. I'm not trying to be mean, but, come, on. 🤦‍️","name":"deval patrick","Sentiment":-0.0729166667},{"date":"2019-12-03T18:31:30+00:00","tweet":"Howie Carr: Charlie Baker goes full Deval Patrick with latest EBT scandal","name":"deval patrick","Sentiment":0.425},{"date":"2019-12-02T16:54:14+00:00","tweet":"Join us tomorrow at 9:00 PM EST\/6:00 PM PT for the National Volunteer Call with Governor Deval Patrick. He will be talking about the first weeks on the campaign trail and how you can get involved to help. RSVP here: #devalpatrick2020 #devalforall","name":"deval patrick","Sentiment":0.25},{"date":"2019-12-02T13:47:21+00:00","tweet":"@lasvegasweekly b\/4 filing @uscourts @ewarren @PeteButtigieg @SenSanders @SenBooker @cenkuygur @TomSteyer @SenCortezMasto @JulianCastro @LasVegasSun @PaulaAbdul @MariahCarey @DJPaulyD @MTV @DevalPatrick @TomBrady @Raiders #RaiderNation @GovSisolak @PatMcAfeeShow @PageSix @EW – at Clark County Law Library","name":"deval patrick","Sentiment":0.0},{"date":"2019-12-02T09:01:21+00:00","tweet":"Top 3 Viral 2020 US Presidential Candidates on Instagram 1. @TulsiGabbard 2. @DevalPatrick 3. @MikeBloomberg Top 3 Popular 2020 US Presidential Candidates on Instagram 1. @realDonaldTrump 2. @TulsiGabbard 3. @BernieSanders","name":"deval patrick","Sentiment":0.5333333333},{"date":"2019-11-30T16:00:05+00:00","tweet":"Scary are the priorities of our society. …","name":"deval patrick","Sentiment":-0.5},{"date":"2019-11-30T12:50:40+00:00","tweet":"That man is clearly Deval Patrick...I mean, look at all this unilateral support!","name":"deval patrick","Sentiment":-0.2791666667},{"date":"2019-11-30T12:46:23+00:00","tweet":"Will Deval Patrick be president? Not if his past scandals have anything to say about it. View and Comment Here:","name":"deval patrick","Sentiment":-0.25},{"date":"2019-11-30T11:46:57+00:00","tweet":"Too good not to share... …","name":"deval patrick","Sentiment":0.7},{"date":"2019-11-30T06:50:04+00:00","tweet":"Deval Patrick charts a moderate path through South Carolina …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-29T22:36:59+00:00","tweet":"lol remember when @DevalPatrick started running for president","name":"deval patrick","Sentiment":0.8},{"date":"2019-11-29T14:26:46+00:00","tweet":"The data for this graph was provided to @Axios by @NewsWhip. I’d be curious to see how Trump measures up to this field. (Yes, including Baby Yoda.) …","name":"deval patrick","Sentiment":-0.1},{"date":"2019-11-29T14:00:48+00:00","tweet":"If beating Trump is the goal, check out #DevalPatrick","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-29T13:41:07+00:00","tweet":"#DevalPatrick can be the candidate who can beat Trump and heal the Nation. Listen to what he brings to the table.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-28T07:44:11+00:00","tweet":"Deval Patrick, like Bill Barr, was involved in Ruby Ridge. …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-27T16:16:14+00:00","tweet":"Deval Patrick: Everything you need to know about the 2020 presidential candidate …","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-27T14:39:10+00:00","tweet":"Presidential candidate @DevalPatrick was governor presiding over the biggest drug war scandal in recent U.S. history. His administration perpetuated a coverup that kept thousands of innocent people in prison. …","name":"deval patrick","Sentiment":0.25},{"date":"2019-11-27T09:48:14+00:00","tweet":"The path is narrow and the timeline is short, but this campaign is real. The team is top notch. @DevalPatrick is focused and ready. We can win. Let’s go. #DevalForAll","name":"deval patrick","Sentiment":0.25},{"date":"2019-11-11T18:53:44+00:00","tweet":"Just in: While speculation grows over a @DevalPatrick run for president, @NHDems @ChairmanBuckley \"has not spoken with anyone about a potential Deval Patrick presidential campaign,\" per state party communications director @HollyShulman #fitn #nhpolitics #WMUR","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-11T18:50:27+00:00","tweet":"May the goddess help us all because common sense isn’t working! Focus! We have great candidates. We do not need more. Deval Patrick, Ex-Governor of Massachusetts, Is Considering White House Bid - The New York Times …","name":"deval patrick","Sentiment":0.1935227273},{"date":"2019-11-11T18:48:59+00:00","tweet":"That’s why Deval Patrick and Mike Bloomberg feel the desire to blow millions of dollars on being irrelevant in the 2020 Dem Primary?","name":"deval patrick","Sentiment":-0.05},{"date":"2019-11-11T18:48:29+00:00","tweet":"Democratic Party and business elites (Bloomberg, Deval Patrick) jumping in because they think there's widespread unhappiness w\/ the field. But actual voters really like the current field. Who don't they like? Democratic Party and business elites","name":"deval patrick","Sentiment":0.0666666667},{"date":"2019-11-11T18:43:34+00:00","tweet":"Mad Dash! Now the word is Ex-Governor of Massachusetts, Deval Patrick (aka Obama's best friend) is ready to join the Democrat race for the White House. Its starting to feel like Black Friday circa 2013 …","name":"deval patrick","Sentiment":0.0420138889},{"date":"2019-11-11T18:38:12+00:00","tweet":"NEWS: LMAO Eff @ Deval Patrick and every other corporate Dem a-hole trying to find some sunshine. #Bernie2020 #AcceptNoSubstitutes #NotMeUs","name":"deval patrick","Sentiment":0.1583333333},{"date":"2019-11-11T18:33:49+00:00","tweet":"Why can't Deval Patrick and Eric Holder just support Kamala, instead of running? Nobody ask for this bullshit, and black men will run to assist a Becky or Karen, but keep their feet on a Black Queen's neck...smh","name":"deval patrick","Sentiment":-0.1666666667},{"date":"2019-11-11T18:27:23+00:00","tweet":"Deval Patrick considering last-minute White House bid because clearly the clown car isn’t full enough yet. Maybe he’ll select ⁦@MittRomney⁩ for a running mate …","name":"deval patrick","Sentiment":0.1125},{"date":"2019-11-11T18:26:03+00:00","tweet":"Democratic former Gov. Deval Patrick’s biography isn’t an uplifting rags-to-riches story but an ugly tale of corruption among the American power elite. … via @HuffPostPol","name":"deval patrick","Sentiment":-0.2333333333},{"date":"2019-11-11T18:18:21+00:00","tweet":"Former Mass. Gov. Deval Patrick has reportedly told party leaders he doesn't think any of the candidates running have established political momentum & there's an opening for somebody who can unite both liberals and moderate Democrats. #MTPDaily","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-11T17:47:11+00:00","tweet":"BREAKING: Former Massachusetts Governor Deval Patrick is reportedly considering making a run in the 2020 Democratic presidential primary - NYT","name":"deval patrick","Sentiment":0.2},{"date":"2019-11-11T17:47:02+00:00","tweet":"Massachusetts governor Deval Patrick brings charisma of Michael Bloomberg, and wealth of Pete Buttigieg, to US democratic race.","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-11T17:45:24+00:00","tweet":"WASHINGTON (AP) — Former Massachusetts Gov. Deval Patrick is considering making a late run for the Democratic presidential nomination.","name":"deval patrick","Sentiment":-0.15},{"date":"2019-11-11T17:38:55+00:00","tweet":".@angela_rye asked @ewarren about which African-Americans she'd want in her cabinet. Warren didn't wanna comment on anyone specifically but when pressed, she said @DevalPatrick. \"I talk about my former Governor Deval Patrick who is a pretty terrific guy,\" she said at the time. …","name":"deval patrick","Sentiment":0.0833333333},{"date":"2019-11-11T17:29:24+00:00","tweet":"First, billionaire Tom Steyer. Then, even richer billionaire Michael Bloomberg. Today, it's Deval Patrick, who has worked for: —Texaco —Coca-Cola —Subprime mortgage lender ACC Capital Holdings —Bain Capital (current) …","name":"deval patrick","Sentiment":0.125},{"date":"2019-11-11T17:27:16+00:00","tweet":"New: Deval Patrick, Ex-Governor of Massachusetts, Is Considering White House Bid","name":"deval patrick","Sentiment":0.0681818182},{"date":"2019-11-08T09:45:02+00:00","tweet":"Deval Patrick is not going to fight wall Street","name":"deval patrick","Sentiment":0.0},{"date":"2019-11-07T22:00:18+00:00","tweet":"Angela Rye asks Elizabeth Warren to name 3 African Americans she'd choose to be in her Admin. Warren: Melody Barnes: Board member of Ventas REIT- invests in health systems and big real estate developments. Deval Patrick: Dir. of BainCapital …","name":"deval patrick","Sentiment":0.0666666667},{"date":"2019-11-07T21:05:00+00:00","tweet":"Bain Capital was co-founded by Mitt Romney. Deval Patrick is a Managing Director. Elizabeth Warren wants Patrick in her administration. @EmmaVigeland @atrios @NomikiKonst @_michaelbrooks @BernieBroStar","name":"deval patrick","Sentiment":0.2}]