{"0":{"date":"2019-12-05 15:44:19","tweet":"I want Sen Elizabeth Warren to be my president; to be OUR president. Because she's better than me. A president should be better than I am on my best day. That's Liz Warren. ️","Sentiment":0.6666666667},"1":{"date":"2019-12-04 13:32:23","tweet":"“Bernie is also considered electable due to his experience, and he is not as left on the political spectrum as Elizabeth Warren” good read but Bernie is considered far more left than Liz Warren on the political spectrum!","Sentiment":0.146875},"2":{"date":"2019-12-02 22:36:16","tweet":"Gee....I simply cannot believe anything Elizabeth....er... I mean Betsy....er...I mean Liz Warren has to say. Does her family really call her Betsy? 🤔","Sentiment":-0.10625},"3":{"date":"2019-12-02 21:18:41","tweet":"No one, not Liz Warren, is ever, never ever, going to disband private insurance companies. Never, not ever. The fact that she's lying about it, or is as stupid as a box of rocks, is all we need to know. What is happening with Elizabeth Warren? …","Sentiment":-0.4},"4":{"date":"2019-12-02 10:09:27","tweet":"I'm Going To Leave This Here With You Friends=Kevin Ryan Has Written An Excellent Article On \"A Day\/Rally In Life Of Liz Warren\" (Paraphrasing) Very Real Very Telling-You Decide=MyView= Ryan: Elizabeth Warren does the Wing Ding …","Sentiment":0.65},"5":{"date":"2019-12-02 02:52:51","tweet":"the queen must die before liz warren can achieve her full form for there can only be one true elizabeth at a time","Sentiment":0.2333333333},"6":{"date":"2019-11-30 09:55:06","tweet":"Liz Warren steals and recycles Barack Obama’s ‘You didn’t build that’ line. That’s the thing about Socialists like Elizabeth Warren(D). They have to take everything from others. That’s what Socialists do. They take from you. #copolitics …","Sentiment":0.0},"7":{"date":"2019-11-29 14:12:53","tweet":"The 2020 Campaign: Elizabeth Warren: Who Loves Ya, Baby? - New Hampshire to Liz Warren: Meh (PJ Media) …","Sentiment":0.1363636364},"8":{"date":"2019-11-29 04:32:13","tweet":"Liberals: There is no difference between Bernie Sanders and Elizabeth Warren. You are sexist if you support Bernie. *Liz Warren collapses in the polls after her healthcare plan turns out to be fraud* Liberals: Elizabeth Warren is tanking in the polls because M4A is unpopular.","Sentiment":0.0},"9":{"date":"2019-11-27 08:40:58","tweet":"Sometimes it’s best to walk away from a debate. Elizabeth Warren probably wishes she would have followed that sage advice. But now she is caught in a big education-policy dilemma. And a lie. Liz Warren’s latest lie only deepens her dilemma on education …","Sentiment":0.375},"10":{"date":"2019-11-27 00:55:48","tweet":"It is Liz Warren's lifelong habit to lie. She has been doing this since high school. Pathological. EXPOSED: Elizabeth Warren Caught Lying About Sending Her Son To Public School (VIDEO) … via @gatewaypundit","Sentiment":0.02},"11":{"date":"2019-11-26 05:38:04","tweet":"It was wonderful seeing this short but loving video of the mutual love that Elizabeth Warren and her three grandchildren have for each other️️️ I can’t wait to become a grandmother like Liz Warren us️️️","Sentiment":0.525},"12":{"date":"2019-11-23 20:11:57","tweet":"At this point, it really doesn't matter, since Liz Warren will never ever be President. But, here's some info for ya anyway... Oops! Senator Elizabeth Warren Caught Telling Another Lie …","Sentiment":0.25},"13":{"date":"2019-11-23 18:39:42","tweet":"Rep. Deb Haaland (Elizabeth Warren 2020 campaign co-chair) joins me on #PoliticsNation to talk about her candidate Liz Warren, why she called Trump racist, and more.","Sentiment":0.5},"14":{"date":"2019-11-23 17:18:46","tweet":"@KimStrassel \"You'll never believe what Elizabeth Warren just said!\" \"10 mistakes Elizabeth Warren is making!\" \"Other Democratic candidates hate Liz Warren, here's why!\" \"One simple trick Elizabeth Warren uses to dominate public discourse.\"","Sentiment":-0.28125},"15":{"date":"2019-11-22 20:18:02","tweet":"Liz Warren doesn’t understand the capitalist, free-market model. Cooperman and other billionaires create jobs and bolster a rich economy where everyone thrives: Leon Cooperman Responds To Elizabeth Warren’s Anti-Billionaires TV Ad: ‘She’s Disgraceful’ …","Sentiment":0.125},"16":{"date":"2019-11-21 10:36:35","tweet":"Elizabeth Warren bombs Democratic debate's first question this is fake news liz warren was excellent at the debate she will b the 1st woman potus of usa","Sentiment":0.25},"17":{"date":"2019-11-20 21:14:55","tweet":"Andrea Mitchell asked Liz Warren a question about unifying America, which is a complete pipe dream. Elizabeth Warren responds with her populist anti-elite message. #DemDebate5 – at Wallis Annenberg Hall","Sentiment":0.1},"18":{"date":"2019-11-20 21:06:11","tweet":"Elizabeth Warren says we need to enforce the idea of “no one being above the law” So what about Hillary Clinton? Is she not above the law? She also said we must preserve “constitutional rights” yet she wants to abolish our 2nd amendment. Liz Warren is a lying sociopath.","Sentiment":0.05},"19":{"date":"2019-11-19 18:10:36","tweet":"Wolff is CORRECT: Wealth\/Power is the KEY, not your plans and rules, Liz Warren. Bernie is CORRECT: 99% is greater than 1%. Richard Wolff Grades Elizabeth Warren’s Belief in Innovation via @YouTube","Sentiment":0.25}}