[{"date":"2019-01-31T10:59:51+00:00","tweet":"At this point, I’m all in for Liz Warren., a TRUE PROGRESSIVE! #LizForPres2020 Senator Elizabeth Warren: President Trump Should Say He’s Sorry For Shut... via @YouTube","name":"elizabeth liz warren","Sentiment":-0.03125},{"date":"2019-01-28T18:22:14+00:00","tweet":"Kamala edged out Liz Warren. \"Several of Harris' rivals were actively courting DeJear. Earlier this month, DeJear appeared on stage with Elizabeth Warren during the Massachusetts' senator's recent visit to Ankeny, Iowa.\" …","name":"elizabeth liz warren","Sentiment":-0.0333333333},{"date":"2019-01-27T15:20:00+00:00","tweet":"Elizabeth Warren's modest wealth tax proposal goes from the 2% she proposed for wealth over $50 million to 3% on wealth over a billion. Trump's proposal called for real confiscation-- 14.25%. Let's face it: @AOC & Liz Warren are just sensible reformers.","name":"elizabeth liz warren","Sentiment":0.15},{"date":"2019-01-26T02:35:33+00:00","tweet":"Well, she can ask Elizabeth Warren whether not endorsing Bernie in 2016 was a wise move, only Liz Warren actually had a sorta legit reason not to do it, once she decided not to run herself, and had an incentive not to needlessly anger Clintons, since Bernie was unlikely to win.","name":"elizabeth liz warren","Sentiment":0.05},{"date":"2019-01-24T20:12:25+00:00","tweet":"️ “Elizabeth Warren proposes 'Ultra-Millionaire Tax' on the wealthiest Americans” … i'm voting 4 liz warren 4 potus she will do us proud xoxo","name":"elizabeth liz warren","Sentiment":0.8},{"date":"2019-01-21T15:59:43+00:00","tweet":"ON TOP OF WHICH ELIZABETH WARREN IS THE 1\/2 SISTER OF GEORGE W BUSH ROCKEFELLER - POPE JOHN PAUL II'S SON, LIZ WARREN BEING HIS DAUGHTER...SO WHAT CAN YOU EXPECT FROM HER??!! SAME BELIAL NAZI VATICAN CRAP AS ALWAYS!!","name":"elizabeth liz warren","Sentiment":-0.0729166667},{"date":"2019-01-18T17:38:27+00:00","tweet":"Elizabeth Warren wants Wells Fargo removed from college campuses #FoxBusiness Liz Warren stay out of our banking system. You should be dealing with securing the border.","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-01-15T10:24:09+00:00","tweet":"Not a strong crop of dem candidates coming from the looks of it. Come on, who's it gonna be? Bernie, Liz Warren? Elizabeth Warren makes Hillary look like a woman of the people. That \"I'm gonna get me a beer\" video was most pathetic thing I've ever seen.","name":"elizabeth liz warren","Sentiment":-0.2388888889},{"date":"2019-01-14T16:41:21+00:00","tweet":"Liz Warren couldnt have said it better! Watch \"Elizabeth Warren says 2016 Democratic primary was rigged\" on YouTube","name":"elizabeth liz warren","Sentiment":0.5125},{"date":"2019-01-13T21:39:35+00:00","tweet":"So I'm watching Headliners: Elizabeth Warren. Liz Warren has accomplished so much in her life. She has actually helped people. She made the country a better place to live. And the Bernie people really have to ask themselves what the hell has Bernie Sanders ever accomplished?","name":"elizabeth liz warren","Sentiment":0.2051948052},{"date":"2019-01-07T22:18:18+00:00","tweet":"BIG MISTAKE ELIZABETH WARREN in reponse to the gov shut-down, Liz Warren is donating her salary to an organization that helps immigrants. WHAT! Vets or victims of violence maybe. NOOOO. Does she have any judgement at all? Honestly, what is wrong with this woman? #MAGA","name":"elizabeth liz warren","Sentiment":0.0333333333},{"date":"2019-01-06T17:20:26+00:00","tweet":"Elizabeth Warren's DNA Claim Inflames Some Native Americans | Massachusetts News | US News … Now Liz Warren is claiming to be Black with her fist in the Air.","name":"elizabeth liz warren","Sentiment":-0.1666666667},{"date":"2019-01-05T17:56:08+00:00","tweet":"Elizabeth Warren in Iowa: 'I am not a person of color' … Liz Warren admits that's she's not a person of color. DUH! She is, however, an idiot!","name":"elizabeth liz warren","Sentiment":-0.6875},{"date":"2019-01-04T12:42:16+00:00","tweet":"Elizabeth Warren Fails big time on video. Paul Joseph Watson Describes Pocahontas Liz Warren's Latest Failed Attempt to be Relatable … via @gatewaypundit","name":"elizabeth liz warren","Sentiment":-0.125},{"date":"2019-01-04T10:53:48+00:00","tweet":"Her name is Elizabeth Warren, NOT Liz Warren! YOU do not have license to change it. Only she can do that.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-03T19:58:56+00:00","tweet":"Human mannequin Willard Romney is as unlikable an individual as I’ve ever seen in public life, and we’re talking about Liz Warren? Liz Warren? Elizabeth Warren??? C’mon, man.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-03T16:23:26+00:00","tweet":"@georganneb @realDonaldTrump @joe_warmington Elizabeth Warren trying to be likeable enough. It looks too staged. It is not working. Liz Warren trying to appeal to Joe Sixpack with her beer video. It fell flat like the beer.","name":"elizabeth liz warren","Sentiment":-0.0125},{"date":"2019-01-03T11:26:39+00:00","tweet":"Beto beto run because these windows of excitement don’t last long. Look at what happened to Liz Warren and Cris Christie. Elizabeth Warren can still energize and still has a chance but she may have missed her window. Beto beto not make that mistake. #BetoForPresident","name":"elizabeth liz warren","Sentiment":-0.025},{"date":"2019-01-03T03:02:14+00:00","tweet":"Liz Warren has already made a campaign gaffe and other commentary From the right: Liz Warren’s ‘Dukakis Tank’ Moment Massachusetts Sen. Elizabeth Warren “may have set a new land-speed record in presidential campaign trail gaffes,” suggests The Boston Herald’s Jaclyn Cashman.…","name":"elizabeth liz warren","Sentiment":0.099025974},{"date":"2019-02-01T15:01:40+00:00","tweet":"Liz Warren Quietly Apologizes To Cherokee Nation … A Liar, fraud, theft, even when facts didn't support it, Elizabeth Warren dug in her heals to again CLAIM DNA test VERIFIED she was Native Indian. Now embarrassed, she recants? Democrat Politics #WalkAway","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-30T14:54:15+00:00","tweet":"Elizabeth Warren Shreds Howard Schultz For Thinking He Can 'Buy The Presidency' … Wow, it sounds like Liz Warren thinks he will not kiss her butt !","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2019-01-28T13:52:09+00:00","tweet":"Fox News host freaks out at Liz Warren’s plan to tax NFL owner’s $100 million Imax yacht: ‘He earned it!’: Other the weekend, Sen. Elizabeth Warren (D-MA) jumped at news that Washington Redskins owner Dan Snyder had spent $100 million to buy himself a… …","name":"elizabeth liz warren","Sentiment":-0.1125},{"date":"2019-01-27T00:29:24+00:00","tweet":"Wealth redistribution equals Cultural Marxism, not 5he American way. Liz Warren crashes and burns. Award Winning Economist: Elizabeth Warren Hurt Her Chances With Wealth Tax Proposal (VIDEO) … via @amlookout","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-01-24T16:54:14+00:00","tweet":"Of course Liz Warren’s wealth inequality scheme is unconstitutional, she is a Cultural Marxist. Elizabeth Warren’s new plan to fight wealth inequality is ‘FLAT-OUT un-American’ (and unconstitutional) … via @twitchyteam","name":"elizabeth liz warren","Sentiment":0.1181818182},{"date":"2019-01-21T10:03:52+00:00","tweet":"The Patriot Post: Humor Video: 'Liz Warren's' Relatable Address to Youths | Allie Beth Stuckey offers her hilarious version of Elizabeth Warren’s recent attempt at likability. | …","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-01-09T15:52:39+00:00","tweet":"Hey, #NHPolitics! Liz Warren is on her way! “We are pleased that Senator Elizabeth Warren will join our 60th annual McIntyre-Shaheen 100 Club event.\" -- @NHDems chairman Ray Buckley.","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-01-09T09:17:32+00:00","tweet":"Does Elizabeth Warren Have a Piece of Racist Memorabilia on Her Kitchen Shelf? - … via @GoogleNews so off the mark i would sue fox news over this so hurts liz warren's rep","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-08T02:31:22+00:00","tweet":"In 2003, Elizabeth Warren wrote a book about how the entry of mothers into the workforce has been a disaster for families and the country. LIZ WARREN'S 2003 BOOK Comes Back To Haunt Her [Video] … via @100percFEDUP","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-07T09:02:49+00:00","tweet":"Wait until they find out that Liz Warren's real name is Elizabeth. @gatewaypundit","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-01-07T03:00:36+00:00","tweet":"No, it’s not sexist to call Elizabeth Warren ‘unlikable’ In 2020, all women will be likable. They have to be, since the charge of “unlikable” is now, yes, sexist. A recent Politico article wondered whether Sen. Liz Warren’s newly announced 2020 bid was going to remind peopl…","name":"elizabeth liz warren","Sentiment":0.2121212121},{"date":"2019-01-06T20:25:22+00:00","tweet":"This Didn't End Well: Elizabeth Warren Makes Damning Admission, 'I'm Not A Person of Color' - Young Conservatives. Since a true Native American was defrauded of benefits by her lie, Liz Warren should make restitution!!! …","name":"elizabeth liz warren","Sentiment":0.15},{"date":"2019-01-06T06:23:58+00:00","tweet":"Elizabeth Warren talks Trump in Iowa: 'I can’t stop him from hurling racial insults'. Trump must be a racist against Whites. His insults are directed at 'lily' White Liz Warren since her claim of being Native American was totally debunked.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-04T09:59:23+00:00","tweet":"Lmao the article's title says \"Elizabeth Warren wants to stop Inequality before it starts.\" And @nytopinion says \"Redistribution is important, but it comes too late.\" Not a Liz Warren fan but at least keep your attacks consistent. …","name":"elizabeth liz warren","Sentiment":0.1416666667},{"date":"2019-01-03T17:25:12+00:00","tweet":"\"Liz\" Warren? Is that a bit sexist or just weird? I've never heard her called anything other than \"Elizabeth.\" Not that the DNA thing was a conspiracy theory, she'd just had a litte trouble with the acualité.","name":"elizabeth liz warren","Sentiment":-0.275},{"date":"2019-01-02T11:10:46+00:00","tweet":"I keep reading stories about how harshly people are criticizing Elizabeth Warren, and maybe I'm not as knowledgeable about her politics and\/or character flaws, because I'm all \"HECK YEAH my girl Liz Warren might run for president.\"","name":"elizabeth liz warren","Sentiment":-0.2},{"date":"2019-01-02T08:18:41+00:00","tweet":"“We know who Elizabeth Warren is, but who is Liz Warren? Who is Lizzie Warren? Are they all the same person?” An investigation by Chris Cillizza","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-01T21:56:53+00:00","tweet":"if elizabeth warren went by Liz Warren would she get more votes?","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-01-01T13:44:29+00:00","tweet":"That’s Weird?… Liz Warren Releases Campaign Video — But Skips the Part About Being American Indian? (VIDEO) - … - The Gateway Pundit Just two months ago Elizabeth Warren released her genetic tests on her lineage. For years Elizabeth Warren used the “fa...","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-01-01T12:27:08+00:00","tweet":"IT’S OFFICIAL: Elizabeth Warren Launches 2020 ‘Exploratory Committee’ … Liz Warren and all the Democrat hopefuls are going to be bitterly disappointed when President Trump wins again. @SenWarren and the other 30 something!","name":"elizabeth liz warren","Sentiment":-0.2020833333},{"date":"2019-01-01T10:11:28+00:00","tweet":"Liz Warren will take him down. Sanders is a socialist, and I believe in markets. Elizabeth Warren","name":"elizabeth liz warren","Sentiment":-0.1555555556},{"date":"2018-12-31T18:01:19+00:00","tweet":"To the folks falling over themselves to opine re: “I like Elizabeth Warren, but she can’t win”. “I love Liz Warren & she’s strong on XYZ, but she can’t beat Trump.” WHAT DA FUCK! Either back it up with facts & details or STFU! NO. ONE. CARES. ABOUT. YOUR. UNSUPPORTED. OPINIONS!","name":"elizabeth liz warren","Sentiment":0.2466666667},{"date":"2018-12-31T15:04:42+00:00","tweet":"New take on Elizabeth Warren announcement today: Liz Warren Enters POTUS Race as a Candidate “On the Cusp” …","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2018-12-31T14:06:43+00:00","tweet":"The first Whitest Native American President in the US - Liz Warren? Elizabeth Warren has sugarplums dancing in her hungover head.🤪 …","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2018-12-31T09:48:11+00:00","tweet":"Mine too cause it will guarantee @realDonaldTrump re-election in 2020. Elizabeth Warren has a better chance at becoming the president of a Native American Reservation than becoming president and that is only about a 1\/1024th chance. #Warren2020 Liz Warren","name":"elizabeth liz warren","Sentiment":0.28},{"date":"2018-12-31T09:45:28+00:00","tweet":"Elizabeth Warren Bernie Sanders Kristen gillibrand have no chance of winning a general election. Biden\/Beto ticket will win. #MondayMotivation Senator Warren Liz Warren","name":"elizabeth liz warren","Sentiment":0.45},{"date":"2018-12-26T14:55:37+00:00","tweet":"Liz Warren, Goldman Sachs, a Malaysian Scandal - … -RedState Sen. Elizabeth Warren, D-Mass., winks as she jokes with other senators on the Senate Banking Committee ahead of a hearing on the nomination of Marvin Goodfriend to be a member of the Fede...","name":"elizabeth liz warren","Sentiment":-0.125},{"date":"2018-12-25T16:08:21+00:00","tweet":"Damn Elizabeth, lighten up its Christmas","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2018-12-11T04:02:50+00:00","tweet":"It's highly unlikely we'll see much of Liz Warren for 2020 now that she has \"shot herself in the head\" Elizabeth Warren's Political Trail of Tears …","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2018-12-10T12:23:27+00:00","tweet":"Patreon banning Sargon is to Patreon's finances what Elizabeth Warren releasing her 23 and me results is to Liz Warren's presidential bid.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2018-12-06T16:19:32+00:00","tweet":"Elizabeth is right @JeffNadu is the worst. He also just blocked poor Litzy. He is a total fraud that has bad form while working out.","name":"elizabeth liz warren","Sentiment":-0.3628571429},{"date":"2019-02-23T20:55:48+00:00","tweet":"Same Old Liz Warren in the comfort of Liberal New England calling us all out for being Past Slave owners! If you are going down this path, start with Ralph Northam! Elizabeth Warren says country must address ‘ugly history of racism’ …","name":"elizabeth liz warren","Sentiment":-0.161763468},{"date":"2019-02-21T17:44:43+00:00","tweet":"Liz Warren you r a nut job! Tired of having government taking our $. Child care not a right! Elizabeth Warren Calls Child Care A 'Fundamental Human Right' - Chicks On The Right …","name":"elizabeth liz warren","Sentiment":-0.0014285714},{"date":"2019-02-21T16:58:25+00:00","tweet":"2. Elizabeth Warren: \"I never sabotaged Hillary Clinton's campaign by falsely claiming she changed her vote to appease the banking lobby or come up with half-measures that leave the Oligarchy firmly in charge! That was ANOTHER Liz Warren! Me? I'm almost like Bernie Sanders!\"","name":"elizabeth liz warren","Sentiment":-0.3953125},{"date":"2019-02-21T12:30:31+00:00","tweet":"I'm in too. I love Bernie Sanders. Hope he's our next president. Bernie Sanders can beat Trump-even Trump said so. What would be nice would be Elizabeth Warren admitting that the strongest Dem. ticket would be Bernie as president & Liz Warren as vice president. Unbeatable!!!","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-02-21T12:04:30+00:00","tweet":"I assume this means Nina Sanders or Elizabeth Warren would be top choices. If he's fortunate enough to be the nominee, I'd nominate Nina, she's amazing and dynamic. Liz Warren in a cabinet position and Tulsi Gabbard as Secretary of State.","name":"elizabeth liz warren","Sentiment":0.3},{"date":"2019-02-19T18:21:05+00:00","tweet":"Just what we need, another massive, inefficiently administered gov't entitlement program. A Liz Warren specialty. \/\/ Elizabeth Warren’s Misguided Child-Care Plan …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-19T14:26:52+00:00","tweet":"Fine. Elizabeth Warren is a better candidate than Bernie in every way. Liz Warren 2020","name":"elizabeth liz warren","Sentiment":0.4583333333},{"date":"2019-02-18T19:29:25+00:00","tweet":"Say what you will about Trump calling Liz Warren “Pocahontas”, @KamalaHarris, but at least 1.) He was correct about her lying 2.) Elizabeth Warren actually exists. #JussieLied","name":"elizabeth liz warren","Sentiment":-0.15},{"date":"2019-02-18T13:38:22+00:00","tweet":"Have Bernie's supporters been claiming that Liz Warren stole Bernie's platform?? Because, as I recall, Elizabeth Warren made quite a splash with her policy ideas long before Bernie ran for the Dem nomination and he waited to see if she was running. He took HER place in 2016.","name":"elizabeth liz warren","Sentiment":-0.05},{"date":"2019-02-11T21:37:22+00:00","tweet":"Elizabeth Warren is among the smartest, most serious peo in the US Senate. Bankruptcy is a challenging course in law school. Liz Warren taught bankruptcy at Harvard and wrote books and articles analyzing it. She's part of the team to overhaul the economy, but not the ticket.","name":"elizabeth liz warren","Sentiment":0.2222222222},{"date":"2019-02-11T06:51:12+00:00","tweet":"In which Liz Warren admits there are other forms out there with her claiming Indian status, after saying for a decade there aren't. Sen. Elizabeth Warren Apologizes For Calling Herself \"American Indian\" On Bar Registration …","name":"elizabeth liz warren","Sentiment":-0.0625},{"date":"2019-02-11T02:35:43+00:00","tweet":"Liz Warren lied about her story of her ' memaw ' being native American.She lied about it on legal documents and has used it to get ahead in life.Trump hasnt been asked by native American organisations to stop but Elizabeth Warren has been asked to stop claiming to be an 'injun'","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-02-10T08:14:22+00:00","tweet":"Trumpian party 2020 is already a big win, lets see role call.... Pervi Booker, here Slutty harris, here I want a native american husband? Oh pardon me, Elizabeth Warren white girl with identity crisis..... Liz Warren oh right she realized she stuck in 1977.","name":"elizabeth liz warren","Sentiment":0.2171428571},{"date":"2019-02-10T02:08:09+00:00","tweet":"A few things that happened today: — AOC & Co. gaslighting over the Green New Deal FAQ document — Elizabeth Warren officially declared that she is running for President — Trump tweets on Liz Warren & GND — Women alleging assault by Justin Fairfax are willing to testify (40\/365)","name":"elizabeth liz warren","Sentiment":-0.0034090909},{"date":"2019-02-10T00:49:07+00:00","tweet":"Liz Warren? But Elizabeth smoked weed when she was in college. They called her TOKE-AHONTAS","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-09T20:32:32+00:00","tweet":"Uh, Elizabeth Warren should never have written down that she was an \"American Indian\" in 86 or whenever that was, and the DNA stunt was a friggin disaster. Where the hell was Liz Warren at Standing Rock, eh?! Trump is a racist, but Liz Warren has some issues, man.","name":"elizabeth liz warren","Sentiment":-0.0777777778},{"date":"2019-02-09T12:43:36+00:00","tweet":"Senator Elizabeth Warren just gave a Great Speech launching her run for President of the United States of America! Good Luck Fighter Liz Warren! @SenWarren @AOC @BernieSanders @SpeakerPelosi @SenSchumer @SenJeffMerkley @Rep","name":"elizabeth liz warren","Sentiment":0.9375},{"date":"2019-02-07T22:34:43+00:00","tweet":"Let it go. She has native ancestry period. Why do you care how she related to and chose to use her ancestry? Elizabeth Warren is an exceptional woman. Don't try to take her down. A question for Liz Warren: How could you? …","name":"elizabeth liz warren","Sentiment":0.1703703704},{"date":"2019-02-07T00:41:37+00:00","tweet":"RNC files grievance with TX State Bar on Sen Liz Warren. RNC Files Grievance Against Elizabeth Warren for Claim She Is Native American","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-03T08:47:17+00:00","tweet":"Elizabeth Warren is stepping down immediately. Pretending to be an dark skinned Indian is Racist. Honesty vs Liz Warren. Like trying to connect opposite ends of a 🧲 magnet.","name":"elizabeth liz warren","Sentiment":-0.1018518519},{"date":"2019-02-13T21:54:06+00:00","tweet":"Anyone Tell Liz Warren Yet About Marco Rubio’s Native American Heritage? - … -RedState Who could’ve seen this one coming? After all the years of Sen. Elizabeth Warren (D-MA) falsely claiming a Native American heritage, it turns out one of her colleag...","name":"elizabeth liz warren","Sentiment":-0.1333333333},{"date":"2019-02-13T12:43:23+00:00","tweet":"On FEBRUARY 12, 2019 The Ferguson File WATCH: Desperate Liz Warren Predicts Trump in Jail by 2020 SHE LIED AND NOW WANTS OUR PRESIDENT BEHIND BARS! Elizabeth Warren's 2020 presidential campaign is off to a rocky start. Just take a look at how... …","name":"elizabeth liz warren","Sentiment":-0.25},{"date":"2019-02-10T03:01:34+00:00","tweet":"#RT @JerryDunleavy: A few things that happened today: — AOC & Co. gaslighting over the Green New Deal FAQ document — Elizabeth Warren officially declared that she is running for President — Trump tweets on Liz Warren & GND — Women alleging assault by Justin Fairfax are willi…","name":"elizabeth liz warren","Sentiment":-0.0878787879},{"date":"2019-02-09T21:35:04+00:00","tweet":"God forbid if we hurt Liz Warren's feelings...\"Trump faces backlash for Trail of Tears reference in comment about Elizabeth Warren\" …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-08T17:45:40+00:00","tweet":"I think @AOC might help Bernie over come some of his criticism. Hypothetically, if Kamala Harris and Bernie Sanders are the last two remaining, who do you think has a better shot? I think Kamala Harris, even though I’d prefer Bernie. I wanted Liz Warren, but seems unlikely now.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-06T07:53:01+00:00","tweet":"Love Liz Warren but labeling herself a Native American on a State Bar of Tex registration card back in 1986 confirms that she is an extremely poor presidential candidate. #Hillary2.0 Elizabeth Warren apologizes for calling herself Native American …","name":"elizabeth liz warren","Sentiment":0.02},{"date":"2019-02-05T17:13:29+00:00","tweet":"I just now realized that Liz Warren should, and would win, the presidency in 2020. Guts, passion, determination, intelligence, wisdom and, experience make her the front runner for me. This woman has all her ducks lined up... _____President Elizabeth Warren____ M,dem","name":"elizabeth liz warren","Sentiment":0.8},{"date":"2019-02-03T21:47:30+00:00","tweet":"Reid is not being subtle about Liz Warren: “She’s a good person. I think the world of her. My Nevada politics keep me from publicly endorsing her, which I will not do. But anything I can do to help Elizabeth Warren short of the endorsement, I will do.\" …","name":"elizabeth liz warren","Sentiment":0.0916666667},{"date":"2019-02-01T15:01:40+00:00","tweet":"Liz Warren Quietly Apologizes To Cherokee Nation … A Liar, fraud, theft, even when facts didn't support it, Elizabeth Warren dug in her heals to again CLAIM DNA test VERIFIED she was Native Indian. Now embarrassed, she recants? Democrat Politics #WalkAway","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-03-31T22:53:00+00:00","tweet":"Liz Warren needs our support because she has some of the best policies. Please use the money you were going to spend on a joint and a pizza anyways to give to her. Join me in supporting Elizabeth Warren via @actblue …","name":"elizabeth liz warren","Sentiment":0.625},{"date":"2019-03-23T18:11:36+00:00","tweet":"BREAKING NEWS! On this BUSY news day, Elizabeth “Honest Liz” Warren picks a running mate!","name":"elizabeth liz warren","Sentiment":0.425},{"date":"2019-03-23T14:23:13+00:00","tweet":"hi friends, our latest is now live We discuss the finer points of Theranos, Elizabeth Holmes’ fear of and love for war criminals, Kirsten Gillibrand’s very bad opioid proposal, Liz Warren backpedaling on the m4a bill she co-sponsored, and more …","name":"elizabeth liz warren","Sentiment":0.1452727273},{"date":"2019-03-23T00:13:45+00:00","tweet":"Wait is this bad? I've always called her Liz Warren. I think that's how I first heard of her however many years ago that was. Obviously, I know she formally goes by Elizabeth, but I thought Liz was common and innocent and basically normal. …","name":"elizabeth liz warren","Sentiment":0.0571428571},{"date":"2019-03-20T11:43:32+00:00","tweet":"It's insane. Have anybody seen Elizabeth Warren, Kamala, or Biden's answer? Kamala has a plan to help poor people, which will disproportionately help blacks cuz so many blacks are poor. Liz Warren wants to \"start the convo to find a plan\" and Biden hasn't spoken on it at all Lol","name":"elizabeth liz warren","Sentiment":-0.05},{"date":"2019-03-19T19:15:11+00:00","tweet":"Elizabeth Warren claimed to be Native American,to get ahead,she comment a crime,and was given a Free pass ,those who did claimed what they were not ,to get ahead must get a Free pass like Liz Warren,or does the FBI and Justice Department still work for Crooked Hillary Clinton …","name":"elizabeth liz warren","Sentiment":0.2666666667},{"date":"2019-03-18T23:15:56+00:00","tweet":"Elizabeth Warren calls for an end to the Electoral College! BOOM!!! DEMOCRACY NOW! That's what I'm talking' 'bout. This is why Liz Warren needs to be next POTUS! She's even better than Bernie! I missed the #WarrenTownHall due to working but am headed to her website now to donate!","name":"elizabeth liz warren","Sentiment":0.15625},{"date":"2019-03-17T12:42:35+00:00","tweet":"Elizabeth Warren Would Have Been Wise to Ignore College Scandal – Fix This Nation .com \/\/ Liz Warren's way was much cheaper.","name":"elizabeth liz warren","Sentiment":0.45},{"date":"2019-03-16T20:00:59+00:00","tweet":"I know the Indians in Massachusetts were so angry about Elizabeth Warren but some seemed to have forgiven her after apologized. Liz Warren complains how terrible & unfair those parents were to buy their kids way into college. Um.... she did worse.","name":"elizabeth liz warren","Sentiment":-0.6},{"date":"2019-03-15T11:38:29+00:00","tweet":"Let this Native American thank you,Elizabeth Warren did claim to be Native American,to sell a book to make money to get things ment for Native Americans,so she would get ahead,just like those in the News ,if Justice is equal,They must go FREE just like Liz Warren …","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-03-12T23:55:06+00:00","tweet":"Nah the most controversial is what you *don’t* say everytime Sam er Michael warble about how they’d be cool with a Liz Warren presidency","name":"elizabeth liz warren","Sentiment":0.4666666667},{"date":"2019-03-12T04:47:59+00:00","tweet":"Dolly Parton Smacks Liz Warren, Refuses To Let Her Use Hit Song On Campaign Trail … When Sen. Elizabeth Warren, D-Mass., announced her presidential run, she did so underscore by Dolly Parton’s working-class anthem “9 to 5.”","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-03-11T20:55:36+00:00","tweet":"Liz Warren for the win. \"Elizabeth Warren on Mueller: \"You should remember he has produced 34 indictments and guilty pleas already. I don't know about you, but I never had a boyfriend that good.\" …","name":"elizabeth liz warren","Sentiment":0.3333333333},{"date":"2019-03-11T19:24:00+00:00","tweet":"I guess Liz Warren doesn’t know who elects democrats? She’s blowing smoke up her own butt, by taking on the real power elite; aka Billionaire-Oligarchy, in this country. “Facebook takes down Elizabeth Warren ads calling for breakup of Facebook …","name":"elizabeth liz warren","Sentiment":0.2148148148},{"date":"2019-03-11T12:30:10+00:00","tweet":"Liz warren has no clue what she is talking about. Kinda sad watching someone believe lies and then spread them to uninformed people. Shame on you Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":-0.5},{"date":"2019-03-11T01:03:04+00:00","tweet":"A few people in my feed are calling Elizabeth Warren “Liz Warren.” Did she rebrand? Is she a Liz in personal settings? Or is her first name too long for them?","name":"elizabeth liz warren","Sentiment":-3.469446952e-18},{"date":"2019-03-10T13:43:15+00:00","tweet":"Liz Warren is excellent in this interview. Full interview of Sen. Elizabeth Warren on \"Face the Nation\" via @YouTube","name":"elizabeth liz warren","Sentiment":0.675},{"date":"2019-03-09T11:19:11+00:00","tweet":"#LNS: Presidential Races: I find myself agreeing with everything Elizabeth Warren says. I don't know why she's not doing better in the polls. She's the real change candidate with the chops to make it happen, who has walked the walk for a long time now. Liz Warren! Yay!","name":"elizabeth liz warren","Sentiment":0.2072916667},{"date":"2019-02-23T20:55:48+00:00","tweet":"Same Old Liz Warren in the comfort of Liberal New England calling us all out for being Past Slave owners! If you are going down this path, start with Ralph Northam! Elizabeth Warren says country must address ‘ugly history of racism’ …","name":"elizabeth liz warren","Sentiment":-0.161763468},{"date":"2019-02-21T17:44:43+00:00","tweet":"Liz Warren you r a nut job! Tired of having government taking our $. Child care not a right! Elizabeth Warren Calls Child Care A 'Fundamental Human Right' - Chicks On The Right …","name":"elizabeth liz warren","Sentiment":-0.0014285714},{"date":"2019-02-21T16:58:25+00:00","tweet":"2. Elizabeth Warren: \"I never sabotaged Hillary Clinton's campaign by falsely claiming she changed her vote to appease the banking lobby or come up with half-measures that leave the Oligarchy firmly in charge! That was ANOTHER Liz Warren! Me? I'm almost like Bernie Sanders!\"","name":"elizabeth liz warren","Sentiment":-0.3953125},{"date":"2019-02-21T12:30:31+00:00","tweet":"I'm in too. I love Bernie Sanders. Hope he's our next president. Bernie Sanders can beat Trump-even Trump said so. What would be nice would be Elizabeth Warren admitting that the strongest Dem. ticket would be Bernie as president & Liz Warren as vice president. Unbeatable!!!","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-02-21T12:04:30+00:00","tweet":"I assume this means Nina Sanders or Elizabeth Warren would be top choices. If he's fortunate enough to be the nominee, I'd nominate Nina, she's amazing and dynamic. Liz Warren in a cabinet position and Tulsi Gabbard as Secretary of State.","name":"elizabeth liz warren","Sentiment":0.3},{"date":"2019-02-19T18:21:05+00:00","tweet":"Just what we need, another massive, inefficiently administered gov't entitlement program. A Liz Warren specialty. \/\/ Elizabeth Warren’s Misguided Child-Care Plan …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-19T14:26:52+00:00","tweet":"Fine. Elizabeth Warren is a better candidate than Bernie in every way. Liz Warren 2020","name":"elizabeth liz warren","Sentiment":0.4583333333},{"date":"2019-02-18T19:29:25+00:00","tweet":"Say what you will about Trump calling Liz Warren “Pocahontas”, @KamalaHarris, but at least 1.) He was correct about her lying 2.) Elizabeth Warren actually exists. #JussieLied","name":"elizabeth liz warren","Sentiment":-0.15},{"date":"2019-02-18T13:38:22+00:00","tweet":"Have Bernie's supporters been claiming that Liz Warren stole Bernie's platform?? Because, as I recall, Elizabeth Warren made quite a splash with her policy ideas long before Bernie ran for the Dem nomination and he waited to see if she was running. He took HER place in 2016.","name":"elizabeth liz warren","Sentiment":-0.05},{"date":"2019-02-11T21:37:22+00:00","tweet":"Elizabeth Warren is among the smartest, most serious peo in the US Senate. Bankruptcy is a challenging course in law school. Liz Warren taught bankruptcy at Harvard and wrote books and articles analyzing it. She's part of the team to overhaul the economy, but not the ticket.","name":"elizabeth liz warren","Sentiment":0.2222222222},{"date":"2019-02-11T06:51:12+00:00","tweet":"In which Liz Warren admits there are other forms out there with her claiming Indian status, after saying for a decade there aren't. Sen. Elizabeth Warren Apologizes For Calling Herself \"American Indian\" On Bar Registration …","name":"elizabeth liz warren","Sentiment":-0.0625},{"date":"2019-02-11T02:35:43+00:00","tweet":"Liz Warren lied about her story of her ' memaw ' being native American.She lied about it on legal documents and has used it to get ahead in life.Trump hasnt been asked by native American organisations to stop but Elizabeth Warren has been asked to stop claiming to be an 'injun'","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-02-10T08:14:22+00:00","tweet":"Trumpian party 2020 is already a big win, lets see role call.... Pervi Booker, here Slutty harris, here I want a native american husband? Oh pardon me, Elizabeth Warren white girl with identity crisis..... Liz Warren oh right she realized she stuck in 1977.","name":"elizabeth liz warren","Sentiment":0.2171428571},{"date":"2019-02-10T02:08:09+00:00","tweet":"A few things that happened today: — AOC & Co. gaslighting over the Green New Deal FAQ document — Elizabeth Warren officially declared that she is running for President — Trump tweets on Liz Warren & GND — Women alleging assault by Justin Fairfax are willing to testify (40\/365)","name":"elizabeth liz warren","Sentiment":-0.0034090909},{"date":"2019-02-10T00:49:07+00:00","tweet":"Liz Warren? But Elizabeth smoked weed when she was in college. They called her TOKE-AHONTAS","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-09T20:32:32+00:00","tweet":"Uh, Elizabeth Warren should never have written down that she was an \"American Indian\" in 86 or whenever that was, and the DNA stunt was a friggin disaster. Where the hell was Liz Warren at Standing Rock, eh?! Trump is a racist, but Liz Warren has some issues, man.","name":"elizabeth liz warren","Sentiment":-0.0777777778},{"date":"2019-02-09T12:43:36+00:00","tweet":"Senator Elizabeth Warren just gave a Great Speech launching her run for President of the United States of America! Good Luck Fighter Liz Warren! @SenWarren @AOC @BernieSanders @SpeakerPelosi @SenSchumer @SenJeffMerkley @Rep","name":"elizabeth liz warren","Sentiment":0.9375},{"date":"2019-02-07T22:34:43+00:00","tweet":"Let it go. She has native ancestry period. Why do you care how she related to and chose to use her ancestry? Elizabeth Warren is an exceptional woman. Don't try to take her down. A question for Liz Warren: How could you? …","name":"elizabeth liz warren","Sentiment":0.1703703704},{"date":"2019-02-07T00:41:37+00:00","tweet":"RNC files grievance with TX State Bar on Sen Liz Warren. RNC Files Grievance Against Elizabeth Warren for Claim She Is Native American","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-02-03T08:47:17+00:00","tweet":"Elizabeth Warren is stepping down immediately. Pretending to be an dark skinned Indian is Racist. Honesty vs Liz Warren. Like trying to connect opposite ends of a 🧲 magnet.","name":"elizabeth liz warren","Sentiment":-0.1018518519},{"date":"2019-05-04T00:43:58+00:00","tweet":"Yes I also found his take on Elizabeth Warren interesting. I like Liz Warren. I think she's a reliable liberal, and incredibly smart. Probably the sharpest of all the really smart Dems running","name":"elizabeth liz warren","Sentiment":0.3095238095},{"date":"2019-04-30T15:09:50+00:00","tweet":"Gotta say, Liz Warren is overwhelming the field with substance and style. Elizabeth Warren Has the Plans via @thenation …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-04-29T08:23:21+00:00","tweet":"We have been told that about every single female Democrat, Nancy Pelosi.. Ilhan Omar... Maxine Waters... Elizabeth Warren. A- Whatever her name is, also says that Liz Warren will be done if she runs for POTUS.","name":"elizabeth liz warren","Sentiment":-0.0357142857},{"date":"2019-04-25T12:20:04+00:00","tweet":"I think Elizabeth Warren would Make a great president but Liz Warren would be terrible. We aren’t ready for a Liz in the White House. Elizabeth is polite, intelligent, and has a policy for everything. Liz is hungover and cracking her gum at a wedding in Poughkeepsie.","name":"elizabeth liz warren","Sentiment":0.16},{"date":"2019-04-24T12:55:42+00:00","tweet":"Liz Warren is a close second choice for many Bernie supporters. However, Bernie has been fighting for these policies his whole life while Elizabeth Warren used to be a Republican and still identifies as a capitalist","name":"elizabeth liz warren","Sentiment":0.2333333333},{"date":"2019-04-22T13:57:10+00:00","tweet":"Elizabeth Warren Proposes Wiping Out Almost Everyone’s Student Debt. Please support Liz Warren! She is the smartest & most qualified for the White House! Donate to her! …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-04-22T13:56:39+00:00","tweet":"I'm confused. Don't we call Elizabeth Warren Elizabeth Warren?? Is she running as Liz Warren?? Did she say these ppl could abbreviate her name? Cuz I know if I'm doing anything and you not my mama and you call me \"Jess\" in the media, there will be litigation","name":"elizabeth liz warren","Sentiment":-0.4},{"date":"2019-04-22T13:45:28+00:00","tweet":"Elizabeth and Liz warren is trending and the Elizabeth tweets are the formal take on her policies and Liz is basically a bunch millennials basically saying “yeah this our girl, this is sis”","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-04-22T13:34:06+00:00","tweet":"Trump only has scams. Elizabeth Warren has plans. “Liz Warren\" would be an outstanding president. She may not be the strongest candidate, but she has solid well thought out policies showing a vision of concrete ways 2 improve lives. I’d be happy if she’s the next Prez or VP.","name":"elizabeth liz warren","Sentiment":0.2416666667},{"date":"2019-04-22T13:06:14+00:00","tweet":"Liz Warren is Making Moves: \"Elizabeth Warren Proposes Wiping Out Almost Everyone's Student Debt\" - Democratic Underground","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-04-22T12:52:52+00:00","tweet":"Why are we calling Elizabeth Warren \"Liz Warren\" now? Was there a meeting? Did I miss it? Is she cool with it? Honorific or no?","name":"elizabeth liz warren","Sentiment":0.35},{"date":"2019-04-22T12:22:22+00:00","tweet":"⬇️ @ewarren is crushing her opponents in the \"policy proposal\" lane. \"Elizabeth Warren\" \"warren impeachment\" @ewarren #warren2020 \"Liz Warren\" @SenWarren","name":"elizabeth liz warren","Sentiment":0.4},{"date":"2019-04-22T11:53:53+00:00","tweet":"Elizabeth Warren has been polling in the back, regardless of regularly putting out seriously comprehensive policies. But today-- Liz Warren: Oh! And I have a plan to completely wipe out student loan debt. 42 million Americans:","name":"elizabeth liz warren","Sentiment":-0.0791666667},{"date":"2019-04-22T11:23:22+00:00","tweet":"Liz Warren\/Elizabeth Warren sounds more awesome every day, ya'll. (I know, she wasn't \"the first\" to call for Trump's impeachment, Castro used a less-viewed medium so he didn't get that notch, but the proximity was close, and I'd rather have two right people than one)","name":"elizabeth liz warren","Sentiment":0.5089285714},{"date":"2019-04-22T08:42:58+00:00","tweet":"Another day, another aggressively progressive policy proposal from Liz Warren... \"Elizabeth Warren’s Higher Education Plan: Eliminate Tuition and Cancel Student Debt\"","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-04-21T00:02:03+00:00","tweet":"People on the TL: \"WHY DON'T PEOPLE TAKE ELIZABETH WARREN SERIOUSLY?\" Liz Warren: …","name":"elizabeth liz warren","Sentiment":-0.3333333333},{"date":"2019-04-17T23:54:16+00:00","tweet":"In fact, I wouldn’t mind a Beto O’Rourke \/ Elizabeth Warren ticket at all. Sure, I may have some key policy difference with Liz Warren, but this ticket could defeat Donald Trump. Especially by steering clear of the Joe Biden and Bernie Sanders old white men unappealing shit.","name":"elizabeth liz warren","Sentiment":0.0125},{"date":"2019-04-16T19:56:07+00:00","tweet":"12. And we DESPERATELY need Elizabeth Warren in the Senate where the laws are made. I'm tired of lobbyists writing laws. I want Liz Warren to write my laws. And Amy Klobuchar to co-sponsor them, and to help Liz make real, usable legislation. She's *good* at that. Record.","name":"elizabeth liz warren","Sentiment":-0.025},{"date":"2019-04-07T08:47:54+00:00","tweet":"Liz Warren is on fire. Elizabeth Warren's Powerful Speech On Childcare At The National Action N... via @YouTube","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-05-03T11:42:00+00:00","tweet":"When Third Way Dems we’re siding with Republicans to cut Socisl Security benefits, Liz Warren fought for us. Elizabeth Warren Nails It On Social Security via @YouTube","name":"elizabeth liz warren","Sentiment":0.0166666667},{"date":"2019-04-24T11:29:24+00:00","tweet":"real question, when did we decide that it's 'liz warren' and not 'elizabeth warren'?","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-04-24T03:36:44+00:00","tweet":".@LiberallyG & I have concluded Elizabeth Warren’s campaign is the most efficient\/timely at delivering merchandise orders, representative of her campaign being so intensely organized & detailed w\/everything. In the most Liz Warren fashion, she probably hand delivers the packages.","name":"elizabeth liz warren","Sentiment":0.4},{"date":"2019-04-23T17:03:49+00:00","tweet":"That's very disingenuous and manipulative there. That's like saying: Liz Warren: I'm a Native American but not. All the candidates are more than just their publicity, race, gender, stories... though I do believe that Elizabeth Warren would be a great General election candidate.","name":"elizabeth liz warren","Sentiment":0.31},{"date":"2019-04-23T14:04:40+00:00","tweet":"I saw an Asian woman the other day with the same haircut as Liz Warren. Similar style of dress too. Of course I did not think \"Chinese Elizabeth Warren\" - nor did I think about that for 30 minutes thereafter.","name":"elizabeth liz warren","Sentiment":-0.025},{"date":"2019-04-23T00:42:38+00:00","tweet":"Anybody think Cheeto could get down on one knee & get back up like Liz Warren did when describing talking 2 little girls? \"Hello, my name is Elizabeth & I'm running 4 Senate because that's what girls do.\" I can dig it! ️","name":"elizabeth liz warren","Sentiment":-0.1299768519},{"date":"2019-04-22T21:44:31+00:00","tweet":"This would help SO many Americans break into the middle class. RT @JoshuaHol: Another day, another aggressively progressive policy proposal from Liz Warren... \"Elizabeth Warren’s Higher Education Plan: Eliminate Tuition and Cancel Student Debt\"","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-04-22T18:56:33+00:00","tweet":"🤔interesting LIz Warren tell me more 🤔🤔 Elizabeth Warren presents a policy to wipe clean student-loan debt …","name":"elizabeth liz warren","Sentiment":0.4333333333},{"date":"2019-04-22T11:50:49+00:00","tweet":"As an Elizabeth who hates nicknames and is constantly called “Liz” by strangers, I NEED to know how she feels about all of you calling her “Liz Warren”","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-04-22T09:14:23+00:00","tweet":"I can certainly get down with this! Kamala Harris repping for the teachers and Liz Warren repping for students!!! Harris\/Warren 2020!!! Elizabeth Warren’s Higher Education Plan: Eliminate Tuition and Cancel Student Debt","name":"elizabeth liz warren","Sentiment":-0.0924869921},{"date":"2019-04-22T06:14:32+00:00","tweet":"Elizabeth Warren thinks there should be fewer Cersei Lannisters in the world. Liz Warren should answer one question or shut up. The question is: Why did you LIE about your Native American heritage. CONFIRMED LIAR!!!","name":"elizabeth liz warren","Sentiment":0.390625},{"date":"2019-04-21T18:07:42+00:00","tweet":"Beto vs. Liz Warren 2020 Democratic Debate: at odds on breaking up tech giants like Amazon - … Senator Elizabeth...","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-04-21T16:00:06+00:00","tweet":"Will Liz Warren’s Green Energy Build-Up Harm Wildlife? Experts Have Concerns … via @dailycaller On one hand Elizabeth Warren wants to protect land on the other hand she want to destroy land.","name":"elizabeth liz warren","Sentiment":-0.08125},{"date":"2019-04-20T16:38:17+00:00","tweet":"Just gave to Liz Warren again. Glad she is in the race, and happy she's calling for impeachment! Join me in supporting Elizabeth Warren via @actblue …","name":"elizabeth liz warren","Sentiment":0.5833333333},{"date":"2019-04-19T21:36:31+00:00","tweet":"I agree with Liz Warren. The report says he's guilty. Impeachment must be pursued. Only Elizabeth Warren has the guts to take this lead @maddow","name":"elizabeth liz warren","Sentiment":-0.25},{"date":"2019-04-19T18:02:35+00:00","tweet":"Your take on Liz Warren is that she doesn't read? Doesn't do her homework? Isn't committed to her job? Of all the things you could choose to oppose Elizabeth Warren on, these seem like poor choices.","name":"elizabeth liz warren","Sentiment":-0.4},{"date":"2019-04-12T00:57:07+00:00","tweet":"Liz Warren helps Trump more than any Republican. Liz has zero accomplishments in the senate. Folks who will never be president — Bernie Sanders (Ass) Elizabeth Warren (D) Kirsten Gillibrand (D) . @SenSanders @SenWarren @SenGillibrand . #NeverBernie #NeverSanders #NeverTrump","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-04-10T16:22:02+00:00","tweet":"Lol says the 20 follower Elizabeth Warren fan account?","name":"elizabeth liz warren","Sentiment":0.8},{"date":"2019-04-08T01:36:00+00:00","tweet":"ELIZABETH WARREN FALLS TO 3RD PLACE IN HER OWN STATE. Another embarrassing poll for Big Chief Liz Warren! …","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-03-31T22:53:00+00:00","tweet":"Liz Warren needs our support because she has some of the best policies. Please use the money you were going to spend on a joint and a pizza anyways to give to her. Join me in supporting Elizabeth Warren via @actblue …","name":"elizabeth liz warren","Sentiment":0.625},{"date":"2019-03-23T18:11:36+00:00","tweet":"BREAKING NEWS! On this BUSY news day, Elizabeth “Honest Liz” Warren picks a running mate!","name":"elizabeth liz warren","Sentiment":0.425},{"date":"2019-03-23T14:23:13+00:00","tweet":"hi friends, our latest is now live We discuss the finer points of Theranos, Elizabeth Holmes’ fear of and love for war criminals, Kirsten Gillibrand’s very bad opioid proposal, Liz Warren backpedaling on the m4a bill she co-sponsored, and more …","name":"elizabeth liz warren","Sentiment":0.1452727273},{"date":"2019-03-23T00:13:45+00:00","tweet":"Wait is this bad? I've always called her Liz Warren. I think that's how I first heard of her however many years ago that was. Obviously, I know she formally goes by Elizabeth, but I thought Liz was common and innocent and basically normal. …","name":"elizabeth liz warren","Sentiment":0.0571428571},{"date":"2019-03-20T11:43:32+00:00","tweet":"It's insane. Have anybody seen Elizabeth Warren, Kamala, or Biden's answer? Kamala has a plan to help poor people, which will disproportionately help blacks cuz so many blacks are poor. Liz Warren wants to \"start the convo to find a plan\" and Biden hasn't spoken on it at all Lol","name":"elizabeth liz warren","Sentiment":-0.05},{"date":"2019-03-19T19:15:11+00:00","tweet":"Elizabeth Warren claimed to be Native American,to get ahead,she comment a crime,and was given a Free pass ,those who did claimed what they were not ,to get ahead must get a Free pass like Liz Warren,or does the FBI and Justice Department still work for Crooked Hillary Clinton …","name":"elizabeth liz warren","Sentiment":0.2666666667},{"date":"2019-03-18T23:15:56+00:00","tweet":"Elizabeth Warren calls for an end to the Electoral College! BOOM!!! DEMOCRACY NOW! That's what I'm talking' 'bout. This is why Liz Warren needs to be next POTUS! She's even better than Bernie! I missed the #WarrenTownHall due to working but am headed to her website now to donate!","name":"elizabeth liz warren","Sentiment":0.15625},{"date":"2019-03-17T12:42:35+00:00","tweet":"Elizabeth Warren Would Have Been Wise to Ignore College Scandal – Fix This Nation .com \/\/ Liz Warren's way was much cheaper.","name":"elizabeth liz warren","Sentiment":0.45},{"date":"2019-03-16T20:00:59+00:00","tweet":"I know the Indians in Massachusetts were so angry about Elizabeth Warren but some seemed to have forgiven her after apologized. Liz Warren complains how terrible & unfair those parents were to buy their kids way into college. Um.... she did worse.","name":"elizabeth liz warren","Sentiment":-0.6},{"date":"2019-03-15T11:38:29+00:00","tweet":"Let this Native American thank you,Elizabeth Warren did claim to be Native American,to sell a book to make money to get things ment for Native Americans,so she would get ahead,just like those in the News ,if Justice is equal,They must go FREE just like Liz Warren …","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-03-12T23:55:06+00:00","tweet":"Nah the most controversial is what you *don’t* say everytime Sam er Michael warble about how they’d be cool with a Liz Warren presidency","name":"elizabeth liz warren","Sentiment":0.4666666667},{"date":"2019-03-12T04:47:59+00:00","tweet":"Dolly Parton Smacks Liz Warren, Refuses To Let Her Use Hit Song On Campaign Trail … When Sen. Elizabeth Warren, D-Mass., announced her presidential run, she did so underscore by Dolly Parton’s working-class anthem “9 to 5.”","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-03-11T20:55:36+00:00","tweet":"Liz Warren for the win. \"Elizabeth Warren on Mueller: \"You should remember he has produced 34 indictments and guilty pleas already. I don't know about you, but I never had a boyfriend that good.\" …","name":"elizabeth liz warren","Sentiment":0.3333333333},{"date":"2019-03-11T19:24:00+00:00","tweet":"I guess Liz Warren doesn’t know who elects democrats? She’s blowing smoke up her own butt, by taking on the real power elite; aka Billionaire-Oligarchy, in this country. “Facebook takes down Elizabeth Warren ads calling for breakup of Facebook …","name":"elizabeth liz warren","Sentiment":0.2148148148},{"date":"2019-03-11T12:30:10+00:00","tweet":"Liz warren has no clue what she is talking about. Kinda sad watching someone believe lies and then spread them to uninformed people. Shame on you Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":-0.5},{"date":"2019-03-11T01:03:04+00:00","tweet":"A few people in my feed are calling Elizabeth Warren “Liz Warren.” Did she rebrand? Is she a Liz in personal settings? Or is her first name too long for them?","name":"elizabeth liz warren","Sentiment":-3.469446952e-18},{"date":"2019-03-10T13:43:15+00:00","tweet":"Liz Warren is excellent in this interview. Full interview of Sen. Elizabeth Warren on \"Face the Nation\" via @YouTube","name":"elizabeth liz warren","Sentiment":0.675},{"date":"2019-03-09T11:19:11+00:00","tweet":"#LNS: Presidential Races: I find myself agreeing with everything Elizabeth Warren says. I don't know why she's not doing better in the polls. She's the real change candidate with the chops to make it happen, who has walked the walk for a long time now. Liz Warren! Yay!","name":"elizabeth liz warren","Sentiment":0.2072916667},{"date":"2019-06-05T19:24:02+00:00","tweet":"Oligarch Protection Unit at work: Beto = fail; Kamala = fail; Buttigieg = fail; Joe Biden = fail. So now comes former GOPwinger and Clinton-Democrat party loyalist, Liz Warren. If elected, she shall perform like Obama, oligarch-friendly. \"Elizabeth Warren\"","name":"elizabeth liz warren","Sentiment":-0.4},{"date":"2019-06-04T17:25:42+00:00","tweet":"Elizabeth “Likeable Liz” Warren stands out once again for having mentioned this ~stark reality~ for many parents. Really blows my mind that more candidates didn’t own up to this","name":"elizabeth liz warren","Sentiment":0.32},{"date":"2019-06-04T17:15:02+00:00","tweet":"Aspiring Czar Elizabeth Warren has a new Plan for Your Money: Liz Warren Unveils \"Economic Patriotism\" Plan: Calls For Aggressive Market Interventions, Active Dollar Management | Zero Hedge …","name":"elizabeth liz warren","Sentiment":0.0676767677},{"date":"2019-06-03T12:24:15+00:00","tweet":"Elizabeth Warren: I think sex workers shouldn’t have bank accounts You: 🦗 Warren: I don’t support M4A You: WOW WHO WOULD HAVE KNOWN LIZ WARREN ISN’T PERFECT WOW I’M GENUINELY SHOCKED","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2019-06-02T02:59:30+00:00","tweet":"There just aren’t enough WORDS to relay how much I LOVE Elizabeth Warren. There have been many things in my lifetime that I’ve wanted to ‘do to’ or ‘say to’ the avg politician. Liz Warren is the first (& only) one I’ve wanted to HUG and say “I adore you” to ️","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-05-31T09:08:30+00:00","tweet":"*Elizabeth Warren drops a new policy proposal re the indictment of a sitting president.* Liz Warren Stan Twitter:","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-05-30T19:41:05+00:00","tweet":"\"Liz Warren is to the left of Bernie\" is an ignorant statement. Elizabeth Warren voted for a defense budget that is higher than the one that Donald Trump requested. What kind of \"left of Bernie\" is that? …","name":"elizabeth liz warren","Sentiment":0.2125},{"date":"2019-05-28T21:34:30+00:00","tweet":"Pre-2019 me: Elizabeth Warren meh 2019 me: Liz Warren hell yeah","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-28T13:28:03+00:00","tweet":"one of the cooler things about me is i say \"Liz Warren\" instead of \"Elizabeth Warren\" as if i funkin know her","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-25T14:05:59+00:00","tweet":"Elizabeth Warren has 1 in 1024 chance to win the 2020 Presidential election*. (* not my joke!) PS: Pretty Good \"Liz Warren\" from @miserablelib! …","name":"elizabeth liz warren","Sentiment":0.7083333333},{"date":"2019-05-23T11:08:58+00:00","tweet":"“While teaching, Elizabeth Warren worked on more than 50 legal matters, charging as much as $675 an hour” I don’t give a shit. The political media is going to be so trash in 2020. (But it’s ironic to see someone pocket watching Liz Warren the way she was pocket watching PBO)","name":"elizabeth liz warren","Sentiment":0.15},{"date":"2019-05-23T00:45:47+00:00","tweet":"“Elizabeth Warren, who has a plan for housing, as she has a plan for everything” Ok seriously dude just Half Baked Liz Warren and she earned it.","name":"elizabeth liz warren","Sentiment":9.251858539e-18},{"date":"2019-05-22T08:56:21+00:00","tweet":"\"I'm for Medicare for All... Or AM I?\" –Liz Warren @KyleKulinski – Elizabeth Warren's Wishy-Washy Answer On Medicare For All","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-18T13:35:18+00:00","tweet":"my opinion on the primaries is that I call Elizabeth Warren \"Big Liz Warren\" and everybody else \"everybody else\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-16T16:49:06+00:00","tweet":"#Top MSNBC star goes BERSERK on Liz Warren (jaw dropping) Elizabeth Warren's act has become so rotten, even top MSNBC stars are completely FED UP! Learn why one popular liberal news anchor just told Warren, \"SHUT UP, you coward!\" Read More ›","name":"elizabeth liz warren","Sentiment":0.475},{"date":"2019-05-14T12:51:57+00:00","tweet":"Elizabeth Warren Turns Down Fox News Town Hall, Calling the Network a ‘Hate-for-Profit Racket’ … via @thedailybeast EXACTLY Liz! Warren is so far the best candidate. Biden is stale bread","name":"elizabeth liz warren","Sentiment":0.1513888889},{"date":"2019-05-14T06:17:39+00:00","tweet":"When people think about Elizabeth Warren, people think about dishonesty & hypocrisy. Liz Warren is such a joke.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-08T19:48:06+00:00","tweet":"I like Liz. That's my stab at slogan writing. I copied from \"I like Ike.\" 3 letters, not Elizabeth, Liz Warren! That's a President","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-07T22:20:19+00:00","tweet":"Dolly has had enough of Elizabeth Warren… Dolly Parton Reaches Limit, Tells Liz Warren To Go Pound Sand …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-04T21:04:23+00:00","tweet":"Liz Warren Unveils \"Economic Patriotism\" Plan: Calls For Aggressive Market Interventions, Active Dollar Management | Zero Hedge … - Elizabeth Warren is a fucking corrupt retard I wouldn't trust her with the till at a Dunkin Donuts. #QAnon #MAGA","name":"elizabeth liz warren","Sentiment":-0.3333333333},{"date":"2019-06-04T14:42:38+00:00","tweet":"Liz Warren Pitches Climate Change ‘Jobs’ Plan. It Costs $2 Million Per Job … via @dailycaller If Elizabeth Warren's green deal is anything like AOC plan she will create 1 million jobs but kill off 17.6 million jobs hardly a fair trade.","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-06-01T10:51:52+00:00","tweet":"Twitter Temporarily Suspends Conservative Pundit Erick Erickson Over Sen. Liz Warren Joke … via @dailycaller“Elizabeth Warren set to introduce the Wrecking American Prosperity Under Marxism, or WAMPUM Act, wherein she gives everything away for free.”","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-05-27T21:46:37+00:00","tweet":"Liz Warren can't be straight with the American People and tell us if She's the real Pocahontas.Trump demands more proof. Pence warns Trump that the belief in Reincarnation will land him in hell. Elizabeth Warren seeks to put 'Pocahontas' barbs behind her …","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-05-27T15:17:37+00:00","tweet":"It's Bernard Sanders and Liz Warren. Start calling them that, instead of \"Bernie\" and \"Elizabeth\".","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-26T01:51:35+00:00","tweet":"@miserablelib Great Liz Warren impression! - Eco-Friendly Killing Promoted By Elizabeth Warren Loved it! Look forward to hearing more!","name":"elizabeth liz warren","Sentiment":0.8333333333},{"date":"2019-05-20T16:29:45+00:00","tweet":"Looks like a job for Liz Warren...go get 'em, Elizabeth!","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-19T19:42:20+00:00","tweet":"Elizabeth Warren’s offer to help comedian ‘figure out’ love life sends Twitter into frenzy … EWWWWWH!! LIZ WARREN DISCUSSING LOVE LIFE??? HOW REPULSIVE IS THAT? JUST THE VISIONS IT CONGERS UP US SOOOO ICKY🤮!","name":"elizabeth liz warren","Sentiment":0.703125},{"date":"2019-05-17T15:59:35+00:00","tweet":"Elizabeth Warren won't do a town hall with Fox News because she is afraid to be confronted by tough questions, unlike the softball questions she gets from Dem sponsored news outlets like NBC, CNN, and others. If Liz Warren is afraid of Fox News, how could she face Russia, China,","name":"elizabeth liz warren","Sentiment":-0.5296296296},{"date":"2019-05-16T21:16:24+00:00","tweet":"Elizabeth Warren Just Laid a Devastating Burn on the Comptroller of the Currency - Slate … via @GoogleNews luv u liz 4 calling bad ppl out vote liz warren potus 2020","name":"elizabeth liz warren","Sentiment":-0.85},{"date":"2019-05-14T19:42:58+00:00","tweet":"#Liz Warren SPITS on Fox News viewers (she's crazy!) If you're a Fox News viewer, Elizabeth Warren has a message for you -- and it's NASTY! Learn how this statement could derail her whole 2020 campaign. Hint: It's WORSE than \"deplorables!\" Read More ›","name":"elizabeth liz warren","Sentiment":-0.31},{"date":"2019-05-14T15:23:39+00:00","tweet":"Julián Castro Throwing Down Education Policy Like A Common Liz Warren - Julián Castro continued the hot trend of 2020 campaigns with Big Ideas, releasing his \"People First Education\" plan Monday like some kind of common Elizabeth Warren. It has several elements in common with ...","name":"elizabeth liz warren","Sentiment":0.0049382716},{"date":"2019-05-14T13:04:01+00:00","tweet":"A lot Twitter users are won over by Elizabeth Warren having the steel ovaries to call out Fox News. But the primary voters of America only use Twitter to yell at airlines. That's why I propose: another season of The Big Bang Theory, with Liz Warren as Sheldon's aunt.","name":"elizabeth liz warren","Sentiment":0.1333333333},{"date":"2019-05-14T11:39:59+00:00","tweet":"Loving liz Warren and this thread and have I mentioned how great Elizabeth Warren is. Give her your attention and money bitte …","name":"elizabeth liz warren","Sentiment":0.7},{"date":"2019-05-14T06:01:40+00:00","tweet":"️ “Elizabeth Warren says she will choose an education secretary with 'real teaching experience'” … next potus 2020 Liz Warren yes calls out the worst ed sec we eva had karma will take care of betsy devos","name":"elizabeth liz warren","Sentiment":-0.225},{"date":"2019-05-13T14:09:18+00:00","tweet":"Elizabeth Warren Has a Plan for That - TIME. While I know this is only a headline, Liz Warren is truly one of smartest candidates in the race! For instance, She is the only candidate to address “red-lining!” Read the article! …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-08T08:39:22+00:00","tweet":"Dolly has had enough of Elizabeth Warren.....Dolly Parton reaches her limit. Tells Liz Warren to go pound sand.🥳️🤣","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-07T14:43:09+00:00","tweet":"You take 2 items to score his record? Here is Bernie, Liz Warren, Tulsi, and Joe Biden. He has a MUCH larger record over 30 years than 2 freaking votes. He is just as Liberal as Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-04T00:43:58+00:00","tweet":"Yes I also found his take on Elizabeth Warren interesting. I like Liz Warren. I think she's a reliable liberal, and incredibly smart. Probably the sharpest of all the really smart Dems running","name":"elizabeth liz warren","Sentiment":0.3095238095},{"date":"2019-04-30T15:09:50+00:00","tweet":"Gotta say, Liz Warren is overwhelming the field with substance and style. Elizabeth Warren Has the Plans via @thenation …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-04-29T08:23:21+00:00","tweet":"We have been told that about every single female Democrat, Nancy Pelosi.. Ilhan Omar... Maxine Waters... Elizabeth Warren. A- Whatever her name is, also says that Liz Warren will be done if she runs for POTUS.","name":"elizabeth liz warren","Sentiment":-0.0357142857},{"date":"2019-04-25T12:20:04+00:00","tweet":"I think Elizabeth Warren would Make a great president but Liz Warren would be terrible. We aren’t ready for a Liz in the White House. Elizabeth is polite, intelligent, and has a policy for everything. Liz is hungover and cracking her gum at a wedding in Poughkeepsie.","name":"elizabeth liz warren","Sentiment":0.16},{"date":"2019-04-24T12:55:42+00:00","tweet":"Liz Warren is a close second choice for many Bernie supporters. However, Bernie has been fighting for these policies his whole life while Elizabeth Warren used to be a Republican and still identifies as a capitalist","name":"elizabeth liz warren","Sentiment":0.2333333333},{"date":"2019-04-22T13:57:10+00:00","tweet":"Elizabeth Warren Proposes Wiping Out Almost Everyone’s Student Debt. Please support Liz Warren! She is the smartest & most qualified for the White House! Donate to her! …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-04-22T13:56:39+00:00","tweet":"I'm confused. Don't we call Elizabeth Warren Elizabeth Warren?? Is she running as Liz Warren?? Did she say these ppl could abbreviate her name? Cuz I know if I'm doing anything and you not my mama and you call me \"Jess\" in the media, there will be litigation","name":"elizabeth liz warren","Sentiment":-0.4},{"date":"2019-04-22T13:45:28+00:00","tweet":"Elizabeth and Liz warren is trending and the Elizabeth tweets are the formal take on her policies and Liz is basically a bunch millennials basically saying “yeah this our girl, this is sis”","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-04-22T13:34:06+00:00","tweet":"Trump only has scams. Elizabeth Warren has plans. “Liz Warren\" would be an outstanding president. She may not be the strongest candidate, but she has solid well thought out policies showing a vision of concrete ways 2 improve lives. I’d be happy if she’s the next Prez or VP.","name":"elizabeth liz warren","Sentiment":0.2416666667},{"date":"2019-04-22T13:06:14+00:00","tweet":"Liz Warren is Making Moves: \"Elizabeth Warren Proposes Wiping Out Almost Everyone's Student Debt\" - Democratic Underground","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-04-22T12:52:52+00:00","tweet":"Why are we calling Elizabeth Warren \"Liz Warren\" now? Was there a meeting? Did I miss it? Is she cool with it? Honorific or no?","name":"elizabeth liz warren","Sentiment":0.35},{"date":"2019-04-22T12:22:22+00:00","tweet":"⬇️ @ewarren is crushing her opponents in the \"policy proposal\" lane. \"Elizabeth Warren\" \"warren impeachment\" @ewarren #warren2020 \"Liz Warren\" @SenWarren","name":"elizabeth liz warren","Sentiment":0.4},{"date":"2019-04-22T11:53:53+00:00","tweet":"Elizabeth Warren has been polling in the back, regardless of regularly putting out seriously comprehensive policies. But today-- Liz Warren: Oh! And I have a plan to completely wipe out student loan debt. 42 million Americans:","name":"elizabeth liz warren","Sentiment":-0.0791666667},{"date":"2019-04-22T11:23:22+00:00","tweet":"Liz Warren\/Elizabeth Warren sounds more awesome every day, ya'll. (I know, she wasn't \"the first\" to call for Trump's impeachment, Castro used a less-viewed medium so he didn't get that notch, but the proximity was close, and I'd rather have two right people than one)","name":"elizabeth liz warren","Sentiment":0.5089285714},{"date":"2019-04-22T08:42:58+00:00","tweet":"Another day, another aggressively progressive policy proposal from Liz Warren... \"Elizabeth Warren’s Higher Education Plan: Eliminate Tuition and Cancel Student Debt\"","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-04-21T00:02:03+00:00","tweet":"People on the TL: \"WHY DON'T PEOPLE TAKE ELIZABETH WARREN SERIOUSLY?\" Liz Warren: …","name":"elizabeth liz warren","Sentiment":-0.3333333333},{"date":"2019-04-17T23:54:16+00:00","tweet":"In fact, I wouldn’t mind a Beto O’Rourke \/ Elizabeth Warren ticket at all. Sure, I may have some key policy difference with Liz Warren, but this ticket could defeat Donald Trump. Especially by steering clear of the Joe Biden and Bernie Sanders old white men unappealing shit.","name":"elizabeth liz warren","Sentiment":0.0125},{"date":"2019-04-16T19:56:07+00:00","tweet":"12. And we DESPERATELY need Elizabeth Warren in the Senate where the laws are made. I'm tired of lobbyists writing laws. I want Liz Warren to write my laws. And Amy Klobuchar to co-sponsor them, and to help Liz make real, usable legislation. She's *good* at that. Record.","name":"elizabeth liz warren","Sentiment":-0.025},{"date":"2019-04-07T08:47:54+00:00","tweet":"Liz Warren is on fire. Elizabeth Warren's Powerful Speech On Childcare At The National Action N... via @YouTube","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-07-04T11:30:58+00:00","tweet":"You really believe Elizabeth Warren has your daughter in the front of her mind? Liz Warren is an identity thief of the highest magnitude since 1986 when she filled out her first document stating she was descendant of the Cherokee Nation. Your daughter is not a priority for her. …","name":"elizabeth liz warren","Sentiment":0.2833333333},{"date":"2019-06-28T13:48:26+00:00","tweet":"My top ten Democratic primary candidates (not necessarily in order) 1. Elizabeth\/Liz Warren 2. Kamala Harris 3. Mayor Pete Buttigieg 4. Cory Booker 5. Julian Castro 6. Bernie Sanders 7. Joe Biden 8. Amy Klobuchar 9. Bill DeBlasio 10. Kirsten Gillibrand #DemocraticDebate2020","name":"elizabeth liz warren","Sentiment":0.225},{"date":"2019-06-27T20:30:37+00:00","tweet":"I would like to thank everyone for their Elizabeth Warren ... tweets where they don’t call her Liz Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-27T14:16:48+00:00","tweet":"This Elizabeth Warren always does the right thing meme is boring as hell, replace Chuck Norris with Liz Warren in Chuck Norris jokes and we're on.","name":"elizabeth liz warren","Sentiment":-0.3571428571},{"date":"2019-06-27T10:11:59+00:00","tweet":"Does no one else think it’s flattening a very smart\/accomplished person like Liz Warren’s credentials to compare every smart woman to the same female character in Harry Potter? Elizabeth Warren is an accomplished member of Congress\/law professor not a 15 year old from a kids book …","name":"elizabeth liz warren","Sentiment":0.119047619},{"date":"2019-06-26T21:59:28+00:00","tweet":"Have you noticed Lester Holt gave Elizabeth Liz Warren lots of air time in the beginning but once they got to the controversial questions they kept her safely out of the crossfire? #DebateNight","name":"elizabeth liz warren","Sentiment":0.525},{"date":"2019-06-26T21:30:40+00:00","tweet":"Follow Elizabeth Warren here: @ewarren | \"Liz Warren\" #DemDebate #DemocraticDebate #DemocraticDebates #DemDebates","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-26T21:25:51+00:00","tweet":"So Liz Warren has 4 times @TulsiGabbard needs to but in. Elizabeth Warren is the MSM’s chosen one. That’s very clear. And that’s why I will not buy a single thing she’s said.","name":"elizabeth liz warren","Sentiment":0.0292857143},{"date":"2019-06-23T23:06:45+00:00","tweet":"Liz Warren is preaching \"reparations\" for \"gay couples\" on tax returns. What??? Elizabeth Warren Demands Reparations For Gay And Lesbian Couples | Zero Hedge …","name":"elizabeth liz warren","Sentiment":0.4166666667},{"date":"2019-06-23T14:14:26+00:00","tweet":"Liz Warren plays identity politics. She tried portraying herself as a \"woman of color\". Now she plays to her gender. She needs to run on her record and her own damn plans, not Bernie's. Elizabeth Warren shows how unpopular identity politics is | TheHill …","name":"elizabeth liz warren","Sentiment":0.6},{"date":"2019-06-22T19:22:54+00:00","tweet":"They act like Elizabeth Warren isn't getting media coverage. It's to point that Liz Warren announces a plan similar to Kamala's plan like the next day.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-20T12:57:58+00:00","tweet":"Let's all REQUIRE that Pocahontas pay reparations to the Indian tribe that she falsely claimed she was a member. Say, 10 million dollars, from Liz Warren to the tribe ?. (Elizabeth, such a nice Indian family name..huh?) ....Warren is 100% FAKE.!! A DECEIVER..!! REMOVE HER.!! …","name":"elizabeth liz warren","Sentiment":-0.2},{"date":"2019-06-20T12:09:50+00:00","tweet":"Article: centrist Dems are supporting Elizabeth Warren because they hate Bernie. Bernie: well that’s shitty of centrist Dems. Centrist Dems: how fucking dare he insult Liz Warren??","name":"elizabeth liz warren","Sentiment":-0.3833333333},{"date":"2019-06-17T14:00:32+00:00","tweet":"Elizabeth “Liz” Warren has plans for making housing and child care affordable, forgiving college loans, tackling the opioid crisis, protecting public lands and more. Will she get your vote in 2020? …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-06-17T07:00:26+00:00","tweet":"Can Elizabeth Warren Win It All? No! So Liz Warren is Bernie 2.0. She plans to only offer mythical economic promises and ignore civil rights... I'll pass! …","name":"elizabeth liz warren","Sentiment":0.4166666667},{"date":"2019-06-14T13:06:22+00:00","tweet":"Any time Elizabeth “Likeable Liz” Warren says she has a plan for something, my day gets better …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-06-13T10:43:51+00:00","tweet":"Have Massachusetts Democrats lost faith in themselves or in Elizabeth Warren? … via @BostonGlobe Nope, I love Liz Warren, I just think she can't win (sexism) and want her as my Senator!","name":"elizabeth liz warren","Sentiment":0.75},{"date":"2019-06-10T13:41:52+00:00","tweet":"fun fact but most of the critiques about elizabeth warren also apply to bernie this is not a 'liz warren is being treated unfairly by bernie bros' post this is a 'they're both not very good and stans of either are deluding themselves if they think otherwise' post.","name":"elizabeth liz warren","Sentiment":0.0076923077},{"date":"2019-06-08T05:15:29+00:00","tweet":"In 2014, Elizabeth Warren implemented her still ongoing education plan: Liz Warren Has a Former TFAer with a bachelors degree in “journalism, advertising, new media, and theater,\" a former summer intern, Advising Her on All Matters Pertaining to Education","name":"elizabeth liz warren","Sentiment":0.0454545455},{"date":"2019-06-07T15:26:59+00:00","tweet":"Liz Warren! After the heartbreak of 2016, Elizabeth Warren is giving women new reasons to hope. … via @slate","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-07-06T16:07:10+00:00","tweet":"I get Elizabeth's emails so I had a feeling! I like that she adds \"or coffee or whatever\" because not even for Liz Warren will I drink beer l!","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-29T10:56:32+00:00","tweet":"After the 1st Democratic debates 1 thing is for sure. The Democrats have a long way 2 go. Elizabeth Warren they wanted to challenge Clinton last time. I am no fan of Hillary Clinton however you have 2 admit she is far more knowledgable than Liz Warren. Joe Biden? Un- Presidential","name":"elizabeth liz warren","Sentiment":0.21},{"date":"2019-06-28T16:58:16+00:00","tweet":"YES!!! It’s perfect, right? Listen also to the “interview” of Elizabeth Warren by Bernie Sanders. Adomian is known for his fantastic take on Bernie. However; the lady who does Liz Warren is PERFECT.","name":"elizabeth liz warren","Sentiment":0.6714285714},{"date":"2019-06-28T07:57:22+00:00","tweet":"Elizabeth Warren would order a palliative care consult for a 95 year old lady with end stage heart failure. Liz Warren would defintely not consult CV surgery for sweet granny above. …","name":"elizabeth liz warren","Sentiment":0.0333333333},{"date":"2019-06-26T19:22:30+00:00","tweet":"Elizabeth Warren, and it's not even close. You want a new FDR, minus the racism and plus woman's awesomeness? That's Liz Warren. Number 2 is Kamala Harris and 3 Beto.","name":"elizabeth liz warren","Sentiment":0.0181818182},{"date":"2019-06-26T07:26:23+00:00","tweet":"\"6. Trump thinks that immigration and the crisis at the border are winning issues for him. They aren’t. But you can turn that around.\" Liz Warren heard you, Charlie, and she's here to help: \"Elizabeth Warren: Repeal The Law That Criminalizes Migrants\" …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-06-25T17:21:35+00:00","tweet":"Like, Liz Warren is probably the one who formulated the plan to reunite Nick Parker and Elizabeth James so Hallie and Annie could finally just be sisters","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-25T14:41:12+00:00","tweet":"See, this is my problem with Elizabeth Warren. Democrats of virtually every stripe have been calling for all of this for *literally decades*. But then Liz Warren proposes it as A PLAN in 2019 and her stans go nuts over it, calling it the GREATEST IDEA EVAR! Enough, goddammit! …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-06-20T23:11:20+00:00","tweet":"Oh hey, look at this. It's *yet another* very, very good reason to never vote for Elizabeth Warren: she's protecting and enabling Bernie Sanders. I'm officially *done* with Liz Warren. …","name":"elizabeth liz warren","Sentiment":0.91},{"date":"2019-06-17T13:18:33+00:00","tweet":"Elizabeth Warren @ewarren put on #RedFace & keeps here academic credentials. @KyleKashuv at 16 use a disgusting word & Harvard trashes him. #kylekashuv UNLESS LIZ WARREN IS STRIPPED OF ALL HER WEALTH CREATED AFTER PRETENDING TO BE NATIVE AMERICAN... THIS IS BULLSHIT,","name":"elizabeth liz warren","Sentiment":-0.3333333333},{"date":"2019-06-16T10:02:08+00:00","tweet":"Liz Warren is my girl. She's my warrior in this fight. -- Join me in supporting Elizabeth Warren via @actblue …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-06-15T20:16:09+00:00","tweet":"Hey guys! I just donated to Liz Warren's campaign. Please, Join me in supporting Elizabeth Warren via @actblue …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-06-14T01:00:13+00:00","tweet":"I swear to god it’s like we’re long lost best friends and just didn’t know it. Elizabeth McCord is amazing and I 100% get Bess vibes from Liz Warren.","name":"elizabeth liz warren","Sentiment":0.5166666667},{"date":"2019-06-13T17:33:29+00:00","tweet":"\"And calling Elizabeth Warren “unlikable” is equivalent to wearing an “I’m sexist” sign around your neck.\" that's an amazing comment isn't it, you can't dislike Liz Warren for policy, or lack there of? This is right out of the Hillary Clinton playbook.","name":"elizabeth liz warren","Sentiment":0.4428571429},{"date":"2019-06-13T09:37:54+00:00","tweet":"Only Liz Warren would believe the answer to running out of money is to spend more money! dem math? Elizabeth Warren on Social Security: 6 Things You Should Know …","name":"elizabeth liz warren","Sentiment":0.2194444444},{"date":"2019-06-10T04:52:36+00:00","tweet":"Elizabeth Warren: still voting for Ronald Reagan a THUG in the 80s and TWICE. W\/everything he did during the McCarthy era, Latin America, people on line at soup kitchens bc of his brutal cuts to welfare programs. Slow learner, Liz Warren. POTUS? No, a job for Bernie.","name":"elizabeth liz warren","Sentiment":-0.5875},{"date":"2019-06-08T05:17:02+00:00","tweet":"In 2014, Elizabeth Warren implemented her still ongoing education plan: Liz Warren Has a Former TFAer with a bachelors degree in “journalism, advertising, new media, and theater,\" a former summer intern, Advising Her on All Matters Pertaining to Education","name":"elizabeth liz warren","Sentiment":0.0454545455},{"date":"2019-06-07T18:01:21+00:00","tweet":"The GOP and President Putin prefer to run against Liz Warren. (Off the record Repubs call Warren “that psycho woman”.) Elizabeth Warren \/ Rachel Dolezal 2020 . @SenWarren @ewarren . #NeverTrump","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-07T07:12:09+00:00","tweet":"Tucker Carlson: Liz Warren Could Be Next Trump If She Were Just More Racist & Gross - Elizabeth Warren showed Fox News the back of her hand, but she's still managed to entrance Tucker Carlson of all people with her policy proposals. Last night, Carlson praised Warren's propo...","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-06-06T17:31:38+00:00","tweet":"I just sent some gay a video of Liz Warren I set to Barbie Tingz and he didn’t know who Elizabeth Warren was?? I’m donating more smh","name":"elizabeth liz warren","Sentiment":0.4583333333},{"date":"2019-06-05T22:36:19+00:00","tweet":"Does Fox News regularly refer to Elizabeth Warren as \"Liz\" Warren? Very strange.","name":"elizabeth liz warren","Sentiment":-0.0325},{"date":"2019-06-04T17:25:42+00:00","tweet":"Elizabeth “Likeable Liz” Warren stands out once again for having mentioned this ~stark reality~ for many parents. Really blows my mind that more candidates didn’t own up to this","name":"elizabeth liz warren","Sentiment":0.32},{"date":"2019-06-04T17:15:02+00:00","tweet":"Aspiring Czar Elizabeth Warren has a new Plan for Your Money: Liz Warren Unveils \"Economic Patriotism\" Plan: Calls For Aggressive Market Interventions, Active Dollar Management | Zero Hedge …","name":"elizabeth liz warren","Sentiment":0.0676767677},{"date":"2019-06-03T12:24:15+00:00","tweet":"Elizabeth Warren: I think sex workers shouldn’t have bank accounts You: 🦗 Warren: I don’t support M4A You: WOW WHO WOULD HAVE KNOWN LIZ WARREN ISN’T PERFECT WOW I’M GENUINELY SHOCKED","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2019-06-02T02:59:30+00:00","tweet":"There just aren’t enough WORDS to relay how much I LOVE Elizabeth Warren. There have been many things in my lifetime that I’ve wanted to ‘do to’ or ‘say to’ the avg politician. Liz Warren is the first (& only) one I’ve wanted to HUG and say “I adore you” to ️","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-05-31T09:08:30+00:00","tweet":"*Elizabeth Warren drops a new policy proposal re the indictment of a sitting president.* Liz Warren Stan Twitter:","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-05-30T19:41:05+00:00","tweet":"\"Liz Warren is to the left of Bernie\" is an ignorant statement. Elizabeth Warren voted for a defense budget that is higher than the one that Donald Trump requested. What kind of \"left of Bernie\" is that? …","name":"elizabeth liz warren","Sentiment":0.2125},{"date":"2019-05-28T21:34:30+00:00","tweet":"Pre-2019 me: Elizabeth Warren meh 2019 me: Liz Warren hell yeah","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-28T13:28:03+00:00","tweet":"one of the cooler things about me is i say \"Liz Warren\" instead of \"Elizabeth Warren\" as if i funkin know her","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-25T14:05:59+00:00","tweet":"Elizabeth Warren has 1 in 1024 chance to win the 2020 Presidential election*. (* not my joke!) PS: Pretty Good \"Liz Warren\" from @miserablelib! …","name":"elizabeth liz warren","Sentiment":0.7083333333},{"date":"2019-05-23T11:08:58+00:00","tweet":"“While teaching, Elizabeth Warren worked on more than 50 legal matters, charging as much as $675 an hour” I don’t give a shit. The political media is going to be so trash in 2020. (But it’s ironic to see someone pocket watching Liz Warren the way she was pocket watching PBO)","name":"elizabeth liz warren","Sentiment":0.15},{"date":"2019-05-23T00:45:47+00:00","tweet":"“Elizabeth Warren, who has a plan for housing, as she has a plan for everything” Ok seriously dude just Half Baked Liz Warren and she earned it.","name":"elizabeth liz warren","Sentiment":9.251858539e-18},{"date":"2019-05-22T08:56:21+00:00","tweet":"\"I'm for Medicare for All... Or AM I?\" –Liz Warren @KyleKulinski – Elizabeth Warren's Wishy-Washy Answer On Medicare For All","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-18T13:35:18+00:00","tweet":"my opinion on the primaries is that I call Elizabeth Warren \"Big Liz Warren\" and everybody else \"everybody else\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-14T12:51:57+00:00","tweet":"Elizabeth Warren Turns Down Fox News Town Hall, Calling the Network a ‘Hate-for-Profit Racket’ … via @thedailybeast EXACTLY Liz! Warren is so far the best candidate. Biden is stale bread","name":"elizabeth liz warren","Sentiment":0.1513888889},{"date":"2019-05-14T06:17:39+00:00","tweet":"When people think about Elizabeth Warren, people think about dishonesty & hypocrisy. Liz Warren is such a joke.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-05-08T19:48:06+00:00","tweet":"I like Liz. That's my stab at slogan writing. I copied from \"I like Ike.\" 3 letters, not Elizabeth, Liz Warren! That's a President","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-06T12:52:01+00:00","tweet":"Kellyanne Conway is ‘hopping mad’ that Elizabeth Warren isn’t blamed for the Dayton shooting(Unless Liz Warren is the reason for incredibly easy access to guns in the USA while accepting blood money from the NRA, then she isn't to blame for any of it) …","name":"elizabeth liz warren","Sentiment":-0.0958333333},{"date":"2019-08-06T10:52:15+00:00","tweet":"Multiple domestic terrorists directly cite Trump as their inspiration: \"Wow you can't blame Trump for that.\" One shooter incidentally says he would vote for Elizabeth Warren on social media: \"Wow Liz Warren is to blame for everything. Leftists are the REAL terrorists!\"","name":"elizabeth liz warren","Sentiment":0.0833333333},{"date":"2019-08-06T01:10:13+00:00","tweet":"“The Dayton killer was a Elizabeth Warren supporter and avowed Satan worshipper!” Said No One Ever in the #FakeNews \/MSM Even though the Dayton killer was a Liz Warren Voter & avowed Satan Worshipper! Oh- & the El Paso Killers ‘Manifesto’? It’s Full of Democrat talking points!","name":"elizabeth liz warren","Sentiment":0.4375},{"date":"2019-08-05T14:50:18+00:00","tweet":"The Dayton shooter was radicalized by liz Warren since he was an avid supporter of liz warren. So either we play this dumb your side owns this shooter game, in which you'll need to denounce Elizabeth Warren now; or we can accept that crazy people do crazy shit","name":"elizabeth liz warren","Sentiment":-0.3208333333},{"date":"2019-08-05T12:09:08+00:00","tweet":"Elizabeth Warren isn't a lying racist who promotes White Supremacy. Liz Warren supports Gun Control. Holy Toledo, You're not very smart.","name":"elizabeth liz warren","Sentiment":-0.0412087912},{"date":"2019-08-05T07:41:32+00:00","tweet":"Dayton echoes Elizabeth Warren and Bernie. Your point is to blame other people? Bernie has blood on his hands. Liz Warren too?","name":"elizabeth liz warren","Sentiment":-0.125},{"date":"2019-08-04T22:51:38+00:00","tweet":"So crazy guy hates immigrants - Trump made him do it Crazy guy loves Elizabeth Warren - Liz warren has nothing to do with this you racists. That’s your strategy?","name":"elizabeth liz warren","Sentiment":-0.6},{"date":"2019-08-01T15:37:08+00:00","tweet":"Liz Warren lies about her race to enrich herself, personally, and was a Republican until age 47. But, your call.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-31T23:06:08+00:00","tweet":"My democratic candidate picks in order of importance: 1. Elizabeth Warren 2. Liz Warren 3. Beth Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-31T01:39:05+00:00","tweet":"This horrible murder was filmed live tonight. The suspects are still at large Bernie \"Birdman\" Sanders and Elizabeth \"Liz\" Warren savagely beat John Delaney on live television people. Lets make these suspects POTUS and VP ASAP! #DemDebate #BernieSanders #ElizabethWarren","name":"elizabeth liz warren","Sentiment":-0.119724026},{"date":"2019-07-30T23:03:50+00:00","tweet":"Your monthly reminder that her name is *Elizabeth*, _not Liz_, Warren. It’s in her Twitter handle for heaven’s sake. It’s not at-LWarren it’s @ewarren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-30T22:20:48+00:00","tweet":"Liz Warren killing it tonight? Or Liz Warren is killing it tonight? Why not spell her whole first name? Elizabeth Warren is killing it tonight? \"You spelled Elizabeth Warren is wrong.\"","name":"elizabeth liz warren","Sentiment":-0.0166666667},{"date":"2019-07-30T13:39:21+00:00","tweet":"August 20, 2019 Joy Ann Reid Uhhh wow... what does it say that Warren is making a campaign stop to talk to these people *video of Liz Warren talking to people in West Virginia* ↩️1k 5.5k️28.3k Vox Dot Com Is Elizabeth Warren The Bernie Sanders Of 2020?","name":"elizabeth liz warren","Sentiment":0.45},{"date":"2019-07-27T01:57:08+00:00","tweet":"Elizabeth Warren, Betsy Warren or Liz Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-23T14:52:20+00:00","tweet":"Mate, to be be perfectly honest with ya, I was a bit worried at first, but Tom really set me head straight, made me realize that I was being a bit paranoid and that Elizabeth’s head won’t be turned [hard cut to Casa Amor where Liz Warren sneaking under the covers with a CEO]","name":"elizabeth liz warren","Sentiment":0.1916666667},{"date":"2019-07-23T13:03:26+00:00","tweet":"The rich and powerful, the ones who brought this country to the brink of financial collapse and got away with it, are afraid of Elizabeth Warren. Their racket is over on day one. Liz Warren: Oklahoma girl, daughter of a janitor, Harvard Law professor, US Senator, future POTUS. …","name":"elizabeth liz warren","Sentiment":0.015},{"date":"2019-07-22T09:16:01+00:00","tweet":"WaPo confirms: As lawyer, Elizabeth Warren worked to limit Dow Chemical's liability to breast implant victims—Liz Warren helped Big Corporation avoid liability to women victims?! Wow. 🤨🤔 …","name":"elizabeth liz warren","Sentiment":0.05},{"date":"2019-07-19T22:24:37+00:00","tweet":"Lesbian Vet Slams Liz Warren for Transgender Pronoun Games - PJ Media: Lesbian Vet Slams Liz Warren for Transgender Pronoun Games PJ Media Lesbian veteran Miriam Ben-Shalom urged Sen. Elizabeth Warren to drop the \"pronoun silliness\" that supports…","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-18T22:56:24+00:00","tweet":"Elizabeth Warren, Cenk? Really? The same Liz Warren who defended Joe Manchin on your show?","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-07-13T22:20:24+00:00","tweet":"My senators are Ed Markey and ??? Liz Warren??? Who’s that??? Is she President Elizabeth Warren’s sister?","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-06T17:37:32+00:00","tweet":"All killed by a left wing lunatic Liz Warren supporter. When will Elizabeth Warren take responsibility for this heinous act? Her hateful rhetoric drove this person to take nine innocent lives. This cannot stand.","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-08-06T14:32:21+00:00","tweet":"Take a look at the Democrats with their vile rhetoric that started under Obama! Can we also blame AOC & Elizabeth Warren for the 2 mass shooters actions, ya know since TX shooter was for AOC & OH was a Liz Warren, Satan & ANTIFA Supporter.. Did R's blame Bernie Sanders ...","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-06T04:49:38+00:00","tweet":"Sexism Sexism??? Just having fun with the hormonal crowd. Also Scott---Heard the guy who shot up Baltimore was on board with Elizabeth Warren and guess what? Not one Republican is doing what many DEMS are doing---\"SEE SEE---Liz Warren is inspiring mass murder.\" Makes ya wonder.","name":"elizabeth liz warren","Sentiment":0.4333333333},{"date":"2019-08-05T17:36:54+00:00","tweet":"You seem like the kind of guy that still cries at his birthday party when he doesn't get exactly what he wanted. Liz Warren - Happy Birthday, Boo Boo! Bernie - But Elizabeth, I distinctly asked for the Che Guevara fedora! I didn't want Stalin again! Damn you, Liz! Damn you!","name":"elizabeth liz warren","Sentiment":0.6456054688},{"date":"2019-08-05T14:37:53+00:00","tweet":"Liz, you realize the Ohio killer was an \"Elizabeth Warren\" supporter and hater of Pres Trump?????? We need to call out Liz Warren for amplifying these deadly leftist ideologies.","name":"elizabeth liz warren","Sentiment":-0.05},{"date":"2019-08-05T12:14:49+00:00","tweet":"It’s also sick that you’re so clearly pushing agenda by using the shooting in El Paso and somehow blaming Trump but you’re ignoring the shooting in Dayton. The shooter in Dayton was a pro-gun control, Elizabeth warren supporter but that doesn’t mean tht Liz warren is 2 blame","name":"elizabeth liz warren","Sentiment":-0.3089285714},{"date":"2019-08-03T11:06:37+00:00","tweet":"Join me in supporting Elizabeth Warren via @actblue If we want Liz Warren to be POTUS then we must chip in for the cause - please make a donation.","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-08-03T03:58:53+00:00","tweet":"Some suspect people are named as defendants in this lawsuit. Mentioned are CNN, NBC, Kathy Griffin, Shaun King and Liz Warren. And more. God bless these teenagers. Covington Catholic kids sue Elizabeth Warren and others in new defamation lawsuit …","name":"elizabeth liz warren","Sentiment":0.2121212121},{"date":"2019-07-31T20:49:44+00:00","tweet":"I would die if Elizabeth Warren like live tweeted this debate. It would be such a power move. Liz warren get on twitch or discord or something. Please.","name":"elizabeth liz warren","Sentiment":0.0681818182},{"date":"2019-07-31T19:52:55+00:00","tweet":"Liz Warren is a habitual liar. Elizabeth Warren Provides No Evidence for Claim ‘Cages of Babies’ Being Held at Border …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-31T00:39:26+00:00","tweet":"I need to know who her Black staffer is, bc that's who is running for President. Bc Elizabeth Warren is of the Bernie Sanders, 'class equality cures racism' & I do not know who this person is, truly. It looks like Liz Warren. Does not sound like her.","name":"elizabeth liz warren","Sentiment":-0.1833333333},{"date":"2019-07-30T23:04:54+00:00","tweet":"#sherunshercampaignirunmycampaign She runs her campaign I run my campaign Bernie talking about Liz Warren. Nice try Anderson. Bernie & Elizabeth are friends for 20 years you're not going to get them fighting. Wouldn't surprise me to see a Warren\/Sanders or vice versa ticket","name":"elizabeth liz warren","Sentiment":0.6},{"date":"2019-07-30T22:48:11+00:00","tweet":"$7 for Elizabeth Warren. I've now put my money where my mouth is for Liz Warren, Bernie Sanders, and Julian Castro. …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-30T21:27:25+00:00","tweet":"Elizabeth Warren wants to invest $2 trillion into research to make sure we aren't living in Atlantis in the future... .....this is momentarily a Liz Warren stan account","name":"elizabeth liz warren","Sentiment":0.2333333333},{"date":"2019-07-24T22:11:59+00:00","tweet":"This is going to be problematic for Liz Warren on the left. Elizabeth Warren Defends Israeli Shelling Of Gaza Schools …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-18T15:31:07+00:00","tweet":"@wsj From the article: “I’m personally looking at Liz Warren because she has a plan,” says Génesis Cubillas, an organizer for Planned Parenthood of Arizona. Abortion is only one of many subjects for which Elizabeth Warren has a plan. But not of those plans are supportable.","name":"elizabeth liz warren","Sentiment":0.1666666667},{"date":"2019-07-17T08:45:22+00:00","tweet":"I just think it's funny how Liz Warren literally stays after and takes a pic with anyone who wants it for F R E E and he's offering a \"sponsorship\" photo package (in the Midwest, no less) for $1,000 lollll","name":"elizabeth liz warren","Sentiment":0.1777777778},{"date":"2019-07-16T15:09:40+00:00","tweet":"Elizabeth Warren trying to accuse a real hero, ANOTHER PERSON for putting self interest above country??? Is this the same Fake Squaw who claimed to be a member of a minority to get special treatment. Liz Warren is a sorry imitation of Hatemonger Hillary Clinton!! …","name":"elizabeth liz warren","Sentiment":-0.0930272109},{"date":"2019-07-14T02:50:37+00:00","tweet":"Liz Warren couldn't even get it together to vote for Jimmy Carter after Watergate! Here she is clapping to Trump! How many of his executive appointments did she approve? … \"President Elizabeth Warren\"","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-07-04T11:30:58+00:00","tweet":"You really believe Elizabeth Warren has your daughter in the front of her mind? Liz Warren is an identity thief of the highest magnitude since 1986 when she filled out her first document stating she was descendant of the Cherokee Nation. Your daughter is not a priority for her. …","name":"elizabeth liz warren","Sentiment":0.2833333333},{"date":"2019-06-28T13:48:26+00:00","tweet":"My top ten Democratic primary candidates (not necessarily in order) 1. Elizabeth\/Liz Warren 2. Kamala Harris 3. Mayor Pete Buttigieg 4. Cory Booker 5. Julian Castro 6. Bernie Sanders 7. Joe Biden 8. Amy Klobuchar 9. Bill DeBlasio 10. Kirsten Gillibrand #DemocraticDebate2020","name":"elizabeth liz warren","Sentiment":0.225},{"date":"2019-06-27T20:30:37+00:00","tweet":"I would like to thank everyone for their Elizabeth Warren ... tweets where they don’t call her Liz Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-27T14:16:48+00:00","tweet":"This Elizabeth Warren always does the right thing meme is boring as hell, replace Chuck Norris with Liz Warren in Chuck Norris jokes and we're on.","name":"elizabeth liz warren","Sentiment":-0.3571428571},{"date":"2019-06-27T10:11:59+00:00","tweet":"Does no one else think it’s flattening a very smart\/accomplished person like Liz Warren’s credentials to compare every smart woman to the same female character in Harry Potter? Elizabeth Warren is an accomplished member of Congress\/law professor not a 15 year old from a kids book …","name":"elizabeth liz warren","Sentiment":0.119047619},{"date":"2019-06-26T21:59:28+00:00","tweet":"Have you noticed Lester Holt gave Elizabeth Liz Warren lots of air time in the beginning but once they got to the controversial questions they kept her safely out of the crossfire? #DebateNight","name":"elizabeth liz warren","Sentiment":0.525},{"date":"2019-06-26T21:30:40+00:00","tweet":"Follow Elizabeth Warren here: @ewarren | \"Liz Warren\" #DemDebate #DemocraticDebate #DemocraticDebates #DemDebates","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-26T21:25:51+00:00","tweet":"So Liz Warren has 4 times @TulsiGabbard needs to but in. Elizabeth Warren is the MSM’s chosen one. That’s very clear. And that’s why I will not buy a single thing she’s said.","name":"elizabeth liz warren","Sentiment":0.0292857143},{"date":"2019-06-23T23:06:45+00:00","tweet":"Liz Warren is preaching \"reparations\" for \"gay couples\" on tax returns. What??? Elizabeth Warren Demands Reparations For Gay And Lesbian Couples | Zero Hedge …","name":"elizabeth liz warren","Sentiment":0.4166666667},{"date":"2019-06-23T14:14:26+00:00","tweet":"Liz Warren plays identity politics. She tried portraying herself as a \"woman of color\". Now she plays to her gender. She needs to run on her record and her own damn plans, not Bernie's. Elizabeth Warren shows how unpopular identity politics is | TheHill …","name":"elizabeth liz warren","Sentiment":0.6},{"date":"2019-06-22T19:22:54+00:00","tweet":"They act like Elizabeth Warren isn't getting media coverage. It's to point that Liz Warren announces a plan similar to Kamala's plan like the next day.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-06-20T23:11:20+00:00","tweet":"Oh hey, look at this. It's *yet another* very, very good reason to never vote for Elizabeth Warren: she's protecting and enabling Bernie Sanders. I'm officially *done* with Liz Warren. …","name":"elizabeth liz warren","Sentiment":0.91},{"date":"2019-06-20T12:57:58+00:00","tweet":"Let's all REQUIRE that Pocahontas pay reparations to the Indian tribe that she falsely claimed she was a member. Say, 10 million dollars, from Liz Warren to the tribe ?. (Elizabeth, such a nice Indian family name..huh?) ....Warren is 100% FAKE.!! A DECEIVER..!! REMOVE HER.!! …","name":"elizabeth liz warren","Sentiment":-0.2},{"date":"2019-06-20T12:09:50+00:00","tweet":"Article: centrist Dems are supporting Elizabeth Warren because they hate Bernie. Bernie: well that’s shitty of centrist Dems. Centrist Dems: how fucking dare he insult Liz Warren??","name":"elizabeth liz warren","Sentiment":-0.3833333333},{"date":"2019-06-17T14:00:32+00:00","tweet":"Elizabeth “Liz” Warren has plans for making housing and child care affordable, forgiving college loans, tackling the opioid crisis, protecting public lands and more. Will she get your vote in 2020? …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-06-17T07:00:26+00:00","tweet":"Can Elizabeth Warren Win It All? No! So Liz Warren is Bernie 2.0. She plans to only offer mythical economic promises and ignore civil rights... I'll pass! …","name":"elizabeth liz warren","Sentiment":0.4166666667},{"date":"2019-06-14T13:06:22+00:00","tweet":"Any time Elizabeth “Likeable Liz” Warren says she has a plan for something, my day gets better …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-06-13T17:33:29+00:00","tweet":"\"And calling Elizabeth Warren “unlikable” is equivalent to wearing an “I’m sexist” sign around your neck.\" that's an amazing comment isn't it, you can't dislike Liz Warren for policy, or lack there of? This is right out of the Hillary Clinton playbook.","name":"elizabeth liz warren","Sentiment":0.4428571429},{"date":"2019-06-13T10:43:51+00:00","tweet":"Have Massachusetts Democrats lost faith in themselves or in Elizabeth Warren? … via @BostonGlobe Nope, I love Liz Warren, I just think she can't win (sexism) and want her as my Senator!","name":"elizabeth liz warren","Sentiment":0.75},{"date":"2019-06-10T13:41:52+00:00","tweet":"fun fact but most of the critiques about elizabeth warren also apply to bernie this is not a 'liz warren is being treated unfairly by bernie bros' post this is a 'they're both not very good and stans of either are deluding themselves if they think otherwise' post.","name":"elizabeth liz warren","Sentiment":0.0076923077},{"date":"2019-06-10T04:52:36+00:00","tweet":"Elizabeth Warren: still voting for Ronald Reagan a THUG in the 80s and TWICE. W\/everything he did during the McCarthy era, Latin America, people on line at soup kitchens bc of his brutal cuts to welfare programs. Slow learner, Liz Warren. POTUS? No, a job for Bernie.","name":"elizabeth liz warren","Sentiment":-0.5875},{"date":"2019-09-08T18:39:52+00:00","tweet":"Hnmm.. this article reports that Hillary Clinton & Elizabeth Warren are teaming up to take on 2020 Dem Presidential candidates. Will H!ll@ry be fall!ng d0wn & tw!tch!ng and sh@king like she did in 2016? Will Liz Warren wear a Native American headdress? …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-07T10:49:35+00:00","tweet":"You see right, Joe. We need to elect Elizabeth Warren as our next President! Liz Warren is the leader America needs. #Warren2020","name":"elizabeth liz warren","Sentiment":0.3619047619},{"date":"2019-09-06T21:01:09+00:00","tweet":"Elizabeth Warren could do Teddy Roosevelt but Teddy Roosevelt couldn’t do Liz Warren.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-03T20:41:03+00:00","tweet":"Elizabeth Warren parroted Bernie throughout 2015 but didn't endorse him. not a peep about Standing Rock but \"I'm part Native-American!\" she backed a Wall St darling despite her alleged tough-on-Wall-Street reputation. Liz Warren is canceled. she'd flip on us in a hot minute.","name":"elizabeth liz warren","Sentiment":0.075},{"date":"2019-09-01T21:58:20+00:00","tweet":"trying to make up my mind on Liz Warren. Fake Elizabeth Warren Attacks Spread Online","name":"elizabeth liz warren","Sentiment":-0.5},{"date":"2019-08-28T11:04:06+00:00","tweet":"Elizabeth Warren has an Anti Corruption Bill for that! Liz Warren! My next President!","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-28T10:03:35+00:00","tweet":"I’m not interested in being embarrassed by a Liz Warren fiasco during this election cycle. Hiding won’t help, Liz or her people need to debunk this stuff if they can... Elizabeth Warren scrubs website of Cherokee ancestry claims … via @nypost","name":"elizabeth liz warren","Sentiment":-0.125},{"date":"2019-08-28T03:59:21+00:00","tweet":"Elizabeth Warren, Socialist Part 1: Liz Warren and the Heather Booth\/Democratic Socialists of America Connection – Trevor Loudon's New Zeal Blog …","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-08-27T13:45:43+00:00","tweet":"There is stale moldy bread. And there's Liz Warren. I mean, You don't really want to give either to Your Children. Flaskback: Liz Warren on Bill Moyers Show … This demonstates IMO, how far Elizabeth Warren has sold out. …","name":"elizabeth liz warren","Sentiment":-0.128125},{"date":"2019-08-27T12:28:28+00:00","tweet":"I do not trust Elizabeth Warren on #Medicare4All. She will make excuses and never look back. Liz Warren will give the poors as little as possible to quell any discontent. It is the neoliberal way.","name":"elizabeth liz warren","Sentiment":-0.0625},{"date":"2019-08-26T14:31:27+00:00","tweet":"The nominee will either be Elizabeth Warren or Bernie Sanders. I personally believe that Bernie Sanders has a much stronger chance of beating Donald Trump in the general, and Bernie's track record is better, however I will absolutely support Liz Warren too.","name":"elizabeth liz warren","Sentiment":0.19},{"date":"2019-08-24T19:01:51+00:00","tweet":"Why doesn't Elizabeth Warren go by Liz Warren? If Bill Clinton went by William Clinton, I wouldn't of voted for him. #Vote_Liz #NickNamesAreAwesome #IasWell","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-19T18:06:26+00:00","tweet":"Liz Warren Self-Own Complete Elizabeth Warren has deleted the infamous DNA video she made touting that she is 1\/1024th *maybe* Native American. Her \"Fact Squad\" page propping up the hysterical video has also been deleted entirely. \"Facts\" deleted. …","name":"elizabeth liz warren","Sentiment":-0.28},{"date":"2019-08-19T14:13:12+00:00","tweet":"DISGUSTING: After Lying About Her 1\/1024th Indian Heritage for Years – Liz Warren Hopes She Can Buy Off Indians for Their Vote Elizabeth Warren has made up elaborate stories over the years to bolster her claims that she is Native American. …","name":"elizabeth liz warren","Sentiment":-0.1666666667},{"date":"2019-08-16T06:55:11+00:00","tweet":"NY Times gives Liz Warren the Hillary Clinton treatment to undermine her candidacy: Many Democrats Love Elizabeth Warren. They Also Worry About Her.","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-08-16T04:47:33+00:00","tweet":"Elizabeth Warren. Jew hater. Here We Go... Democrat Liz Warren Defends Anti-Semites Ilhan Omar and Rashida Tlaib -- Trashes Israel … via @gatewaypundit","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-10T13:06:42+00:00","tweet":"remember the corporate media continue to aid race baiters & liars like elizabeth warren.....the only chance we have is hold such vile waste of good air like liz warren financially libel....it is all scum like liz warren care about, take everything she has & give it to vets & cops","name":"elizabeth liz warren","Sentiment":0.0285714286},{"date":"2019-08-10T13:04:07+00:00","tweet":"elizabeth warren is not only a race baiter & liar, liz warren is threat to lawfulness n the the USA & therefore a threat to the USA & worst is a threat to the USA citizens....we must take this threat very seriously & b aware liz warren is willing to put herself ahead of facts!!!!","name":"elizabeth liz warren","Sentiment":-0.0349121094},{"date":"2019-08-10T11:38:43+00:00","tweet":"Ferguson & Every Town\/City In USA=Liz Warren Foments Chaos In USA Again With A Lie=Obama DOJ Showed NOT MURDER=NOT PRESIDENTIALANGEROUS LIZ=My View=Elizabeth Warren claims Michael Brown was 'murdered.' The response she got on Twitter wasn't pretty. …","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-09-03T12:51:21+00:00","tweet":"Liz Warren playing the ignore my hypocrisy card. WATCH: Elizabeth Warren channels her inner-Barack Obama, lectures wealthy Americans - TheBlaze …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-08-31T04:28:30+00:00","tweet":"the hard choice of Liz Warren. Listening to people on all sides here. Elizabeth Warren Can't Be Trusted?","name":"elizabeth liz warren","Sentiment":-0.2916666667},{"date":"2019-08-28T03:59:40+00:00","tweet":"Elizabeth Warren, Socialist Part 2: Liz Warren and Progressive Democratics of America – Trevor Loudon's New Zeal Blog …","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-08-27T09:52:52+00:00","tweet":"Elizabeth Warren is confused again it is Joe Biden that puts his hands all over people. Liz Warren Makes Mind-Boggling Sexual Comment About President Trump - Explain Life …","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-08-26T13:11:00+00:00","tweet":"Why Liz Warren is the smart choice vs. Bernie. The New York Times: What Elizabeth Warren Is Quietly Telling Democratic Insiders. … via @GoogleNews","name":"elizabeth liz warren","Sentiment":0.1168831169},{"date":"2019-08-24T08:33:09+00:00","tweet":"(2) BOSTON HERALD EDITORIAL: ELIZABETH WARREN pander-of-the-month is especially ironic..Payoff to tribal nations just the latest. “There is no level to which presidential candidate Liz Warren won’t sink. Every couple of weeks the campaign conducts a fire-sale of core principles..","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-08-23T10:34:13+00:00","tweet":"Elizabeth Warren To Introduce Bill Revoking Medals Of Honor For Wounded Knee Massacre … Give it up Liz Warren. You will be damned lucky to get voted back into congress.","name":"elizabeth liz warren","Sentiment":0.1666666667},{"date":"2019-08-22T12:06:22+00:00","tweet":"Dolly Parton Reaches Limit, Tells Liz Warren To Go Pound Sand via @YouTube Dolly gives money. Elizabeth takes it. Like all Democrats","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-20T15:46:26+00:00","tweet":"This is the reason an investigation should be opened for Elizabeth Warren. If she lied on this I’m sure she lied on scholarship apps as well. Let’s see your records Liz Warren!! …","name":"elizabeth liz warren","Sentiment":0.78125},{"date":"2019-08-19T23:18:21+00:00","tweet":"Elizabeth Warren has more integrity in her pinkie toe than the entirety of the Trump administration and the GOP. So @GOP, grow up and recognize the truth that Liz Warren answered based on a family-held truth, had no effect on her hiring. And will be our first WOMAN PRESIDENT!!!","name":"elizabeth liz warren","Sentiment":0.494140625},{"date":"2019-08-19T21:01:37+00:00","tweet":"Elizabeth Warren Apologizes at Native American Forum: ‘I Have Listened and I Have Learned’ ELIZABETH WARREN CRIME NO PUNISHMENT MINORIES SUFFERED FROM HER CRIME! SHED NEVER ADMIT IF NOT CAUGHT ASK HER THAT! VOTE BIDEN NOT CRIMINAL LIZ WARREN MINORITY LIAR!","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2019-08-19T19:42:41+00:00","tweet":"‘I Have Made Mistakes’: Elizabeth Warren Apologizes at Native American Forum via @BreitbartNews #Liz #Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-19T14:04:26+00:00","tweet":"Yes. Elizabeth Warren is a chameleon. She can change colors to suit whatever environment she's in. @realDonaldTrump New nickname for Liz Warren T H E C H A M E L E O N","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-08-18T23:55:42+00:00","tweet":"Sure He did. The Lord apparently, if we are to believe 1\/1024th Liz Warren, said \"I need a candidate who is so far to the Left on Abortion...\" Yeah that's what I thought. And then Elizabeth Warren woke up in a cold sweat. Spare Us the Bull$hit. @Catmundu50 @SenWarren …","name":"elizabeth liz warren","Sentiment":0.01},{"date":"2019-08-18T21:20:52+00:00","tweet":"Elizabeth Warren, Socialist Part 1: Liz Warren and the Heather Booth\/Democratic Socialists of America Connection …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-16T14:18:37+00:00","tweet":"Go ahead Democrats Elizabeth Warren up for election for President. Talk about liars and panders. Pretty pathetic defending a thug Compulsive Liar Liz Warren Won't Apologize for Saying Cop-Beater Mike Brown was Murdered … via @gatewaypundit","name":"elizabeth liz warren","Sentiment":-0.375},{"date":"2019-08-15T12:35:06+00:00","tweet":"Piss off. You're nothing more than an identity politics playing shill for Elizabeth Warren. She's not to Bernie's left. Liz Warren: Always votes to increase military budget Flip flops on M4A all the time Plans to take corporate PAC money in the general ...and more. …","name":"elizabeth liz warren","Sentiment":0.1583333333},{"date":"2019-08-14T00:56:31+00:00","tweet":"#time for @ewarren LIZ WARREN #fan #art! #fearless #leader Elizabeth #Warren is #adult that #America needs to right our #patriotic ship! #freedom means #Unity #healthcare #education #food #shelter for ALL #humans #americans! #usa #warren2020 #Persist #resist #stonersforwarren","name":"elizabeth liz warren","Sentiment":0.2732142857},{"date":"2019-08-11T09:00:30+00:00","tweet":"Liz Warren Tries to Save People by Keeping Them from Defending Themselves: Her Gun Control Plan is a Doozy … #Allow Media Exception #Congress #Crime #Democrats #elizabeth warren #elon musk #Featured Story #Front Page Stories #Gun #Mass Shootings #NRA","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2019-08-10T09:11:51+00:00","tweet":"ELIZABETH WARREN: if I become President, I promise to stoke racial division and divide the country! Warren2020. (Im Liz Warren and I approve this message).","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-09T17:26:53+00:00","tweet":"This is an Elizabeth “Lizzy Liz” Warren stan account","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-08T23:11:30+00:00","tweet":"Reporter from Iowa with the job of covering the campaign of Elizabeth Warren, who is campaigning in Iowa, \"Just Happens\" to come across Liz Warren while campaigning...in Iowa. Kim is the luckiest reporter -- in Iowa, on the campaign trail! …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-06T12:52:01+00:00","tweet":"Kellyanne Conway is ‘hopping mad’ that Elizabeth Warren isn’t blamed for the Dayton shooting(Unless Liz Warren is the reason for incredibly easy access to guns in the USA while accepting blood money from the NRA, then she isn't to blame for any of it) …","name":"elizabeth liz warren","Sentiment":-0.0958333333},{"date":"2019-08-06T10:52:15+00:00","tweet":"Multiple domestic terrorists directly cite Trump as their inspiration: \"Wow you can't blame Trump for that.\" One shooter incidentally says he would vote for Elizabeth Warren on social media: \"Wow Liz Warren is to blame for everything. Leftists are the REAL terrorists!\"","name":"elizabeth liz warren","Sentiment":0.0833333333},{"date":"2019-08-06T01:10:13+00:00","tweet":"“The Dayton killer was a Elizabeth Warren supporter and avowed Satan worshipper!” Said No One Ever in the #FakeNews \/MSM Even though the Dayton killer was a Liz Warren Voter & avowed Satan Worshipper! Oh- & the El Paso Killers ‘Manifesto’? It’s Full of Democrat talking points!","name":"elizabeth liz warren","Sentiment":0.4375},{"date":"2019-08-05T14:50:18+00:00","tweet":"The Dayton shooter was radicalized by liz Warren since he was an avid supporter of liz warren. So either we play this dumb your side owns this shooter game, in which you'll need to denounce Elizabeth Warren now; or we can accept that crazy people do crazy shit","name":"elizabeth liz warren","Sentiment":-0.3208333333},{"date":"2019-08-05T12:09:08+00:00","tweet":"Elizabeth Warren isn't a lying racist who promotes White Supremacy. Liz Warren supports Gun Control. Holy Toledo, You're not very smart.","name":"elizabeth liz warren","Sentiment":-0.0412087912},{"date":"2019-08-04T22:51:38+00:00","tweet":"So crazy guy hates immigrants - Trump made him do it Crazy guy loves Elizabeth Warren - Liz warren has nothing to do with this you racists. That’s your strategy?","name":"elizabeth liz warren","Sentiment":-0.6},{"date":"2019-08-01T15:37:08+00:00","tweet":"Liz Warren lies about her race to enrich herself, personally, and was a Republican until age 47. But, your call.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-31T23:06:08+00:00","tweet":"My democratic candidate picks in order of importance: 1. Elizabeth Warren 2. Liz Warren 3. Beth Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-31T01:39:05+00:00","tweet":"This horrible murder was filmed live tonight. The suspects are still at large Bernie \"Birdman\" Sanders and Elizabeth \"Liz\" Warren savagely beat John Delaney on live television people. Lets make these suspects POTUS and VP ASAP! #DemDebate #BernieSanders #ElizabethWarren","name":"elizabeth liz warren","Sentiment":-0.119724026},{"date":"2019-07-30T23:03:50+00:00","tweet":"Your monthly reminder that her name is *Elizabeth*, _not Liz_, Warren. It’s in her Twitter handle for heaven’s sake. It’s not at-LWarren it’s @ewarren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-30T22:20:48+00:00","tweet":"Liz Warren killing it tonight? Or Liz Warren is killing it tonight? Why not spell her whole first name? Elizabeth Warren is killing it tonight? \"You spelled Elizabeth Warren is wrong.\"","name":"elizabeth liz warren","Sentiment":-0.0166666667},{"date":"2019-07-30T13:39:21+00:00","tweet":"August 20, 2019 Joy Ann Reid Uhhh wow... what does it say that Warren is making a campaign stop to talk to these people *video of Liz Warren talking to people in West Virginia* ↩️1k 5.5k️28.3k Vox Dot Com Is Elizabeth Warren The Bernie Sanders Of 2020?","name":"elizabeth liz warren","Sentiment":0.45},{"date":"2019-07-27T01:57:08+00:00","tweet":"Elizabeth Warren, Betsy Warren or Liz Warren","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-23T14:52:20+00:00","tweet":"Mate, to be be perfectly honest with ya, I was a bit worried at first, but Tom really set me head straight, made me realize that I was being a bit paranoid and that Elizabeth’s head won’t be turned [hard cut to Casa Amor where Liz Warren sneaking under the covers with a CEO]","name":"elizabeth liz warren","Sentiment":0.1916666667},{"date":"2019-07-23T13:03:26+00:00","tweet":"The rich and powerful, the ones who brought this country to the brink of financial collapse and got away with it, are afraid of Elizabeth Warren. Their racket is over on day one. Liz Warren: Oklahoma girl, daughter of a janitor, Harvard Law professor, US Senator, future POTUS. …","name":"elizabeth liz warren","Sentiment":0.015},{"date":"2019-07-19T22:24:37+00:00","tweet":"Lesbian Vet Slams Liz Warren for Transgender Pronoun Games - PJ Media: Lesbian Vet Slams Liz Warren for Transgender Pronoun Games PJ Media Lesbian veteran Miriam Ben-Shalom urged Sen. Elizabeth Warren to drop the \"pronoun silliness\" that supports…","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-07-18T22:56:24+00:00","tweet":"Elizabeth Warren, Cenk? Really? The same Liz Warren who defended Joe Manchin on your show?","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-07-13T22:20:24+00:00","tweet":"My senators are Ed Markey and ??? Liz Warren??? Who’s that??? Is she President Elizabeth Warren’s sister?","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-08T23:12:26+00:00","tweet":"It is clear that Elizabeth Warren has a bad relationship with the truth. For most of her life. No one is worthy of becoming POTUS from the Demorat UnParty. #TRUMP2020Lanslide LYING LIZ! Warren Busted for Another Lie About Her Past | Ep 458 via @YouTube","name":"elizabeth liz warren","Sentiment":0.0909722222},{"date":"2019-10-08T07:40:20+00:00","tweet":"Media's smear of Liz Warren FAILS: JUST IN: New Details Support Elizabeth Warren's Account She Was Let Go From Teaching Job for Being Pregnant … via @mediaite","name":"elizabeth liz warren","Sentiment":-0.0101010101},{"date":"2019-10-04T16:15:05+00:00","tweet":"Is Elizabeth \"Liz\" Warren a \"cougar?\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-03T19:20:19+00:00","tweet":"Jacob Wohl: Elizabeth Warren was banging a 24-year-old dude guys!! America to Liz Warren:","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-03T16:20:10+00:00","tweet":"Well I’m sure I’m the only man to have had rough sex with Elizabeth “Liz” Warren and a Busty 20 something","name":"elizabeth liz warren","Sentiment":0.1333333333},{"date":"2019-10-03T16:12:56+00:00","tweet":"Thinking about that time I had sex with Elizabeth “Liz” Warren and a busy 20 something","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-10-03T15:31:49+00:00","tweet":"Republicans are so scared of Elizabeth ‘Liz’ Warren, they had to pull out the big guns: Jacob Wohl and a lime green dildo. #Warren2020","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2019-10-03T14:03:17+00:00","tweet":"A sign that says, \"Elizabeth Warren: Cougar?\" This is confusing. Is this a breaking scandal or a Liz Warren campaign event?","name":"elizabeth liz warren","Sentiment":-0.3},{"date":"2019-10-03T07:49:42+00:00","tweet":"I predict a disappointed Marine when he finds out it is not Senator Elizabeth Warren, but Liz Warren, the headliner from the MILF Strip & Bar Lounge.","name":"elizabeth liz warren","Sentiment":-0.75},{"date":"2019-10-01T11:31:56+00:00","tweet":"Liz Warren’s full name is Elizabeth War On Rich White Men","name":"elizabeth liz warren","Sentiment":0.2416666667},{"date":"2019-09-26T09:19:18+00:00","tweet":"What These Kids Did with Elizabeth Warren's Lemonade Money is Hilarious. Family has announced that it intends to donate Liz Warren’s ten bucks to a pro-life organization! … via @PoliticsIsDirty","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-09-22T19:44:15+00:00","tweet":"The Idea of having to listen to Liz Warren's voice much longer is making me dig...Her husband is a professor at Harvard.. where did this come from? How can she relate to middle class? A BEER.. She thinks we are stupid. Elizabeth Warren · Net worth $8 million USD","name":"elizabeth liz warren","Sentiment":-0.06},{"date":"2019-09-21T22:25:03+00:00","tweet":"Muting the name Liz, Warren, Elizabeth from my twitter. I'm sorry. I can't stand Pocahontas.","name":"elizabeth liz warren","Sentiment":-0.5},{"date":"2019-09-19T19:18:34+00:00","tweet":"Crowded in Liz Warren's head: NYC says she told whopper about crowd size! Elizabeth Warren’s campaign keeps inflating the crowd size! How ever many people Pocahontas says shows up to her Rallies, the real number is 1\/2 of what she says! … via @BIZPACReview","name":"elizabeth liz warren","Sentiment":0.375},{"date":"2019-09-16T06:43:57+00:00","tweet":"Elizabeth Warren Liz Warren Betsy Warren Lizzo Warren Lizabet “I have a plan for that” Warren …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-13T14:55:29+00:00","tweet":"Yes, we are ready for her! It’s past time we elect a woman for president & Elizabeth Warren is the best candidate that can take on traitor trump. She is totally qualified, and has the strong character, intellect & integrity we need! Liz Warren for President!","name":"elizabeth liz warren","Sentiment":0.4128472222},{"date":"2019-09-13T12:26:34+00:00","tweet":"Elizabeth Warren is Direct Descendant of 'Indian Fighter' Who Slaughtered Tribe - … Via - @NeonNettle #NeonNettle SNOW WHITE CHEROKEE LIZ WARREN'S GREAT ; X3 GRANDFATHER WAS INDIAN FIGHTER HE HELPED TO TAKE INDIAN PROPERTY SAME AS LIZ WARREN IS DOING NOW","name":"elizabeth liz warren","Sentiment":0.225},{"date":"2019-09-13T10:25:34+00:00","tweet":"Elizabeth Warren is long for Liz Warren, which actually is short for \"Lizerd-Person\" Warren","name":"elizabeth liz warren","Sentiment":-0.025},{"date":"2019-09-11T02:08:48+00:00","tweet":"Even if you trust Jim Cramer’s Chicken Little impression, the Military Industrial Complex knows it will be in good hands with Liz Warren When It Comes to U.S. Militarism, Elizabeth Warren Is No Progressive - …","name":"elizabeth liz warren","Sentiment":-0.0975},{"date":"2019-10-08T10:58:34+00:00","tweet":"@realDonaldTrump , @RudyGiuliani too: has it dawned on anyone else yet that Elizabeth Warren was the FIRST college admissions scandal participant! That Liz Warren actually instigated and created the way\/path for the current college admissions scandal that's going on @ present.","name":"elizabeth liz warren","Sentiment":0.078125},{"date":"2019-10-06T18:10:34+00:00","tweet":"Elizabeth Warren lies because she the liberal media will never call her out on it SHE CAN'T STOP LYING: Liz Warren Claims She's the Daughter of a Janitor -- But Her Dad's Death Certificate Lists Him as Flight Instructor for US Army … via @gatewaypundit","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-06T13:54:30+00:00","tweet":"Remember, Elizabeth Warren Saying Christine Ford telling the Truth, Liz Warren Just Got CAUGHT In ANOTHER LIE! (Saying She was fired because she was pregnant, FOUND A TAPE FROM THAT YEAR, Another LIE!","name":"elizabeth liz warren","Sentiment":0.4166666667},{"date":"2019-10-02T23:49:17+00:00","tweet":"Hi! Hi! Hi my name is Elizabeth Warren, well actually just Liz Warren and you know what? I'm the dumbest person in this race. I can't believe if! Can you?","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-30T13:35:49+00:00","tweet":"Dems Plotting Secret Liz Warren Mutiny. Senator Elizabeth Warren is certainly gaining traction in the polls, but THESE Democrats are pulling their support due to her ultra-progressive policies. Could this be the end 4 Elizabeth Warren? Indeed!Dems Attack! Good Night, Pocahontas!","name":"elizabeth liz warren","Sentiment":0.1332589286},{"date":"2019-09-29T18:59:33+00:00","tweet":"Check out @AdamGreen's page. He's using member resources to promote Elizabeth Warren, and so is @pccc, even though the Membership supports Bernie. They're getting ready to pull a WFP. Also, Adam Green says we're RASICTS if we ask about Liz Warren claiming minority status.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-28T13:27:40+00:00","tweet":"Join me in supporting Elizabeth Warren via @actblue …: We have, our pennies only go to Liz Warren, she has the plans for the working man.","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2019-09-27T11:28:26+00:00","tweet":"Did you see Liz Warren retweet this with the comment, “I’m Elizabeth Warren, and I approve this message”?","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-24T05:40:19+00:00","tweet":"In 2014, Elizabeth Warren implemented her still ongoing education plan: Liz Warren Has a Former TFAer with a bachelors degree in “journalism, advertising, new media, and theater,\" a former summer intern, Advising Her on All Matters Pertaining to Education …","name":"elizabeth liz warren","Sentiment":0.0454545455},{"date":"2019-09-24T00:52:29+00:00","tweet":"I disagree. @HillTVLive I don't believe TRUMP can beat anybody in 2020. And I think underestimating Elizabeth Warren (bec. she's a woman) would actually be to her advantage. TRUMP is headed for Prison. Liz Warren is way stronger than folks think.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-23T19:18:08+00:00","tweet":"Elizabeth Warren, Socialist Part 2: Liz Warren and Progressive Democratics of America …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-23T19:17:28+00:00","tweet":"Elizabeth Warren, Socialist Part 1: Liz Warren and the Heather Booth\/Democratic Socialists of America Connection …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-23T13:58:22+00:00","tweet":"I dont care if Liz Warren names Hillary Clinton, Michelle Obama, or even Barack himself to the VP spot. I refuse to vote for Elizabeth Warren in the General Election. Full Stop.","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-09-23T06:59:36+00:00","tweet":"‘Native American’ Elizabeth Warren caught cheating on tax returns.. Liz Warren Campaign: IRS Filing Of $50K In Used Clothing Was ‘Entry Error’ « Tammy Bruce …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-22T01:05:36+00:00","tweet":"Some of The Young Turks’ audience are accusing Elizabeth Warren of being “too hawkish” and “voting for a big defense budget.” If the isolationist pigeon Nutso Liz Warren is a hawk then that makes me a: MEGA ÜBER ULTIMATE BASED HAWK TO THE HAWKTH POWER!","name":"elizabeth liz warren","Sentiment":0.0333333333},{"date":"2019-09-19T13:47:22+00:00","tweet":"In my wildest dreams, I cannot fathom a party that would allow someone like Elizabeth Warren as their nominee. I thought Hillary Clinton was the worst but a full fledged socialist like Liz Warren is seriously gaining traction. The left has no right to say one word about Potus.","name":"elizabeth liz warren","Sentiment":-0.2252380952},{"date":"2019-09-11T12:49:28+00:00","tweet":"Trickle-down theory is a monstrous lie intended to justify the rich getting richer! Rockstar, Elizabeth Warren, has a plan for that!You gotta Love, Liz Warren! …","name":"elizabeth liz warren","Sentiment":0.546875},{"date":"2019-09-10T20:53:53+00:00","tweet":"One overwhelming reason to vote Liz Warren. “Wall Street executives are saying Elizabeth Warren's 2020 bid has 'got to be stopped'” …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-09-10T16:03:17+00:00","tweet":"My dude. They did a whole segment bashing tulsi while defending elizabeth warren. At one point ana tried to argue that liz warren was better on m4a than tulsi. The bias is real.","name":"elizabeth liz warren","Sentiment":0.3},{"date":"2019-09-10T14:42:51+00:00","tweet":"Liz Warren should never be president. Elizabeth Warren Responds To Criticism Of Military Budget Vote #Warren2020 #Berneie2020 #TuesdayMorning via @YouTube","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2019-09-09T15:39:25+00:00","tweet":"Elizabeth Warren walked back being Republican, walked back being progressive in 2016 to back Hil, walked back claiming native ancestry, walked back support for Medicare4All to just \"medical access\". Liz Warren:","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-09T10:32:48+00:00","tweet":"Hillary Clinton Advising Elizabeth Warren on How to 'Beat Trump' in 2020 - … Via - @NeonNettle #NeonNettle A 2X LOSER HILLARY CLINTON IS ADVISING A SNOW WHITE CHEROKEE LIZ WARREN ON HOW TO BEAT TRUMP IN 2020 A JOKE OR WHAT ? LOL !","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-09-08T23:35:10+00:00","tweet":"Okay look. If you call her “Liz Warren” tell me why - because she goes by Elizabeth from everything I can tell, and I’m genuinely curious if it’s sheer laziness or there’s a good reason for shortening “Elizabeth” to “Liz” without an invitation to invoke a nickname.","name":"elizabeth liz warren","Sentiment":0.275},{"date":"2019-09-08T18:39:52+00:00","tweet":"Hnmm.. this article reports that Hillary Clinton & Elizabeth Warren are teaming up to take on 2020 Dem Presidential candidates. Will H!ll@ry be fall!ng d0wn & tw!tch!ng and sh@king like she did in 2016? Will Liz Warren wear a Native American headdress? …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-07T10:49:35+00:00","tweet":"You see right, Joe. We need to elect Elizabeth Warren as our next President! Liz Warren is the leader America needs. #Warren2020","name":"elizabeth liz warren","Sentiment":0.3619047619},{"date":"2019-09-06T21:01:09+00:00","tweet":"Elizabeth Warren could do Teddy Roosevelt but Teddy Roosevelt couldn’t do Liz Warren.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-03T20:41:03+00:00","tweet":"Elizabeth Warren parroted Bernie throughout 2015 but didn't endorse him. not a peep about Standing Rock but \"I'm part Native-American!\" she backed a Wall St darling despite her alleged tough-on-Wall-Street reputation. Liz Warren is canceled. she'd flip on us in a hot minute.","name":"elizabeth liz warren","Sentiment":0.075},{"date":"2019-09-01T21:58:20+00:00","tweet":"trying to make up my mind on Liz Warren. Fake Elizabeth Warren Attacks Spread Online","name":"elizabeth liz warren","Sentiment":-0.5},{"date":"2019-08-28T11:04:06+00:00","tweet":"Elizabeth Warren has an Anti Corruption Bill for that! Liz Warren! My next President!","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-28T10:03:35+00:00","tweet":"I’m not interested in being embarrassed by a Liz Warren fiasco during this election cycle. Hiding won’t help, Liz or her people need to debunk this stuff if they can... Elizabeth Warren scrubs website of Cherokee ancestry claims … via @nypost","name":"elizabeth liz warren","Sentiment":-0.125},{"date":"2019-08-28T03:59:21+00:00","tweet":"Elizabeth Warren, Socialist Part 1: Liz Warren and the Heather Booth\/Democratic Socialists of America Connection – Trevor Loudon's New Zeal Blog …","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-08-27T13:45:43+00:00","tweet":"There is stale moldy bread. And there's Liz Warren. I mean, You don't really want to give either to Your Children. Flaskback: Liz Warren on Bill Moyers Show … This demonstates IMO, how far Elizabeth Warren has sold out. …","name":"elizabeth liz warren","Sentiment":-0.128125},{"date":"2019-08-27T12:28:28+00:00","tweet":"I do not trust Elizabeth Warren on #Medicare4All. She will make excuses and never look back. Liz Warren will give the poors as little as possible to quell any discontent. It is the neoliberal way.","name":"elizabeth liz warren","Sentiment":-0.0625},{"date":"2019-08-26T14:31:27+00:00","tweet":"The nominee will either be Elizabeth Warren or Bernie Sanders. I personally believe that Bernie Sanders has a much stronger chance of beating Donald Trump in the general, and Bernie's track record is better, however I will absolutely support Liz Warren too.","name":"elizabeth liz warren","Sentiment":0.19},{"date":"2019-08-24T19:01:51+00:00","tweet":"Why doesn't Elizabeth Warren go by Liz Warren? If Bill Clinton went by William Clinton, I wouldn't of voted for him. #Vote_Liz #NickNamesAreAwesome #IasWell","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-19T18:06:26+00:00","tweet":"Liz Warren Self-Own Complete Elizabeth Warren has deleted the infamous DNA video she made touting that she is 1\/1024th *maybe* Native American. Her \"Fact Squad\" page propping up the hysterical video has also been deleted entirely. \"Facts\" deleted. …","name":"elizabeth liz warren","Sentiment":-0.28},{"date":"2019-08-19T14:13:12+00:00","tweet":"DISGUSTING: After Lying About Her 1\/1024th Indian Heritage for Years – Liz Warren Hopes She Can Buy Off Indians for Their Vote Elizabeth Warren has made up elaborate stories over the years to bolster her claims that she is Native American. …","name":"elizabeth liz warren","Sentiment":-0.1666666667},{"date":"2019-08-16T06:55:11+00:00","tweet":"NY Times gives Liz Warren the Hillary Clinton treatment to undermine her candidacy: Many Democrats Love Elizabeth Warren. They Also Worry About Her.","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-08-16T04:47:33+00:00","tweet":"Elizabeth Warren. Jew hater. Here We Go... Democrat Liz Warren Defends Anti-Semites Ilhan Omar and Rashida Tlaib -- Trashes Israel … via @gatewaypundit","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-08-15T18:47:15+00:00","tweet":"Same as Bernie, Liz Warren is a bulldog. She don’t take shit from anybody, and neither does Bernie, which is exactly what Democrats need, someone to stick it to Lying DickTraitorTrump. Bernie Sanders and Elizabeth Warren would be a very strong ticket for The Democratic Party.","name":"elizabeth liz warren","Sentiment":0.1533333333},{"date":"2019-08-15T12:35:06+00:00","tweet":"Piss off. You're nothing more than an identity politics playing shill for Elizabeth Warren. She's not to Bernie's left. Liz Warren: Always votes to increase military budget Flip flops on M4A all the time Plans to take corporate PAC money in the general ...and more. …","name":"elizabeth liz warren","Sentiment":0.1583333333},{"date":"2019-08-14T00:56:31+00:00","tweet":"#time for @ewarren LIZ WARREN #fan #art! #fearless #leader Elizabeth #Warren is #adult that #America needs to right our #patriotic ship! #freedom means #Unity #healthcare #education #food #shelter for ALL #humans #americans! #usa #warren2020 #Persist #resist #stonersforwarren","name":"elizabeth liz warren","Sentiment":0.2732142857},{"date":"2019-08-11T09:00:30+00:00","tweet":"Liz Warren Tries to Save People by Keeping Them from Defending Themselves: Her Gun Control Plan is a Doozy … #Allow Media Exception #Congress #Crime #Democrats #elizabeth warren #elon musk #Featured Story #Front Page Stories #Gun #Mass Shootings #NRA","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2019-11-09T16:12:16+00:00","tweet":"Follow me for the Vetting of Elizabeth Warren... I will vet Liz Warren on RACIAL JUSTICE my GODDAMN self. People keep telling me that I'm not allowed to question Liz Warren on Racial Justice. People with BLUE CHECKS or MEDIA BADGES give her endless passes. Fuck that shit.","name":"elizabeth liz warren","Sentiment":-0.18125},{"date":"2019-11-08T22:48:59+00:00","tweet":"You say fate doesn't exist? Explain this Biden, Joe Liz Warren O'Rourke O'Tim Ryan Michael Bennet Bernie Sanders Elizabeth Warren (R) Tulsi Gabbard Gillibrand, Kirsten","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-11-06T09:02:03+00:00","tweet":"why do you support kamala harris over elizabeth warren? liz warren is at decent on a lot of the policies, but kamala is just so terrible on so many issues","name":"elizabeth liz warren","Sentiment":-0.1111111111},{"date":"2019-11-01T23:57:12+00:00","tweet":"This morning, Liz Warren's healthcare plan said 'When I was in middle school, my daddy...' and now it says 'When Elizabeth was in middle school, her father...' So while we've been thoughtfully critiquing the plan Warren 2020's been debating whether to write 'father' or 'daddy'","name":"elizabeth liz warren","Sentiment":0.1333333333},{"date":"2019-10-30T09:44:24+00:00","tweet":"LIZ WARREN: MASTER OF DISGUISE 1986: Elizabeth Warren switches identity to Cherokee 1996: Elizabeth Warren switches identity to Democrat 2019: Elizabeth Warren switches identity to Bernie Sanders","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-26T18:34:27+00:00","tweet":"DONALD TRUMP & JAN & PELOSI & IMPEACH IMPEACH #Elizabeth Warren... HAS LIZ WARREN EXPLAINED HOW SHE CAN PAY MEDICAID FOR ALL INCLUDING MILLIONS MILLIONS OF ILLEGALS IN THIS COUNTRY ALREADY...NO!! CANT BE DONE!!! WARREN IS ALL BULLSHTEIN FAKE! IMPEACH HER NOW IMPEACH","name":"elizabeth liz warren","Sentiment":-0.625},{"date":"2019-10-26T11:27:43+00:00","tweet":"Bernie Sanders is NOT a Democrat. But he's voted with Dems about 10 years longer then Elizabeth Warren who voted against Democratic ideals till she was 47. Liz Warren is not a Democrat","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-20T10:18:51+00:00","tweet":"AOC just endorsed Bernie Sanders. Compare that to the decision that Liz Warren made in 2016. Tells you pretty much what you need to know about Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":0.225},{"date":"2019-10-18T13:52:44+00:00","tweet":"“Houston is where Liz Warren became Elizabeth Warren.” “Forty-one years earlier, she had turned heads for looking so out of place. But this time... [s]he was Elizabeth Warren, the woman running for president.” …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-17T20:14:42+00:00","tweet":"Fox News calling Elizabeth Warren \"Liz Warren\" I've never heard her call herself \"Liz\" or called \"Liz\" before. Fox News still haven't talked about Mulvaney' speech admitting to the Ukraine aid being a quid pro quo or the testimony from Sondland. Dems better run ads on Fox channel","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-10-16T23:17:16+00:00","tweet":"@dailykos maybe next time, you should have \"Wanna see who we support? Elizabeth Warren Liz Warren Lizzie Warren Mrs. Warren Senator Warren Senator from MA MA Senator Elizabeth Warren\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T18:19:04+00:00","tweet":"This is good. \"The five years Warren spent in this sprawling Texas city were among the most transformative of her life...Houston is where Liz Warren became Elizabeth Warren.\" …","name":"elizabeth liz warren","Sentiment":0.3666666667},{"date":"2019-10-15T17:12:56+00:00","tweet":"This story is fascinating, gripping, informative. Be sure to read this @hollybdc profile of Elizabeth Warren at University of Houston --- the tale of when Liz Warren found her voice and became Elizabeth Warren. …","name":"elizabeth liz warren","Sentiment":0.5666666667},{"date":"2019-10-15T10:52:49+00:00","tweet":"Houston is where Liz Warren became Elizabeth Warren. Where she split with a husband who struggled with her ambition. And where she silently endured the sexual harassment by a powerful man who had been both a promoter and tormentor. Great read by @hollybdc …","name":"elizabeth liz warren","Sentiment":0.4},{"date":"2019-10-15T10:46:54+00:00","tweet":"\"She split with a husband who struggled with her ambition... she found her voice, developing the speaking style that has made the senator from Massachusetts a leading candidate for the Democratic presidential nomination. Houston is where Liz Warren became Elizabeth Warren.\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T09:32:32+00:00","tweet":"Houston is where Liz Warren became Elizabeth Warren — and where she faced jaw-dropping sexism and harassment. A deeply revealing piece by ⁦@hollybdc⁩ that you must read... …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T09:00:34+00:00","tweet":"“Houston is where Liz Warren became Elizabeth Warren” — terrific @hollybdc deep dive …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T08:28:55+00:00","tweet":"\"You knew, just by talking to her, she was going to be successful.\" She faced sexism, shed a husband and found her voice teaching law in Houston. This is where Liz Warren became Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":0.75},{"date":"2019-10-13T06:32:21+00:00","tweet":"THIS! Liz Warren is SPOT ON! Analysis | Elizabeth Warren’s Facebook ad proves the social media giant still has a politics problem …","name":"elizabeth liz warren","Sentiment":0.1111111111},{"date":"2019-10-12T20:18:59+00:00","tweet":"President Obama: \"Elizabeth is a politician like everybody else\" Liz Warren twitter:","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-11-09T21:58:55+00:00","tweet":"Corporate media: wow this Elizabeth Warren person, billionaires are so scared of her! Have heard about her? Liz Warren? Don't vote for her because the people you hate, billionaires, really hate her! Warren: …","name":"elizabeth liz warren","Sentiment":-0.41875},{"date":"2019-11-02T17:24:46+00:00","tweet":"Caton's ticket costs more that Elizabeth Warren's Medicare-For-All Plan. BTW is Liz Warren related to that Warren's Vendetta guy? #BreedersCup","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-10-31T21:05:39+00:00","tweet":"My makeshift Elizabeth Warren costume included: - blond wig from my Mary Berry costume - red jacket from lion-tamer costume - McGonagall half-moon glasses and if that aint actually the 3 parts of Liz Warren lolol","name":"elizabeth liz warren","Sentiment":0.2666666667},{"date":"2019-10-29T13:24:27+00:00","tweet":"Probably the same ones who thought that saying Elizabeth Warren topped a Marine until he passed out would have some sort of negative effect on Liz Warren. Or Marines.","name":"elizabeth liz warren","Sentiment":-0.15},{"date":"2019-10-26T11:11:54+00:00","tweet":"This needs to be said... Liz Warren is NOT Barack Obama If you're looking for a person who voted against the marginalized till she was 47, her name is Elizabeth Warren …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-25T12:27:59+00:00","tweet":"Elizabeth\/Liz\/Lizzie is such a powerful yt lady name. Like Queen Liz, Liz Warren, Lizzie McGuire??? I cant think of an Elizabeth that’s not a bad bitch","name":"elizabeth liz warren","Sentiment":0.2166666667},{"date":"2019-10-21T19:41:51+00:00","tweet":"Have White Women figured out that Elizabeth Warren is nothing like Hillary yet? Let's just talk about preparedness. All of Hillary's policy proposals were done before she announced. Liz Warren is using BERNIE'S policy & JUST STARTED working on how to pay for it last week.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-20T14:09:23+00:00","tweet":"This Agency Is Elizabeth Warren’s Brainchild. The Supreme Court Will Decide If It’s Constitutional LIZ #WARREN IS A #CROOK, #LIAR, #PHONY, IN EVERY WAY SHAPE AND FORM. SHE HAS #DUPED MANY PEOPLE — HOPEFULLY THIS WILL PUT HER IN JAIL - 🦹‍️ …","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-10-16T12:50:18+00:00","tweet":"Folks need to realize that Elizabeth Warren is a liberal college professor who fakes her way to the top. If she were to become president, she would release liberal hell on America; she is liberal college comes to town. Think college campuses are bad now, elect Liz Warren.","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-10-16T10:50:07+00:00","tweet":"… Thanks to my elected legislators for this: Sens. Ed Markey, and Elizabeth Warren! Why is Liz Warren's name spelled so wrong, eliabeth warren, you ask conspiratorily. Because PC operates in non-phonetic countries with different Spell Check's.","name":"elizabeth liz warren","Sentiment":-0.0833333333},{"date":"2019-10-16T01:18:37+00:00","tweet":"Elizabeth Warren lies about EVERYTHING..... Liz Warren Once Eulogized A Man By Accusing Him Of Sexual Harassment In Front Of His Children … via @dailycaller","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-10-15T11:10:19+00:00","tweet":"\"If Warren saw herself as a trailblazer for women in law, she has never acknowledged it.\" \"Warren was younger and less stuffy than the men on the faculty ... Warren also seemed human.\" \"Houston is where Liz Warren became Elizabeth Warren.\" …","name":"elizabeth liz warren","Sentiment":-0.0555555556},{"date":"2019-10-15T09:49:58+00:00","tweet":"“Houston is where Liz Warren became Elizabeth Warren.” …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T09:45:35+00:00","tweet":"This is a must-read from @hollybdc on how Liz Warren became Elizabeth Warren. …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T07:41:09+00:00","tweet":"Elizabeth Warren faced sexism, shed a husband and found her voice teaching law in Houston: In her five years at the University of Houston, Liz Warren became Elizabeth Warren. #25thAmendmentNow #ImpeachTrump #TheResistance","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-14T19:32:15+00:00","tweet":"Judge Jeanine dismisses Bernie Sanders' eyebrow-raising claim about Elizabeth Warren Bernie stated that Liz Warren is a true capitalist... About as much as she's a true Cherokee would be my humble response. …","name":"elizabeth liz warren","Sentiment":0.175},{"date":"2019-10-13T12:59:02+00:00","tweet":"Twice you question my education in one tweet. Do you think your racism reflects well upon Elizabeth Warren? Do you feel proud of your disgusting behavior? Is this she type of deplorable behavior we can expect from Liz Warren herself if we question her. Holly. That was TRASH","name":"elizabeth liz warren","Sentiment":-0.2666666667},{"date":"2019-10-12T18:20:02+00:00","tweet":"Rep. Lori Trahan (Elizabeth Warren supporter) talks 2020 Dem contenders and why she is supporting Liz Warren for President. #PoliticsNation","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-10-12T14:44:27+00:00","tweet":"my top five Democratic choices at the moment: 1. Elizabeth Warren 2. Liz Warren 3. Senator Warren 4. Mrs. Warren 5. El_z_b_th W_rr_n (i'd like to buy a vowel please)","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-10-12T13:52:52+00:00","tweet":"Liz Warren: I have a plan for that. She rolls out a watery version of Bernie's policy and the crowd goes mild. Donald Trump: Elizabeth Warren is a poopy head. And the crowd goes wild.","name":"elizabeth liz warren","Sentiment":0.2166666667},{"date":"2019-10-12T06:08:53+00:00","tweet":"True or not, the thought of Liz Warren naked just ruined my day ====> Ty Whelly, former Marine, says Elizabeth Warren paid him for sex: …","name":"elizabeth liz warren","Sentiment":0.1166666667},{"date":"2019-10-12T01:25:44+00:00","tweet":"LIZ WARREN WILL BE A TERRIBLE NOMINEE. Yes. If you don’t want to be made to care, you’ll want to vote against Elizabeth Warren …","name":"elizabeth liz warren","Sentiment":-1.0},{"date":"2019-10-08T23:12:26+00:00","tweet":"It is clear that Elizabeth Warren has a bad relationship with the truth. For most of her life. No one is worthy of becoming POTUS from the Demorat UnParty. #TRUMP2020Lanslide LYING LIZ! Warren Busted for Another Lie About Her Past | Ep 458 via @YouTube","name":"elizabeth liz warren","Sentiment":0.0909722222},{"date":"2019-10-08T07:40:20+00:00","tweet":"Media's smear of Liz Warren FAILS: JUST IN: New Details Support Elizabeth Warren's Account She Was Let Go From Teaching Job for Being Pregnant … via @mediaite","name":"elizabeth liz warren","Sentiment":-0.0101010101},{"date":"2019-10-04T16:15:05+00:00","tweet":"Is Elizabeth \"Liz\" Warren a \"cougar?\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-03T19:20:19+00:00","tweet":"Jacob Wohl: Elizabeth Warren was banging a 24-year-old dude guys!! America to Liz Warren:","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-03T16:20:10+00:00","tweet":"Well I’m sure I’m the only man to have had rough sex with Elizabeth “Liz” Warren and a Busty 20 something","name":"elizabeth liz warren","Sentiment":0.1333333333},{"date":"2019-10-03T16:12:56+00:00","tweet":"Thinking about that time I had sex with Elizabeth “Liz” Warren and a busy 20 something","name":"elizabeth liz warren","Sentiment":0.1},{"date":"2019-10-03T15:31:49+00:00","tweet":"Republicans are so scared of Elizabeth ‘Liz’ Warren, they had to pull out the big guns: Jacob Wohl and a lime green dildo. #Warren2020","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2019-10-03T14:03:17+00:00","tweet":"A sign that says, \"Elizabeth Warren: Cougar?\" This is confusing. Is this a breaking scandal or a Liz Warren campaign event?","name":"elizabeth liz warren","Sentiment":-0.3},{"date":"2019-10-03T07:49:42+00:00","tweet":"I predict a disappointed Marine when he finds out it is not Senator Elizabeth Warren, but Liz Warren, the headliner from the MILF Strip & Bar Lounge.","name":"elizabeth liz warren","Sentiment":-0.75},{"date":"2019-10-01T11:31:56+00:00","tweet":"Liz Warren’s full name is Elizabeth War On Rich White Men","name":"elizabeth liz warren","Sentiment":0.2416666667},{"date":"2019-09-26T09:19:18+00:00","tweet":"What These Kids Did with Elizabeth Warren's Lemonade Money is Hilarious. Family has announced that it intends to donate Liz Warren’s ten bucks to a pro-life organization! … via @PoliticsIsDirty","name":"elizabeth liz warren","Sentiment":0.25},{"date":"2019-09-23T19:18:08+00:00","tweet":"Elizabeth Warren, Socialist Part 2: Liz Warren and Progressive Democratics of America …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-23T19:17:28+00:00","tweet":"Elizabeth Warren, Socialist Part 1: Liz Warren and the Heather Booth\/Democratic Socialists of America Connection …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-22T19:44:15+00:00","tweet":"The Idea of having to listen to Liz Warren's voice much longer is making me dig...Her husband is a professor at Harvard.. where did this come from? How can she relate to middle class? A BEER.. She thinks we are stupid. Elizabeth Warren · Net worth $8 million USD","name":"elizabeth liz warren","Sentiment":-0.06},{"date":"2019-09-21T22:25:03+00:00","tweet":"Muting the name Liz, Warren, Elizabeth from my twitter. I'm sorry. I can't stand Pocahontas.","name":"elizabeth liz warren","Sentiment":-0.5},{"date":"2019-09-19T19:18:34+00:00","tweet":"Crowded in Liz Warren's head: NYC says she told whopper about crowd size! Elizabeth Warren’s campaign keeps inflating the crowd size! How ever many people Pocahontas says shows up to her Rallies, the real number is 1\/2 of what she says! … via @BIZPACReview","name":"elizabeth liz warren","Sentiment":0.375},{"date":"2019-09-16T06:43:57+00:00","tweet":"Elizabeth Warren Liz Warren Betsy Warren Lizzo Warren Lizabet “I have a plan for that” Warren …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-09-13T14:55:29+00:00","tweet":"Yes, we are ready for her! It’s past time we elect a woman for president & Elizabeth Warren is the best candidate that can take on traitor trump. She is totally qualified, and has the strong character, intellect & integrity we need! Liz Warren for President!","name":"elizabeth liz warren","Sentiment":0.4128472222},{"date":"2019-09-13T12:26:34+00:00","tweet":"Elizabeth Warren is Direct Descendant of 'Indian Fighter' Who Slaughtered Tribe - … Via - @NeonNettle #NeonNettle SNOW WHITE CHEROKEE LIZ WARREN'S GREAT ; X3 GRANDFATHER WAS INDIAN FIGHTER HE HELPED TO TAKE INDIAN PROPERTY SAME AS LIZ WARREN IS DOING NOW","name":"elizabeth liz warren","Sentiment":0.225},{"date":"2019-09-13T10:25:34+00:00","tweet":"Elizabeth Warren is long for Liz Warren, which actually is short for \"Lizerd-Person\" Warren","name":"elizabeth liz warren","Sentiment":-0.025},{"date":"2019-09-12T23:51:38+00:00","tweet":"Actually Elizabeth Warren is an opportunist who’s agreed to take big $ donations in the general election & already having regular phone calls w\/ Hillary Clinton. You don’t hear abt this bcuz the media, big corp, & Liz Warren are all working together against the people.","name":"elizabeth liz warren","Sentiment":0.01},{"date":"2019-09-12T09:33:41+00:00","tweet":"#AffirmativeAction Perks Hypocrisy Files: Free College Liz Warren, Faux Native American Affirmative Action Fraudster & Privileged Liberal Socialist 1\/8\/15: Elizabeth Warren is worth millions #HypocrisyFiles #c2cHarvard #FraudTec …","name":"elizabeth liz warren","Sentiment":0.28},{"date":"2019-09-12T07:10:13+00:00","tweet":"Elizabeth Warren since the beginning: I would like to tax the rich The media, just now: BREAKING!! SNEAKY Liz Warren wants to TAX the RICH right under our NOSES!","name":"elizabeth liz warren","Sentiment":0.3795200893},{"date":"2019-09-12T06:51:52+00:00","tweet":"\"But all eyes will be -- and should be -- on only two: Joe Biden and Elizabeth Warren.\" Uhh you're forgetting someone. \"Warren is outsider, swing-for-the-fences and idealistic\" How the hell is Liz Warren an outsider? And she definitely wasn't \"swinging for the fences\" in 2016","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-12-06T07:11:16+00:00","tweet":"I, RINO @repgeoffdiehl was quietly working with Elizabeth Warren as her controlled-opposition puppet. So basically if you voted for #DirtyDiehl then you were essentially supporting Liz Warren.","name":"elizabeth liz warren","Sentiment":0.125},{"date":"2019-12-05T18:58:13+00:00","tweet":"Authoritarians of a feather flock together. Voters who approve of Bernie Sanders and Elizabeth Warren are more likely to support speech bans and jail time for those whose speech is \"offensive.\" …","name":"elizabeth liz warren","Sentiment":0.1333333333},{"date":"2019-12-05T15:44:19+00:00","tweet":"I want Sen Elizabeth Warren to be my president; to be OUR president. Because she's better than me. A president should be better than I am on my best day. That's Liz Warren. ️","name":"elizabeth liz warren","Sentiment":0.6666666667},{"date":"2019-12-05T08:55:00+00:00","tweet":"This poll helps illustrate just how un-American this authoritarian streak really is. Fans of Elizabeth Warren and Bernie Sanders don't just want socialized medicine — they want government in the business of policing speech. … #Election2020 via @pjmedia_com","name":"elizabeth liz warren","Sentiment":0.2},{"date":"2019-12-05T08:53:53+00:00","tweet":"Fans of America-haters Communist Bernie Sanders and Habitual Liar & Nutcase Elizabeth Warren Want Speech Bans With Jail Time #FreeSpeech #Bernie2020 #Warren2020 #WakeUpAmerica #WalkAway #DemocratsAreDangerous #Democrats2020 #LiberalismIsAMentalDisorder …","name":"elizabeth liz warren","Sentiment":-0.1},{"date":"2019-12-04T13:32:23+00:00","tweet":"“Bernie is also considered electable due to his experience, and he is not as left on the political spectrum as Elizabeth Warren” good read but Bernie is considered far more left than Liz Warren on the political spectrum!","name":"elizabeth liz warren","Sentiment":0.146875},{"date":"2019-12-04T01:53:28+00:00","tweet":"Warren talks about abolish electoral college, because socialists, like Liz Warren, hate US Constitution & want to get rid of our constitutional system entirely. That is also the reason why socialists will never be POTUS! #Trump2020LandSlide …","name":"elizabeth liz warren","Sentiment":-0.4},{"date":"2019-12-03T20:02:08+00:00","tweet":"Elizabeth Warren Has A Plan For Your Health Care, Whether You Like It Or Not …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-12-03T14:27:01+00:00","tweet":"\"Bless your heart, Lyin’ Liz Warren\" — We're back with a NEW video …","name":"elizabeth liz warren","Sentiment":0.0681818182},{"date":"2019-12-03T00:56:30+00:00","tweet":"Liz Warren's Medicare for All calculator is a fraud. There's no income question. It's just a data miner. It captures your location and e-mail and probably how you get your health insurance. It doesn't calculate a blessed thing. #SmokeAndMirrors …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-12-01T23:30:40+00:00","tweet":"For anybody who thought Warren actually had a snowball's chance in hell of being #46, she doesn't. Little Liz Warren, you simply ain't got it in ya, kid. …","name":"elizabeth liz warren","Sentiment":-0.0625},{"date":"2019-12-01T03:54:35+00:00","tweet":"Democratic Presidential candidate Elizabeth Warren released a plan this month for producing renewable energy on public lands that in certain important ways is more dangerous than anything the Tr*mp administration dares to propose. … @canislatrans","name":"elizabeth liz warren","Sentiment":0.1028571429},{"date":"2019-11-30T22:57:08+00:00","tweet":"Elizabeth Warren's plan for public lands manages to be even more destructive than Trump's, writes @canislatrans …","name":"elizabeth liz warren","Sentiment":-0.0333333333},{"date":"2019-11-29T14:12:53+00:00","tweet":"The 2020 Campaign: Elizabeth Warren: Who Loves Ya, Baby? - New Hampshire to Liz Warren: Meh (PJ Media) …","name":"elizabeth liz warren","Sentiment":0.1363636364},{"date":"2019-11-29T13:03:41+00:00","tweet":"MML Ep. 12 is now live! Colt bodyslams Elizabeth Warren's half-baked, hair-brained \"plans\" for govt. intervention in every area of life. …","name":"elizabeth liz warren","Sentiment":0.1704545455},{"date":"2019-11-29T04:32:13+00:00","tweet":"Liberals: There is no difference between Bernie Sanders and Elizabeth Warren. You are sexist if you support Bernie. *Liz Warren collapses in the polls after her healthcare plan turns out to be fraud* Liberals: Elizabeth Warren is tanking in the polls because M4A is unpopular.","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-11-27T19:42:58+00:00","tweet":"Sen. Liz Warren joins with Zuckerberg, Bill Gates, Bloomberg, Tim Cook & various investors to endorse the India-backed OPT visa-worker program. This 'mini-H-1B' pushes 100Ks of American graduates out of good jobs - and spikes stock values.","name":"elizabeth liz warren","Sentiment":0.2333333333},{"date":"2019-11-27T18:54:32+00:00","tweet":"Liz Warren is a wonderful presidential candidate. \"#ElizabethWarren Wants to Revoke Medals of Honor for #WoundedKnee Massacre\"","name":"elizabeth liz warren","Sentiment":0.6},{"date":"2019-11-27T16:15:29+00:00","tweet":"Today in \"Lessons in how NOT to build a coalition to beat Trump,\" we have Liz Warren. … #Yang2020 #YangGang","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-11-27T08:40:58+00:00","tweet":"Sometimes it’s best to walk away from a debate. Elizabeth Warren probably wishes she would have followed that sage advice. But now she is caught in a big education-policy dilemma. And a lie. Liz Warren’s latest lie only deepens her dilemma on education …","name":"elizabeth liz warren","Sentiment":0.375},{"date":"2019-12-04T03:13:31+00:00","tweet":"\"Elizabeth Warren Has A Plan For Your Health Care, Whether You Like It Or Not\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-12-03T17:03:52+00:00","tweet":"remember when liz warren got pissy at amy goodman for asking this same question …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-12-02T22:36:16+00:00","tweet":"Gee....I simply cannot believe anything Elizabeth....er... I mean Betsy....er...I mean Liz Warren has to say. Does her family really call her Betsy? 🤔","name":"elizabeth liz warren","Sentiment":-0.10625},{"date":"2019-12-02T21:18:41+00:00","tweet":"No one, not Liz Warren, is ever, never ever, going to disband private insurance companies. Never, not ever. The fact that she's lying about it, or is as stupid as a box of rocks, is all we need to know. What is happening with Elizabeth Warren? …","name":"elizabeth liz warren","Sentiment":-0.4},{"date":"2019-12-02T10:09:27+00:00","tweet":"I'm Going To Leave This Here With You Friends=Kevin Ryan Has Written An Excellent Article On \"A Day\/Rally In Life Of Liz Warren\" (Paraphrasing) Very Real Very Telling-You Decide=MyView= Ryan: Elizabeth Warren does the Wing Ding …","name":"elizabeth liz warren","Sentiment":0.65},{"date":"2019-12-02T02:52:51+00:00","tweet":"the queen must die before liz warren can achieve her full form for there can only be one true elizabeth at a time","name":"elizabeth liz warren","Sentiment":0.2333333333},{"date":"2019-11-30T19:01:02+00:00","tweet":"Fake Pocahontas Liz Warren lies that her children did not attend private schools. Now She’s busted even by Leftist Media. @ewarren @SenWarren #Trump2020LandslideVictory #Warren2020 #ElizabethWarren …","name":"elizabeth liz warren","Sentiment":-0.1833333333},{"date":"2019-11-30T12:42:11+00:00","tweet":"Fake Indian Liz Warren is going to get you one way or another; either block you from earning money or if you do she'll take it away from you to pay for one of her buy the votes social programs! …","name":"elizabeth liz warren","Sentiment":-0.2291666667},{"date":"2019-11-30T09:55:06+00:00","tweet":"Liz Warren steals and recycles Barack Obama’s ‘You didn’t build that’ line. That’s the thing about Socialists like Elizabeth Warren(D). They have to take everything from others. That’s what Socialists do. They take from you. #copolitics …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-11-30T07:33:04+00:00","tweet":"Loyal readers of the NYT rallied to skew a poll in favor of Liz Warren. It's not complicated. And not honest. They will use this to misinform the world the majority of Americans want to tax-ravage the wealthy. Socialism ala news media. …","name":"elizabeth liz warren","Sentiment":0.1958333333},{"date":"2019-11-28T15:52:44+00:00","tweet":"Will you ask Elizabeth Warren about her latest lie caught on video? …","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-11-27T19:42:43+00:00","tweet":"I'll reduce rental costs by 10% over the next ten years.* –Liz Warren *unless you live in Gaza in which case I'll also blow up your house.","name":"elizabeth liz warren","Sentiment":0.0454545455},{"date":"2019-11-09T16:12:16+00:00","tweet":"Follow me for the Vetting of Elizabeth Warren... I will vet Liz Warren on RACIAL JUSTICE my GODDAMN self. People keep telling me that I'm not allowed to question Liz Warren on Racial Justice. People with BLUE CHECKS or MEDIA BADGES give her endless passes. Fuck that shit.","name":"elizabeth liz warren","Sentiment":-0.18125},{"date":"2019-11-08T22:48:59+00:00","tweet":"You say fate doesn't exist? Explain this Biden, Joe Liz Warren O'Rourke O'Tim Ryan Michael Bennet Bernie Sanders Elizabeth Warren (R) Tulsi Gabbard Gillibrand, Kirsten","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-11-06T09:02:03+00:00","tweet":"why do you support kamala harris over elizabeth warren? liz warren is at decent on a lot of the policies, but kamala is just so terrible on so many issues","name":"elizabeth liz warren","Sentiment":-0.1111111111},{"date":"2019-11-01T23:57:12+00:00","tweet":"This morning, Liz Warren's healthcare plan said 'When I was in middle school, my daddy...' and now it says 'When Elizabeth was in middle school, her father...' So while we've been thoughtfully critiquing the plan Warren 2020's been debating whether to write 'father' or 'daddy'","name":"elizabeth liz warren","Sentiment":0.1333333333},{"date":"2019-10-30T09:44:24+00:00","tweet":"LIZ WARREN: MASTER OF DISGUISE 1986: Elizabeth Warren switches identity to Cherokee 1996: Elizabeth Warren switches identity to Democrat 2019: Elizabeth Warren switches identity to Bernie Sanders","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-26T18:34:27+00:00","tweet":"DONALD TRUMP & JAN & PELOSI & IMPEACH IMPEACH #Elizabeth Warren... HAS LIZ WARREN EXPLAINED HOW SHE CAN PAY MEDICAID FOR ALL INCLUDING MILLIONS MILLIONS OF ILLEGALS IN THIS COUNTRY ALREADY...NO!! CANT BE DONE!!! WARREN IS ALL BULLSHTEIN FAKE! IMPEACH HER NOW IMPEACH","name":"elizabeth liz warren","Sentiment":-0.625},{"date":"2019-10-26T11:27:43+00:00","tweet":"Bernie Sanders is NOT a Democrat. But he's voted with Dems about 10 years longer then Elizabeth Warren who voted against Democratic ideals till she was 47. Liz Warren is not a Democrat","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-20T10:18:51+00:00","tweet":"AOC just endorsed Bernie Sanders. Compare that to the decision that Liz Warren made in 2016. Tells you pretty much what you need to know about Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":0.225},{"date":"2019-10-18T13:52:44+00:00","tweet":"“Houston is where Liz Warren became Elizabeth Warren.” “Forty-one years earlier, she had turned heads for looking so out of place. But this time... [s]he was Elizabeth Warren, the woman running for president.” …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-17T20:14:42+00:00","tweet":"Fox News calling Elizabeth Warren \"Liz Warren\" I've never heard her call herself \"Liz\" or called \"Liz\" before. Fox News still haven't talked about Mulvaney' speech admitting to the Ukraine aid being a quid pro quo or the testimony from Sondland. Dems better run ads on Fox channel","name":"elizabeth liz warren","Sentiment":0.5},{"date":"2019-10-16T23:17:16+00:00","tweet":"@dailykos maybe next time, you should have \"Wanna see who we support? Elizabeth Warren Liz Warren Lizzie Warren Mrs. Warren Senator Warren Senator from MA MA Senator Elizabeth Warren\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T18:19:04+00:00","tweet":"This is good. \"The five years Warren spent in this sprawling Texas city were among the most transformative of her life...Houston is where Liz Warren became Elizabeth Warren.\" …","name":"elizabeth liz warren","Sentiment":0.3666666667},{"date":"2019-10-15T17:12:56+00:00","tweet":"This story is fascinating, gripping, informative. Be sure to read this @hollybdc profile of Elizabeth Warren at University of Houston --- the tale of when Liz Warren found her voice and became Elizabeth Warren. …","name":"elizabeth liz warren","Sentiment":0.5666666667},{"date":"2019-10-15T10:52:49+00:00","tweet":"Houston is where Liz Warren became Elizabeth Warren. Where she split with a husband who struggled with her ambition. And where she silently endured the sexual harassment by a powerful man who had been both a promoter and tormentor. Great read by @hollybdc …","name":"elizabeth liz warren","Sentiment":0.4},{"date":"2019-10-15T10:46:54+00:00","tweet":"\"She split with a husband who struggled with her ambition... she found her voice, developing the speaking style that has made the senator from Massachusetts a leading candidate for the Democratic presidential nomination. Houston is where Liz Warren became Elizabeth Warren.\"","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T09:32:32+00:00","tweet":"Houston is where Liz Warren became Elizabeth Warren — and where she faced jaw-dropping sexism and harassment. A deeply revealing piece by ⁦@hollybdc⁩ that you must read... …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T09:00:34+00:00","tweet":"“Houston is where Liz Warren became Elizabeth Warren” — terrific @hollybdc deep dive …","name":"elizabeth liz warren","Sentiment":0.0},{"date":"2019-10-15T08:28:55+00:00","tweet":"\"You knew, just by talking to her, she was going to be successful.\" She faced sexism, shed a husband and found her voice teaching law in Houston. This is where Liz Warren became Elizabeth Warren.","name":"elizabeth liz warren","Sentiment":0.75},{"date":"2019-10-13T06:32:21+00:00","tweet":"THIS! Liz Warren is SPOT ON! Analysis | Elizabeth Warren’s Facebook ad proves the social media giant still has a politics problem …","name":"elizabeth liz warren","Sentiment":0.1111111111}]