{"0":{"date":"2019-12-05 19:52:24","tweet":"I saw the Missing Persons in California at Glen Helen Park. 800,000 people showed up for the US Festival. Ozzy, David Bowie, Joe Walsh, Stevie Nicks, 27 bands in all.","Sentiment":-0.2},"1":{"date":"2019-12-05 19:50:29","tweet":"I wish I could get on stage and jam with my uncle @JoeWalsh","Sentiment":0.0},"2":{"date":"2019-12-05 19:15:23","tweet":"Joe Walsh - Life's Been Good via @YouTube","Sentiment":0.7},"3":{"date":"2019-12-05 19:12:04","tweet":"Joe Walsh - In the City - via @YouTube","Sentiment":0.0},"4":{"date":"2019-12-05 19:10:43","tweet":"Joe Walsh\/James Gang opened for 3 Dog Night, Yale Bowl, 1971.","Sentiment":0.0},"5":{"date":"2019-12-05 18:54:17","tweet":"Joe Walsh wants to be President. However, I am not sure I understand the campaign strategy being used by Joe Walsh (@WalshFreedom) who states here: 1. @seanhannity is an idiot; 2. If I was in Congress I would vote to impeach Trump; Oh well.","Sentiment":-0.2833333333},"6":{"date":"2019-12-05 18:54:09","tweet":"Trump's \"I'll get Mexico to pay for the wall\" is about as cogent as his economics get, and that's sad because it's (guitarist) Joe Walsh \"I live in hotels, tear out the walls. I have accountants pay for it all\" But Trump was sober. Trump's an idiot. Joe Walsh is a musical genius","Sentiment":-0.2127272727},"7":{"date":"2019-12-05 18:50:53","tweet":"Karlen has a worse case of DTS the @WalshFreedom , Joe Walsh.","Sentiment":-0.4},"8":{"date":"2019-12-05 18:45:11","tweet":"Joe Walsh has an awakening","Sentiment":0.0},"9":{"date":"2019-12-05 18:37:05","tweet":"Great song! If you like that one, you HAVE to check out these classics: 1) Long Train Runnin’- The Doobie Brothers 2) The Joker- Steve Miller Band 3) Life’s Been Good- Joe Walsh 4) Who Let The Dogs Out- Baha Men 5) Ventura Highway- America 6) Saturday In The Park- Chicago","Sentiment":0.55},"10":{"date":"2019-12-05 18:30:09","tweet":"Republican presidential candidate Joe Walsh vowed that he will campaign hard in Iowa as he aims to give Republicans an alternative to President Donald Trump. …","Sentiment":-0.2916666667},"11":{"date":"2019-12-05 18:14:03","tweet":"Whiney Joe Walsh - You owe your children $120,000 in back child support.... Be sure and tell us about that last behavior","Sentiment":0.1666666667},"12":{"date":"2019-12-05 17:47:30","tweet":"About ten years ago, I saw him eating with a group of people at the Hometown Buffet in Fresno.","Sentiment":0.0},"13":{"date":"2019-12-05 17:41:16","tweet":"CONGRATULATIONS to Congressman Joe Walsh @WalshFreedom who moved up two ranks in one week by his social media influencing as measured and displayed by this week’s “Prez Power 100” Leaderboard.","Sentiment":0.0333333333},"14":{"date":"2019-12-05 17:33:31","tweet":"Isnt this the exact same tweet you sent to Joe Walsh yesterday?","Sentiment":0.125},"15":{"date":"2019-12-05 17:06:40","tweet":"I saw Mr. Mister open for Tina Turner, and they were good. I saw John Cougar open for Heart right as Jack & Dianne was peaking. He definitely was better than them. Eddie Money opening for April Wine. Joe Walsh opening for Stevie Nicks. Living Colour for the Stones, Great! …","Sentiment":0.3551020408},"16":{"date":"2019-12-05 17:06:37","tweet":"Joe Walsh opened for Tom Petty and the Heartbreakers in Oklahoma City back in April 2017, and his 10-song set included \"Take It to the Limit,\" \"In the City,\" and \"Life's Been Good.\" \"Amazing\" feels like an understatement. …","Sentiment":0.4333333333},"17":{"date":"2019-12-05 16:55:44","tweet":"I have one love it works fine!!!! I’ve been blessed with the collection of cassette tapes in better than just good looking they work great!! Just dec. one I played Joe Walsh and the James Gang. Funk Forty Nine so Sweet 🥰🤠","Sentiment":0.675},"18":{"date":"2019-12-05 16:46:08","tweet":"Congrats to @JoeWalsh and the Eagles for being my Top Artist on Spotify for the third straight year. Looking for another productive year out of them in 2020 #spotifywrapped","Sentiment":0.2333333333},"19":{"date":"2019-12-05 16:30:32","tweet":"‘Life’s Been Good to Me So Far’ by Joe Walsh \/ ‘Devil’s In My Car’ by The B52s. They alternate.","Sentiment":0.2666666667}}