{"0":{"date":"2019-12-05 19:59:59","tweet":"@JohnDelaney yknow, the internet might hate you, but I've come to realize you're actually a genuinely cool guy. I might be #Yang Gang, but I can recognize when someone is going against the odds this hard to do what he believes is right","Sentiment":-0.1139880952},"1":{"date":"2019-12-05 19:58:47","tweet":"I have just received confirmation that John Delaney is still running for president","Sentiment":0.0},"2":{"date":"2019-12-05 19:58:16","tweet":"Delaney Redemption Arc POGGIES","Sentiment":0.0},"3":{"date":"2019-12-05 19:56:09","tweet":"Is this a fake Delaney account or did you finally come around to the light?","Sentiment":-0.0333333333},"4":{"date":"2019-12-05 19:55:52","tweet":"Why do @JoeBiden and @JohnDelaney keep talking about push-ups and pull-ups... #SenilityWars","Sentiment":0.0},"5":{"date":"2019-12-05 19:55:38","tweet":"Drop out","Sentiment":0.0},"6":{"date":"2019-12-05 19:54:50","tweet":"that man? John Delaney","Sentiment":0.0},"7":{"date":"2019-12-05 19:53:50","tweet":"It is not free, even to the insured. What you mean is that the price paid should be linked not to coverage, morbidity risk and health but to income. To people will get the same thing and have wildly different pricing. Like airline seats.","Sentiment":-0.128125},"8":{"date":"2019-12-05 19:52:22","tweet":"Wow people really hate a president who has put his own nation before others. Very bizarre.","Sentiment":0.105},"9":{"date":"2019-12-05 19:51:56","tweet":"Someone steal your twitter account???","Sentiment":0.0},"10":{"date":"2019-12-05 19:51:52","tweet":"You nailed it. Biden isn't being ambitious at all. Obamacare failed and he cant accept it","Sentiment":-0.125},"11":{"date":"2019-12-05 19:46:17","tweet":"I hate this argument from the right, and I’m on the right. Everyone is supposed to be allowed to speak their opinion! I vehemently disagree with you on virtually everything. I will never try to silence you or say you shouldn’t speak out. The most accepted positions will win out.","Sentiment":0.2285714286},"12":{"date":"2019-12-05 19:44:33","tweet":"Uh okay, lol. Didn't expect that!","Sentiment":0.75},"13":{"date":"2019-12-05 19:43:46","tweet":"Wow this is John Delaney erasure","Sentiment":0.1},"14":{"date":"2019-12-05 19:42:55","tweet":"@PeteButtigieg @amyklobuchar @JoeBiden how does it feel to be way to the right of @JohnDelaney on this u corporitist hacks? …","Sentiment":0.2857142857},"15":{"date":"2019-12-05 19:40:22","tweet":"I wanna say there’s an amendment in the constitution that protects religious liberties as long as it doesn’t infringe on another’s liberties. Maybe I’m wrong I dunno.","Sentiment":-0.1833333333},"16":{"date":"2019-12-05 19:37:09","tweet":"this is cool as hell John","Sentiment":0.35},"17":{"date":"2019-12-05 19:35:16","tweet":"you look like the sloth from ice age","Sentiment":0.0},"18":{"date":"2019-12-05 19:34:52","tweet":"This is an outrage! Because of this people (insert wildly hyperbolic statement here).","Sentiment":0.1},"19":{"date":"2019-12-05 19:34:44","tweet":"As far as weaker I'm not completely sure, but I don't think he can beat Trump I still think @JohnDelaney has the best chance in a general election head-to-head against Trump","Sentiment":0.225}}