{"0":{"date":"2019-12-05 19:16:38","tweet":"Wow! I'm sure you must think Trump is a wonderful Christian. You don't know who has the strength or will to be a good Catholic. Vice President Biden is in good standing at his parish St. Joseph's of the Brandywine and the church. Your comment was repulsive.","Sentiment":0.4321428571},"1":{"date":"2019-12-05 18:55:27","tweet":"Gee, and @TheDemocrats thrash @POTUS for less than this all day every day. Way to go @JoeBiden ! THANK YOU FOR LETTING AMERICA SEE WHO YOU REALLY ARE! \"Black Kids & Cockroaches & the hair on your legs\". Jesus Joseph & Mary, You Creepy maniacal Pedophile! …","Sentiment":-0.1875},"2":{"date":"2019-12-05 18:53:34","tweet":"Do you even remember what day it is, Joseph, I’ll bet you don’t . Weak people often mock the strong behind their backs due to their insecurities!!!","Sentiment":-0.1464518229},"3":{"date":"2019-12-05 18:18:53","tweet":"\"[Biden] added, the author [of Burn Pits: the Poisoning of America's Soldiers, Joseph Hickman] \"went back and looked at Beau's tenure as a civilian with the U.S. attorney's office... And he was co-located in both times near these burn pits.\" …","Sentiment":0.05},"4":{"date":"2019-12-05 18:04:24","tweet":"Even though we have our differences, you do deserve the Medal of Honor for investigating that sick freak Joe Biden. God bless you and your family. Joseph Biase","Sentiment":-0.7142857143},"5":{"date":"2019-12-05 17:45:39","tweet":"Same goes to you, handsy uncle Joseph. You babble on about random shit every time a camera is on you. Cornpop is a bad dude and you learned about roaches? Kids touch your leg? You're not a kind old grandpa. Drop out.","Sentiment":-0.2666666667},"6":{"date":"2019-12-05 16:46:26","tweet":"He shouted out the Joseph R Biden school of public policy and administration in my own turf yesterday :,) reminded me of you!","Sentiment":0.375},"7":{"date":"2019-12-05 15:55:23","tweet":"Nice bit of projection there Joseph... Put your own house in order.","Sentiment":0.6},"8":{"date":"2019-12-05 15:37:15","tweet":"One Joseph P Biden is the catalyst for that arrangement. There’s absolutely ZERO reason for them to be interested in Hunter otherwise. Voters see thru this!","Sentiment":0.25625},"9":{"date":"2019-12-05 15:22:20","tweet":"Concerned voters are calling for all corrupt politicians to be removed. Democrat and Republican, that most definitely includes Donald J Trump, as well as Joseph P Biden!","Sentiment":0.0},"10":{"date":"2019-12-05 15:13:26","tweet":"Sen. Joseph Biden of Delaware, whose campaign for president has been damaged by admissions of plagiarism and embellishing his academic record, withdrew from the race for the 1988 Democratic nomination, saying the “exaggerated shadow” of his mistakes had begun “to obscure the","Sentiment":-0.25},"11":{"date":"2019-12-05 14:48:21","tweet":"A nice FAT tax hike on the rich, right, Joseph?","Sentiment":0.4202380952},"12":{"date":"2019-12-05 14:36:56","tweet":"Everyone is laughing at you Joseph","Sentiment":0.0},"13":{"date":"2019-12-05 14:24:30","tweet":"Hey Joseph Joey Joey Sleepy Creepy Crazy Uncle @JoeBiden Calling voters \"#damnliars\" is NOT the way into hearts and into the highest public office. Everybody knows you and your son #HunterBiden are corrupt and sell the office. Go away.","Sentiment":-0.4},"14":{"date":"2019-12-05 14:03:49","tweet":"In April 2019, as Rudy Giuliani and a number of his associates looked for #Dirt on President Donald Trump’s political opponents in #Ukraine, two of t ... #Rudy_Giuliani #Joe_Biden #Hunter_Biden #Donald_J_Trump #Members_Only #Pay_Dirt #Joseph_DiGenova …","Sentiment":0.0},"15":{"date":"2019-12-05 13:29:13","tweet":"Don't worry Joseph, he WILL have 4 more years and you won't even be your party's nominee #LegHairs","Sentiment":0.5},"16":{"date":"2019-12-05 13:09:24","tweet":"I’m pretty sure the world is laughing at you sir! Btw Joseph, thank you for all the priceless memes Mr. Quid pro quo","Sentiment":0.625},"17":{"date":"2019-12-05 12:36:26","tweet":"Go sniff somebody, Joseph.","Sentiment":0.0},"18":{"date":"2019-12-05 11:37:16","tweet":"Oh Joseph. I totally don't think you should have run. I support the women in it. CA over here, so I'm still Harris (don't be quitters). If not Harris, then Klobuchar and Warren. But if you get it, I'll vote for ya. Goddammit. Sigh.","Sentiment":0.0},"19":{"date":"2019-12-05 11:06:54","tweet":"To the Liberal community. If you’re going to run with your “Orange Man A Joke” narrative, you really should not use Joseph there. Between sniffing hair & letting children rub his hairy legs & loving it when they sit on his lap, your message itself is a joke.","Sentiment":0.4}}