[{"date":"2019-01-31T19:07:53+00:00","tweet":"idk apparently a lot of women think so after the netflix series!! but i also think charles manson was good looking and i’ve seen pics of john mccain, joe biden & joseph stalin that i thought were hot. i think he’s just ugly to me lol","name":"joseph joe biden","Sentiment":0.225625},{"date":"2019-01-26T23:10:08+00:00","tweet":"Tough one. I know he’s getting up there in age. Joe Biden for President. VP would be Joseph Kennedy.","name":"joseph joe biden","Sentiment":-0.3888888889},{"date":"2019-01-24T20:45:49+00:00","tweet":"Joe Biden Defends Praise for Embattled Republican During Midterms - … - Joseph R. Biden Jr. defended his decision to praise an embattled Republican lawmaker during a paid speech in Michigan last fall, telling a group of mayors on Thursday morning that i...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-24T10:45:33+00:00","tweet":"Joe Biden’s Paid Speech Buoyed the G.O.P. in Midwest Battleground - … - Joseph R. Biden Jr. swept into Benton Harbor, Mich., three weeks before the November elections, in the midst of his quest to reclaim the Midwest for Democrats. He took the stage at ...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-24T08:01:10+00:00","tweet":"Joe Biden’s Paid Speech Buoyed the G.O.P. in Midwest Battleground Joseph R. Biden Jr. spoke to a Republican-leaning audience at an Economic Club of Southwestern Michigan event three weeks before the... …","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-01-22T18:16:41+00:00","tweet":"So I'm not the only person who's already voted for this? @NobelPrize I mentioned this many months ago. Our guy is the guy for this. St. Joseph. @chefjoseandres cc: @BarackObama @MichelleObama @HillaryClinton @JoeBiden …","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-01-22T17:29:16+00:00","tweet":"@JoeBiden keep it up... follow in your brothers footsteps Paul Joseph Goebbels... keep spinning the same old story to agitate and divide... more than shameful it’s disgusting!","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-01-21T15:20:53+00:00","tweet":"Former Vice President Joseph R. @JoeBiden said during a speech honoring Martin Luther King Jr. that Donald Trump’s presidency has brought people “out from under the rocks” and “legitimized” hate. Really??? Look at you calling me \"Dregs of society\" Take your son out of cocaine","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-01-21T14:06:10+00:00","tweet":"@JoeBiden Joseph... what are you doing, my guy?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-16T16:42:24+00:00","tweet":"And why we need someone experienced to take on Trump like @JoeBiden #BidenHarris2020","name":"joseph joe biden","Sentiment":0.8},{"date":"2019-01-16T01:00:23+00:00","tweet":"Mr. Andrew Mark Cuomo presidential candidate and Joseph Robinette \"Joe\" Biden, Jr. vice-president DEMOCRATIC PARTY. ** 2020 - 2024 **","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-14T20:39:41+00:00","tweet":"Kamala Harris Joseph Kennedy III Joe Biden Cory Booker Beto O'Rourke …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-12T18:19:14+00:00","tweet":"You mean using the Biden Rule 1992 (Joe Biden, a Democrat)? \"Vice President Joseph R. Biden Jr. argued that President George Bush should delay filling a Supreme Court vacancy, should one arise, until the presidential election was over\". …","name":"joseph joe biden","Sentiment":-0.3125},{"date":"2019-01-08T07:02:43+00:00","tweet":"Breaking, Ted Cruz’s real name is Rafael. Joe Biden’s name is Joseph. Bernie Sander’s name is Bernard. Bill Clinton’s name is William. Beto’s real name is Robert.","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-01-07T14:19:50+00:00","tweet":"Rafael “Ted” Cruz, Edward “Ted” Kennedy, John “Jack” Kennedy, William “Bill” DeBlasio, Robert “Beto” O’Rourke, Joseph “Joe” Biden, Nimrata “Nikki” Haley, “Abraham “Abe” Lincoln, Willard “Mitt” Romney, Jefferson “Jeff” Sessions, Bernard “Bernie” Sanders, etc., etc., etc. 🤷‍️","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-07T12:56:32+00:00","tweet":"Nitpicking, yes, but also very revealing nitpicking. I don't remember anyone giving a rat's behind that Joe Biden doesn't go by Joseph.","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-01-07T09:11:34+00:00","tweet":"Breaking: Jeb Bush's real name is John. Joe Biden is really Joseph. And Bill Clinton is WILLIAM!!! When will the lies and deception to the Ametican people end????? …","name":"joseph joe biden","Sentiment":0.2953125},{"date":"2019-01-07T08:55:21+00:00","tweet":"Look! His name is Bernard! BERNARD!! Since 1941. How have these lies been allowed to continue? Did you know Joe Biden’s real name is Joseph! Joseph!? #fakenamenews …","name":"joseph joe biden","Sentiment":0.3125},{"date":"2019-01-04T17:01:57+00:00","tweet":"Would you please quit with your personal attacks on Joseph Biden, David!!!!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-12T10:06:25+00:00","tweet":"Vice President Joseph Biden is absolutely correct.","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-01-07T09:49:41+00:00","tweet":"@JoeBiden Our next president should be Joseph Biden in 2020.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-01-05T14:42:52+00:00","tweet":"What about Joseph Kennedy III? I LOVE that guy! 2024?","name":"joseph joe biden","Sentiment":0.625},{"date":"2019-01-01T20:55:43+00:00","tweet":"I would like to see Joe Squared for 2020, Joe Biden and Joseph Kennedy III. Either way. Combine the youth, passion and brains with the experience, savvy, and cool headedness. Plus I think of the meme possibilities!","name":"joseph joe biden","Sentiment":0.4375},{"date":"2019-01-01T12:40:10+00:00","tweet":"NY Times style guide silliness: first mention “Joseph R. Biden Jr.” … Does any reader not know “Joe Biden” #journalism","name":"joseph joe biden","Sentiment":0.25},{"date":"2018-12-30T15:17:38+00:00","tweet":"The lack of any requirement to disclose the beneficial (i.e. “true”) ownership of limited liability companies (LLCs) makes it easy for foreign entities to establish shell companies in the United States.~Joseph (Joe) Biden & Michael Carpenter …","name":"joseph joe biden","Sentiment":0.1467261905},{"date":"2018-12-27T22:19:08+00:00","tweet":"Joe Biden Biden Traitor\/Pawn Joseph Biden is an American politician who served as the 47th Vice President of the United States from 2009 to 2017. Shady deals with China.","name":"joseph joe biden","Sentiment":-0.125},{"date":"2018-12-26T14:12:30+00:00","tweet":"My top three Dem Presidential Candidates for 2020 are not in any order, Joe Biden,Beto O'Rourke,Kamala Harris. And I like Joseph Kennedy too!#RESISTANCE","name":"joseph joe biden","Sentiment":0.5},{"date":"2018-12-25T04:14:18+00:00","tweet":"Beta O'Rourke Kamala Harris Joe Biden I also like Joseph Kennedy The winning ticket would be Biden\/Harris, I think","name":"joseph joe biden","Sentiment":0.5},{"date":"2018-12-21T16:12:22+00:00","tweet":"“He’s more like a young Joe Biden,” said a Democratic strategist about O’Rourke. “He sort of sees himself as a charismatic Bobby Kennedy type.\" So the Robert Kennedy who worked for Joseph McCarthy? And as for being \"charismatic\"...","name":"joseph joe biden","Sentiment":0.4},{"date":"2018-12-14T15:35:19+00:00","tweet":"Former Vice President @JoeBiden, @UDelaware President Dennis Assanis, and our students reflect upon the significance of the school's establishment as the Joseph R. Biden, Jr. School of Public Policy and Administration.","name":"joseph joe biden","Sentiment":0.0},{"date":"2018-12-13T22:45:34+00:00","tweet":"I love Joe Biden, but I love Joseph P. Kennedy III even more. Kennedy in 2020!","name":"joseph joe biden","Sentiment":0.5416666667},{"date":"2018-12-13T18:11:08+00:00","tweet":"Loved seeing fourth-graders from Miss Bradley's class at Mountain View Elementary School at today's presentation by Vice President Joseph Biden. Thanks for visiting the U! @JoeBiden #purpose @slcschools","name":"joseph joe biden","Sentiment":0.4166666667},{"date":"2018-12-13T14:38:40+00:00","tweet":"We’re on! Vice President Joseph Biden, with Professor Mark Matheson, begins with lessons he learned from his father. #purpose @JoeBiden","name":"joseph joe biden","Sentiment":0.0},{"date":"2018-12-13T14:02:34+00:00","tweet":"Fourth-grade students from Mountain View Elementary in Salt Lake City here for the VP Joseph Biden speech! Welcome to the U! Thanks for bringing them, Miss Bradley! #mountainviewslc #purpose @joebiden","name":"joseph joe biden","Sentiment":0.5416666667},{"date":"2018-12-13T13:05:47+00:00","tweet":"Yes, it is starting to buzz around Kingsbury Hall. We’re less than an hour away from hearing from Vice President Joseph Biden! @JoeBiden","name":"joseph joe biden","Sentiment":-0.1041666667},{"date":"2018-12-11T23:28:45+00:00","tweet":"I'm excited to share in the footsteps of greatness @UDelaware with the renaming of the Joseph R. Biden Jr. School of Public Policy and Administration. Proud to share this with fellow MPA alumni, faculty and staff. It's an honor @JoeBiden. Go Big Blue @UDBidenSchool!","name":"joseph joe biden","Sentiment":0.235},{"date":"2018-12-11T19:52:25+00:00","tweet":"… #philly The University of Delaware is renaming its public policy school for one of its most well-known alumni: former Vice President Joe Biden. The board of trustees announced the new Joseph R. Biden Jr. School of Public Policy and Administration at a …","name":"joseph joe biden","Sentiment":0.1272727273},{"date":"2018-12-11T17:32:52+00:00","tweet":"“I am humbled and honored that the University of Delaware has chosen to re-name it’s public policy school the Joseph R. Biden, Jr. School of Public Policy and Administration. UD holds a special place in my heart,” @JoeBiden said. @UDBidenSchool #UDel","name":"joseph joe biden","Sentiment":0.119047619},{"date":"2018-12-11T16:14:53+00:00","tweet":"The @UDelaware is now proud to be the home of the @JoeBiden (Joseph R. Biden Jr.) School of Public Policy & Administration. Details coming up on @WDEL #NetDE #UDel","name":"joseph joe biden","Sentiment":0.4},{"date":"2018-12-11T13:54:21+00:00","tweet":"tired: unity ticket of mitt romney \/ joe biden wired: unity ticket of paul ryan \/ joseph kennedy III","name":"joseph joe biden","Sentiment":-0.4},{"date":"2018-12-11T12:18:20+00:00","tweet":". @MoveOn 2020 straw poll (1\/2): Someone Else \/ Don’t Know 17.89% Beto O’Rourke 15.60% Joe Biden 14.95% Bernie Sanders 13.15% Kamala Harris 10.02% Elizabeth Warren 6.42% Sherrod Brown 2.92% Amy Klobuchar 2.75% Michael Bloomberg 2.71% Cory Booker 2.63% Joseph Kennedy III 1.90%","name":"joseph joe biden","Sentiment":0.0},{"date":"2018-12-05T01:55:27+00:00","tweet":"Be about it Joseph RT @CNNPolitics: Joe Biden: \"I think I'm the most qualified person in the country to be president\"","name":"joseph joe biden","Sentiment":0.5},{"date":"2018-12-04T13:05:13+00:00","tweet":"@JoeBiden That’s a false statement Joseph. …","name":"joseph joe biden","Sentiment":-0.4},{"date":"2019-02-26T20:10:56+00:00","tweet":"@UDelaware Pres Dennis Assanis and School director @MariaAristigue4 announce the naming of the Joseph R. Biden, Jr. School of Public Policy and Administration For VP @JoeBiden @BidenOwens @UDBidenInst ⁦@UDBidenSchool⁩","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-26T15:22:40+00:00","tweet":"“I hope the Biden School will inspire this and future generations of young leaders—just as I was inspired on this campus.” – Vice President @JoeBiden on the naming of the Joseph R. Biden, Jr. School of Public Policy and Administration at @UDelaware #UDBidenSchool","name":"joseph joe biden","Sentiment":0.0333333333},{"date":"2019-02-22T20:25:34+00:00","tweet":"idk who's more famous Joseph Gordon-Levitt or Joe Biden. I think I could take Joe Biden 🤔 …","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-02-22T20:20:20+00:00","tweet":"Joe Frazier, Joe Cocker, Joe DiMaggio, Joe Biden, Joe Montana, St. Joseph. I can take ‘em all. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-22T19:29:43+00:00","tweet":"did that 'can you take the most famous person with your name in a fistfight' thing and it's not looking too good for me tbqh. joseph gordon leavitt *maybe*. joe biden, probably not even today let alone in his prime lol","name":"joseph joe biden","Sentiment":0.625},{"date":"2019-02-22T17:35:28+00:00","tweet":"So I've gotta choose between Joe Biden (ok) or lots of bad options- Joe Montana, Joe Frazier, Joseph Stalin, Joseph Goebbels, or Mean Joe Green. (this is assuming all were alive, obvs) …","name":"joseph joe biden","Sentiment":-0.1225},{"date":"2019-02-22T17:24:24+00:00","tweet":"I could probably take Joseph Gordon-Levitt, but Joe Biden or Joe Montana might be a challenge. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-21T09:18:07+00:00","tweet":"'CREEPY UNCLE JOE' SET TO ANNOUNCE RUN FOR PRESIDENCY Jokin' Joe Biden has never won more than 1.41% of the vote by himself. Paul Joseph Watson |","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-17T11:48:32+00:00","tweet":"Speaking of Racism Joseph... remember this quote? \"Biden called Obama first \"clean\" African-American candidate\" - Ah Joe....","name":"joseph joe biden","Sentiment":0.3083333333},{"date":"2019-02-17T08:17:22+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson …","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-02-12T11:03:14+00:00","tweet":"Former VP Joe Biden, Rep. Fred Upton, R-St. Joseph, and Rep. John Lewis, D-Ga., among dignitaries to speak at John Dingell's funeral today – scheduled for 11 a.m. at Church of the Divine Child in Dearborn. Watch live and follow along here: … @crainsdetroit","name":"joseph joe biden","Sentiment":0.0681818182},{"date":"2019-02-11T15:55:49+00:00","tweet":"VP Biden @JoeBiden and Rep. John Lewis @repjohnlewis (D-Ga.) and Rep. Fred Upton @RepFredUpton (R-St. Joseph) will speak at Tuesday's funeral mass, which will be held at Church of the Divine Child in Dearborn. Pallbearers will include former staff members of Dingell.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-11T14:46:06+00:00","tweet":"The Great Biden Stall of 2019, con’t “In celebration of the newly named Joseph R. Biden, Jr. School of Public Policy and Administration, former VP Joe Biden will host presidential historian and Pulitzer-Prize-winning author Jon Meacham at the University of Del” Feb 26th","name":"joseph joe biden","Sentiment":0.2340909091},{"date":"2019-02-08T05:08:56+00:00","tweet":"Fighting corruption is not just good governance. It's self-defense. It's patriotism. Joseph Robinette Biden Jr. (Joe Biden) Former United States Senator #cleangovernment #indonesia #newzealand #bts #true #kiaoratour #quotesphotography #joebiden #honestbusiness #investment","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-02-06T09:56:43+00:00","tweet":"Hypocrite Trump reveals his true colors hours BEFORE his call for unity >> Trump dismissed former Vice President Joseph R. Biden Jr. as “dumb,” called Senator Chuck Schumer of New York a “nasty son of a bitch” … #SOTU @JoeBiden @SenSchumer","name":"joseph joe biden","Sentiment":-0.1777272727},{"date":"2019-02-05T20:01:14+00:00","tweet":"Who the fuck calls Joe Biden \"Joseph R Biden Jr\" lol","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-02-02T17:40:40+00:00","tweet":"Barack Obama Michelle Obama Oops I started thinking. Uh... Dang it! Tyler Joseph Joe Biden I suck at this.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-02T11:58:34+00:00","tweet":"@nytimes Why do you keep calling Joe Biden \"Joseph R. Biden\" in your stories?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-02T01:11:38+00:00","tweet":"Remember Uncle Joe Biden's description of Barack Obama? \"I mean, you got the first mainstream African-American who is articulate and bright and clean and a nice-looking guy. I mean, that's a storybook, man.\" - Joseph R. Biden, 2007. …","name":"joseph joe biden","Sentiment":0.1383333333},{"date":"2019-03-02T05:59:49+00:00","tweet":"Everybody is getting mad at Joe Biden for praising Mike Pence, but how can you get mad at a guy that has no idea what’s going on or what he’s even saying? I see myself in Joseph Biden. This gif is actually me.","name":"joseph joe biden","Sentiment":-0.4166666667},{"date":"2019-03-01T16:26:23+00:00","tweet":"@WSJ @WSJopinion @JoeBiden Joseph Robinette Biden Jr reportedly was an avid Plagiarist in College, Law School and on the campaign trail - He might as well hire Michael Cohen as his Attorney (if the gentleman gets his license back) …","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-03-01T10:41:43+00:00","tweet":"@JoeBiden Mike Pence is NOT a good guy Joseph. He's an enabler. And a liar.. Well past time being pleasant. He's anti gay, anti immigration, scum sorry joey","name":"joseph joe biden","Sentiment":-0.0416666667},{"date":"2019-03-01T10:22:36+00:00","tweet":"Joseph Robinette Biden Jr. born November 20, 1942 He would be 78 yrs 4 mths 2 ds old on inauguration day 2021. This would make him even older than the previous record holder, Ronald Reagan, who was 73 yrs, 274 ds old at the time of his election to a 2ndterm.","name":"joseph joe biden","Sentiment":0.05},{"date":"2019-03-01T01:35:02+00:00","tweet":"Joseph Robinette Biden Jr. You listen now! You are the potential savior of our Party and Country. You have experience and offer a realistic approach to how the Party can move forward in a cohesive and united manner. Two suggestions. Keep your hands off of the ladies and be YOU!","name":"joseph joe biden","Sentiment":0.1041666667},{"date":"2019-02-28T11:53:30+00:00","tweet":"St Joseph, MI received grant to replace homeowners pipes last year if lead discovered? @rasjbaraka @BrianLehrer @JoeBiden @northjersey","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-27T17:01:16+00:00","tweet":"He threatens physical violence and he's no angel.The only Democrat that I would back is @Schwarzenegger ... The guy fought tooth + nail from Austria to be where he is. He made one... I wouldn't call it mistake because Joseph is his son and he's really close w\/Joseph +loves him.","name":"joseph joe biden","Sentiment":0.05},{"date":"2019-02-26T20:10:08+00:00","tweet":"@MariaAristigue4 and @UDelaware Pres Dennis Assanis announce the naming of the Joseph R. Biden, Jr. School of Public Policy and Administration For VP @JoeBiden @BidenOwens @UDBidenInst ⁦@UDBidenSchool⁩","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-25T00:24:09+00:00","tweet":"Joe Biden has always considered his family in making decisions. This wld also be in making decisions regarding the American people. J.Biden is very Selfless as Confident as he would be as President of The U.S..Joseph Biden, Sir, you have my respect, support, and my & Vote. …","name":"joseph joe biden","Sentiment":0.2333333333},{"date":"2019-02-22T21:13:43+00:00","tweet":"Joseph from the Bible. I’m still here, he isn’t. Joe Biden would be a draw, though. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-22T00:20:32+00:00","tweet":"If Joe Biden enters 2020 presidential race, Trump-like support is expected by Democrats: Former Vice President Joseph R. Biden has yet to declare his...","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-02-21T14:05:39+00:00","tweet":"Joseph Farah: For eight years, #JoeBiden and #Obama \"made it a point to apologize for America’s past, present and future.\" @JosephFarah …","name":"joseph joe biden","Sentiment":-0.0833333333},{"date":"2019-02-17T18:20:10+00:00","tweet":"The only real embarrassment in America today is You Joseph Biden . You don't even know who you are, much less who we are in America. One thing is for damned certain Sir , \"We are not You.\"","name":"joseph joe biden","Sentiment":0.0619047619},{"date":"2019-02-12T07:20:04+00:00","tweet":"Today at 11am @JoeBiden will be joined by @repjohnlewis (D-Ga.) and @RepFredUpton (R-St. Joseph) to speak at @JohnDingell funeral mass, which will be held at Church of the Divine Child in Dearborn. Pallbearers will include former staff members of Dingell. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-10T11:04:02+00:00","tweet":"John Sweeney (labour leader) John Joseph Sweeney (born May 5, 1934) is a labor leader and served as president of the AFL-CIO from 1995 to 2009. The Labour Party are \"Socialist\" \"The goal of socialism is communism.\" - Vladimir Lenin He's a power hungry slacker. A parasite.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-06T01:46:27+00:00","tweet":"Please run with Joseph Kennedy III!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-02T15:22:51+00:00","tweet":"Joe Biden’s Primary Victory Odds Slump After #MeToo Controversy Paul Joseph Watson | 2 hours ago Former frontrunner now behind Sanders and Harris …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-02T14:29:41+00:00","tweet":"Now I have A LOT of respect toward former Vice President Joe Biden , as well as his VERY meaningful work in the US Senate , HOWEVER , when the Washington Post labels Joe Biden , \"Creepy Uncle Joe\" , well thats a BIG deal !! Here is Paul Joseph Watson (@PrisonPlanet ) ..","name":"joseph joe biden","Sentiment":0.0375},{"date":"2019-04-02T13:21:55+00:00","tweet":"Nancy Pelosi Tells Joe Biden to Stop Touching Women Paul Joseph Watson | - Powered by YOU \"Just pretend you have a cold and I have a cold\" …","name":"joseph joe biden","Sentiment":-0.2333333333},{"date":"2019-04-01T10:46:16+00:00","tweet":"Thank you for sharing sir Joseph Biden is a good, honest honorable human being. The GOP \/Trump are pulling an Al Franken on the Democrats again.","name":"joseph joe biden","Sentiment":0.4333333333},{"date":"2019-04-01T09:20:46+00:00","tweet":"CREEPY UNCLE JOE BIDEN Groping Children And Young Women Paul Joseph Watson via @YouTube @JoeBiden","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-03-30T08:11:24+00:00","tweet":"And creepy Joe Biden gropes and sexually assaults women and children! Maybe Avenatti is his attorney!","name":"joseph joe biden","Sentiment":0.140625},{"date":"2019-03-27T09:04:54+00:00","tweet":"Joe Biden Blames “White Man’s Culture” For Violence Against Women Paul Joseph Watson | - Powered by YOU Former VP previously celebrated demographic decline of whites …","name":"joseph joe biden","Sentiment":0.1166666667},{"date":"2019-03-25T13:32:22+00:00","tweet":"Do you also get this upset that Joe Biden is not running as Joseph Biden? It’s a shortened version of his name that he’s literally gone by his whole life, but ok.","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-03-22T00:51:17+00:00","tweet":"joe biden’s got you in a headlock","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-21T08:06:19+00:00","tweet":"R: I can’t believe Joe Biden is running for President! Biden is a laugingstock who says silly things and nobody takes him seriously D: The Republican Senate cheated when they refused a hearing for Merrick Garland R: WE MUST NEVER FORGET THE SACROSANCT WORDS OF JOSEPH BIDEN","name":"joseph joe biden","Sentiment":-0.4166666667},{"date":"2019-03-20T00:29:34+00:00","tweet":"U.S. Senators that voted for the invasion of #Iraq. (Some of them are: Joe Biden, Hillary Clinton, Charles Schumer, Dianne Feinstein, John McCain, Harry Reid, Susan Collins, Joseph Lieberman, etc.) See the full list here: …","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-03-16T00:20:00+00:00","tweet":"Joe Squared 2020 so everyone gets a square deal and fair shake! Joe Biden\/Joseph Kennedy III!","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-03-14T07:38:42+00:00","tweet":"This is a bad take. Are you insisting we call Joe Biden Joseph? Bernie Bernard? Something seems off with you criticizing a more “ethnic” nickname and giving Anglo ones a pass.","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-03-13T21:56:05+00:00","tweet":"I am so ready for you to become our nominee!!!! President Joseph Biden!!!!!!","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-03-13T11:55:52+00:00","tweet":"Never forget. Remember, in Feb, 1988 Joseph Robinette \"Joe\" Biden Jr. had a brain aneurysm. He's not healthy enough to be President. Luckily for the American people, being a former Vice President was enough. Naw, can't risk it.","name":"joseph joe biden","Sentiment":0.0138888889},{"date":"2019-03-12T20:30:00+00:00","tweet":"Opinion | Joseph Curl writes \"Why Uncle Joe Biden will be America's next president\"","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-09T06:06:19+00:00","tweet":"Interesting to see that Joe Biden becomes ‘Joseph R. Biden Jr.’ and ‘Bernie Sanders’ remains Bernie","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-03-08T15:59:10+00:00","tweet":"Why Joseph Crowley’s Defeat Should Scare Joe Biden …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-06T11:56:14+00:00","tweet":"Yes Joe Biden who has run for President Twice and never even won a single State. Can't wait for more of Bidens idiotic gaffes to end his campaign before the primaries and debates even start.","name":"joseph joe biden","Sentiment":-0.0793650794},{"date":"2019-04-03T09:39:59+00:00","tweet":"The only people up to now who have been plugging the claims that Joe Biden is somehow 'creepy' are Infowars types like Paul Joseph Watson. That in itself tells us all we need to know. They must be delighted that their work is being done for them by people who should know better.","name":"joseph joe biden","Sentiment":0.175},{"date":"2019-04-03T09:17:28+00:00","tweet":"CREEPY UNCLE JOE BIDEN'S PRIMARY VICTORY ODDS SLUMP AFTER #METOO CONTROVERSY 🥰 🤢🤮🤬 Paul Joseph Watson |","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-04-02T15:09:15+00:00","tweet":"Joseph Watson stop talking about Joe Biden, you are being a democrat....................... …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-31T21:36:10+00:00","tweet":"Joe Biden's father, Joseph Robinette Biden Sr. (1915–2002) used to claim the name was of Irish origin, but the claim could not be verified. The name is likely from French boton. #JoeBiden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-30T09:01:57+00:00","tweet":"Creepy Joe Biden the fondler. Creepy creeps Joseph Biden.. …","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-03-29T18:17:28+00:00","tweet":"While we’re at it how about we tell creepy uncle Joseph to stay the hell out of the Presidential race if he knows what’s best for the country instead of just thinking about himself and his decades long political career.","name":"joseph joe biden","Sentiment":0.1125},{"date":"2019-03-28T17:41:24+00:00","tweet":"NOW THIS ALL MATTERS BECAUSE JOSEPH STALIN IS THE BIRTH FATHER OF FORMER VP JOE BIDEN...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-28T11:15:26+00:00","tweet":"CREEPY JOE BIDEN BLAMES \"WHITE MAN’S CULTURE\" FOR VIOLENCE AGAINST WOMEN WTH?! 🤔 Paul Joseph Watson |","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-03-27T13:47:39+00:00","tweet":"Joe Biden Says He ‘Regrets’ Role in Anita Hill Hearing Former Vice President Joseph R. Biden Jr. on Tuesday acknowledged his role in the Anita Hill hearing, publicly reckoning with a … #bidenjosephrjr #enmnews #hillanita","name":"joseph joe biden","Sentiment":-0.0333333333},{"date":"2019-03-20T18:20:17+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson via @YouTube ( Empathically i'am very uncomfortable watchin Creepy Joe feel up women & girls )","name":"joseph joe biden","Sentiment":-0.55},{"date":"2019-03-20T02:32:08+00:00","tweet":"Trump Unveils New Nickname For Joe Biden — And It&#039;s A Doozy …—-and-its-joseph-curl","name":"joseph joe biden","Sentiment":0.1363636364},{"date":"2019-03-19T10:34:41+00:00","tweet":"Hello Joe Biden my name is Joseph Mitchell and I live in Atlanta, GA. I hope you will consider running for President.","name":"joseph joe biden","Sentiment":0.1363636364},{"date":"2019-03-12T23:05:35+00:00","tweet":"Chuck, That is great news Joseph Robert Biden Junior Versus Donal John Trump No disrespect to Joe Biden because he is not as bad as some, sometimes he's worse. But Bookmakers would frame odds around a Trump win at shorter odds than: Secretariat in the 1973 Belmont Stakes.","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-03-12T21:46:32+00:00","tweet":"Why Uncle Joe Biden will be America's next president..Joseph Curl","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-10T13:16:31+00:00","tweet":"The Democratic Party's shift to the left in the recent years didn't bode well for Joseph Crowley—and it doesn't bode well for a potential 2020 bid by Joe Biden for the same reasons, writes @PeterBeinart: …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-09T14:40:45+00:00","tweet":"Joseph Kennedy III is a bigger idiot than Joe Biden, and that's saying something. #AFedUpAmerican","name":"joseph joe biden","Sentiment":-0.4},{"date":"2019-03-06T11:58:08+00:00","tweet":"My point is that Sanders is polling the highest among announced candidates. Are you saying he should drop out because someone who hasn't announced is beating him in the polling 1+ Year before the first primary? Why shouldn't everyone but Biden drop out then?","name":"joseph joe biden","Sentiment":0.325},{"date":"2019-03-06T11:42:23+00:00","tweet":"@JoeBiden hasn't even announced and likely won't","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-03T18:01:35+00:00","tweet":"OH, THE HARVEY WEINSTEIN OF IT ALL. Now that the lawyers have the me-too movement sewn up. 9:53 From Paul Joseph Watson @PrisonPlanet CREEPY UNCLE JOE The name the Washington Post gave Joe Biden. Is this really normal? YouTube","name":"joseph joe biden","Sentiment":-0.175},{"date":"2019-02-26T20:10:56+00:00","tweet":"@UDelaware Pres Dennis Assanis and School director @MariaAristigue4 announce the naming of the Joseph R. Biden, Jr. School of Public Policy and Administration For VP @JoeBiden @BidenOwens @UDBidenInst ⁦@UDBidenSchool⁩","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-26T15:22:40+00:00","tweet":"“I hope the Biden School will inspire this and future generations of young leaders—just as I was inspired on this campus.” – Vice President @JoeBiden on the naming of the Joseph R. Biden, Jr. School of Public Policy and Administration at @UDelaware #UDBidenSchool","name":"joseph joe biden","Sentiment":0.0333333333},{"date":"2019-02-22T21:13:43+00:00","tweet":"Joseph from the Bible. I’m still here, he isn’t. Joe Biden would be a draw, though. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-22T20:25:34+00:00","tweet":"idk who's more famous Joseph Gordon-Levitt or Joe Biden. I think I could take Joe Biden 🤔 …","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-02-22T20:20:20+00:00","tweet":"Joe Frazier, Joe Cocker, Joe DiMaggio, Joe Biden, Joe Montana, St. Joseph. I can take ‘em all. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-22T19:29:43+00:00","tweet":"did that 'can you take the most famous person with your name in a fistfight' thing and it's not looking too good for me tbqh. joseph gordon leavitt *maybe*. joe biden, probably not even today let alone in his prime lol","name":"joseph joe biden","Sentiment":0.625},{"date":"2019-02-22T17:35:28+00:00","tweet":"So I've gotta choose between Joe Biden (ok) or lots of bad options- Joe Montana, Joe Frazier, Joseph Stalin, Joseph Goebbels, or Mean Joe Green. (this is assuming all were alive, obvs) …","name":"joseph joe biden","Sentiment":-0.1225},{"date":"2019-02-22T17:24:24+00:00","tweet":"I could probably take Joseph Gordon-Levitt, but Joe Biden or Joe Montana might be a challenge. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-22T00:20:32+00:00","tweet":"If Joe Biden enters 2020 presidential race, Trump-like support is expected by Democrats: Former Vice President Joseph R. Biden has yet to declare his...","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-02-21T09:18:07+00:00","tweet":"'CREEPY UNCLE JOE' SET TO ANNOUNCE RUN FOR PRESIDENCY Jokin' Joe Biden has never won more than 1.41% of the vote by himself. Paul Joseph Watson |","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-17T11:48:32+00:00","tweet":"Speaking of Racism Joseph... remember this quote? \"Biden called Obama first \"clean\" African-American candidate\" - Ah Joe....","name":"joseph joe biden","Sentiment":0.3083333333},{"date":"2019-02-17T08:17:22+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson …","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-02-12T11:03:14+00:00","tweet":"Former VP Joe Biden, Rep. Fred Upton, R-St. Joseph, and Rep. John Lewis, D-Ga., among dignitaries to speak at John Dingell's funeral today – scheduled for 11 a.m. at Church of the Divine Child in Dearborn. Watch live and follow along here: … @crainsdetroit","name":"joseph joe biden","Sentiment":0.0681818182},{"date":"2019-02-11T15:55:49+00:00","tweet":"VP Biden @JoeBiden and Rep. John Lewis @repjohnlewis (D-Ga.) and Rep. Fred Upton @RepFredUpton (R-St. Joseph) will speak at Tuesday's funeral mass, which will be held at Church of the Divine Child in Dearborn. Pallbearers will include former staff members of Dingell.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-02-11T14:46:06+00:00","tweet":"The Great Biden Stall of 2019, con’t “In celebration of the newly named Joseph R. Biden, Jr. School of Public Policy and Administration, former VP Joe Biden will host presidential historian and Pulitzer-Prize-winning author Jon Meacham at the University of Del” Feb 26th","name":"joseph joe biden","Sentiment":0.2340909091},{"date":"2019-02-08T05:08:56+00:00","tweet":"Fighting corruption is not just good governance. It's self-defense. It's patriotism. Joseph Robinette Biden Jr. (Joe Biden) Former United States Senator #cleangovernment #indonesia #newzealand #bts #true #kiaoratour #quotesphotography #joebiden #honestbusiness #investment","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-02-06T09:56:43+00:00","tweet":"Hypocrite Trump reveals his true colors hours BEFORE his call for unity >> Trump dismissed former Vice President Joseph R. Biden Jr. as “dumb,” called Senator Chuck Schumer of New York a “nasty son of a bitch” … #SOTU @JoeBiden @SenSchumer","name":"joseph joe biden","Sentiment":-0.1777272727},{"date":"2019-02-05T20:01:14+00:00","tweet":"Who the fuck calls Joe Biden \"Joseph R Biden Jr\" lol","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-05-02T12:25:17+00:00","tweet":"Joseph Robinette \"Beau\" Biden III (Feb 3, 1969 – May 30, 2015) was an American attorney, officer in the Army Judge Advocate General's Corps, politician fm Wilmington, Delaware. He was the eldest of 3 children from the marriage of fmr U.S. VP Joe Biden and first wife, Neilia Biden","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-05-01T18:36:35+00:00","tweet":"And how do you know that Trump is going to win? Have you heard of a man named Joseph [Joe] Biden? The 47th Vice President of The USA, That man may not be agreed by whole of the Democratic Party, But he has the SAME longshot as Obama did, And we already see a Biden Victory in 2020","name":"joseph joe biden","Sentiment":0.3333333333},{"date":"2019-04-30T08:27:49+00:00","tweet":"Truth over Lies, Truth over Lies, All the time Joe Biden stood behind Pres Obama never to challenge the lies esp Benghazi\/Obamacare\/Obama's fake aim workers like (Joe the Plumber, Samuel Joseph Wurzelbacher) in campaign for Pres & it shows the evil that lurked the @WhiteHouse.","name":"joseph joe biden","Sentiment":-0.6333333333},{"date":"2019-04-30T01:59:29+00:00","tweet":"Bijo m joseph and Joe Biden will be in the white doubt.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-26T11:07:36+00:00","tweet":"Former U.S. Senator, former U.S. Vice President & 2020 Presidential candidate Joseph \"Joe\" R. Biden !","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T23:29:12+00:00","tweet":"Figures just in: former Vice-President Joseph 'Joe' Biden 1st day donations: 1.4 billion dollars and the six media giants are all stars and rainbows for him. Chris Cuomo donated his aging dog, the one with the diamond collar. It's all over but the cryin'","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T22:36:53+00:00","tweet":"trump calls The honorable Joseph Biden “sleepy Joe”. Biden just might be a sleeping political giant.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T16:45:02+00:00","tweet":"Pretty disappointed Trump went with Sleepy Joe Biden for his nickname instead of the obviously superior Handsy Uncle Joseph","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-04-25T12:11:36+00:00","tweet":"Joe Biden Launches His Campaign on the Lie That Trump Said Neo-Nazis Were “Very Fine People” Paul Joseph Watson | Trump never referred to Charlottesville racists as \"very fine people\" - he specifically condemned them …","name":"joseph joe biden","Sentiment":0.5416666667},{"date":"2019-04-25T08:11:01+00:00","tweet":"Joseph Robinette \"Joe\" Biden, Jr. 2020 U. S. presidential run original expression expression …","name":"joseph joe biden","Sentiment":0.375},{"date":"2019-04-25T07:53:10+00:00","tweet":"Joseph Robinette Biden had the luxury to wait, and did. Here we go. Joe Biden Is the Front-Runner Over Democrats, and Donald Trump …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T05:51:57+00:00","tweet":"Where else would you start @JoeBiden announcement day but the Joseph R. Biden Jr Rail Station","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-23T14:54:30+00:00","tweet":"THESE MEN SUPPORT YOUR RIGHT TO BEAR ARMS: - George Washington - Thomas Jefferson - James Madison - Alexander Hamilton - Donald Trump THESE MEN OPPOSE IT - Adolf Hitler - Fidel Castro - Joseph Stalin - Vladimir Lenin - Joe Biden WHO DO YOU TRUST?","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-04-23T03:33:24+00:00","tweet":"While it may be surprising, Bernie Sanders (77) is only a single year older than Joseph “Joe” Biden (76). Their combined age is 153 years which is the exact amount of time since the South began reconstruction!","name":"joseph joe biden","Sentiment":0.221547619},{"date":"2019-04-21T19:34:54+00:00","tweet":"At the Stop & Shop rally, Jasmin Richardson encourages @JoeBiden to ‍️ for president. (Joseph Prezioso\/AFP\/Getty Images) #Biden2020","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-19T20:02:20+00:00","tweet":"First of all, that isn't how this works, and if it were that stupid (it's close, don't worry), you think uniting behind Joseph \"handsy uncle Joe\" Biden would be wonderful? Gross.","name":"joseph joe biden","Sentiment":0.01},{"date":"2019-04-05T11:58:29+00:00","tweet":"That kind of crack demeans and cheapens the cause of Female Equality in our country. This is no a joking matter. Joe Biden should be President.","name":"joseph joe biden","Sentiment":0.3},{"date":"2019-04-05T04:56:16+00:00","tweet":"These stories are GETTING SO TIRESOME. BIDEN IS LOVED. NONE OF THESE WOMEN WILL BREAK OUR SUPPORT OF HIM. \"We are not weak. Somebody fears our unity.\" Rev. Dr. William J. Barber II Same is true for Joseph Robinette Biden Jr. (Joe Biden to you) …","name":"joseph joe biden","Sentiment":0.1475},{"date":"2019-04-30T16:16:55+00:00","tweet":"Joseph, I'm afraid I'm going to need you to take the pledge: @JoeBiden, take the #WeAreIndivisible pledge to: 1️⃣ Make the primary constructive 2️⃣ Rally behind the winner 3️⃣ Do the work to beat Trump Learn more:","name":"joseph joe biden","Sentiment":-0.025},{"date":"2019-04-30T13:30:34+00:00","tweet":"Joe Biden? More like JOSEPH Biden, which is likely his full name","name":"joseph joe biden","Sentiment":0.2833333333},{"date":"2019-04-30T10:38:41+00:00","tweet":"Talk to talk Joseph!! RT @ABCPolitics: Joe Biden tells @GMA Congress is investigating elements (cont)","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-29T16:54:48+00:00","tweet":"Donald Trump posts video of Joe Biden getting touched ... by Joe Biden - Washington Times President Trumpon Thursday posted a satirized version of likely 2020 foe Joseph R. Biden’s video apologizing for invading others’ personal space, with the former vice president getting","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-29T15:58:25+00:00","tweet":"@KyleKulinski hey Kyle, instead of calling Joe Biden \"handsy uncle joseph\". How about \"Status-quo Joe\"?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-26T21:11:49+00:00","tweet":"“The current bill was stuck in conference between the Senate and House until Senator Joseph Biden... agreed to vote with Republicans on almost all the issues that were holding up the bill.” — Elizabeth Warren @ewarren on Joe Biden, @nytimes May 20, 2002 …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-26T10:29:48+00:00","tweet":"Patriots Please Take A Moment To Read Paul Joseph Watson @PrisonPlanet Comments On Joe Biden....& Thank You Again Today Paul For Your Continued Efforts To Highlight The UGLY & Dangerous That IS JOE BIDEN! …","name":"joseph joe biden","Sentiment":-0.725},{"date":"2019-04-26T07:47:55+00:00","tweet":"Joe Biden Tells 8-Year-Old Girl: “You’re Getting Old” Paul Joseph Watson | - Powered by YOU Another bizarre moment on the campaign trail …","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-04-25T07:20:08+00:00","tweet":"To most, he is Joe Biden. To ⁦@nytimes⁩, he is Joseph R. Biden, Jr.","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-04-22T12:47:36+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson via @YouTube","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-04-22T03:15:10+00:00","tweet":"A trairor to us all just said, to me, that Joe Biden is Joseph Stalin! I disagree!! Totally! Biden is an American Patriot!!! Stalin was a Russian FUCK!!!!!!!!!!!!!!","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-04-22T03:10:54+00:00","tweet":"Joe Biden is NOT Joseph Stalin!!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-20T23:08:07+00:00","tweet":"Hopefully he will fizzle quickly. The longer Joe Biden stays in, the more he divides the Democratic Party\/the left for no reason other than his own vanity and the establishment’s self-preservation.","name":"joseph joe biden","Sentiment":0.2616666667},{"date":"2019-04-19T18:13:06+00:00","tweet":"Joseph R. Biden, will you please go now ?! Go away Joe. #GoAwayJoe #NoWayJoe #NoBiden #NoJoe @JoeBiden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-17T01:07:05+00:00","tweet":"Joe Biden eulogizes the ‘constantly evolving’ Fritz Hollings as he looks toward 2020 As Joseph R. Biden Jr. mulls another run for the White House, the former vice president traveled to South Carolina to fulfill a duty that underscores his ties to... #USRC","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-16T10:48:29+00:00","tweet":"“He did us a disservice in the last election,” said Mr. Schwartz, a longtime Clinton supporter who said he will support former Vice President Joseph R. Biden Jr\" who tf call Joe Biden that?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T12:18:04+00:00","tweet":"the cojones on this shithead","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T12:17:23+00:00","tweet":"But judge the 14 year old girl I slept with gave me permission to touch her.","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-04-05T12:14:15+00:00","tweet":"Per @cclarke52 comment in this thread, he apologized publicly. Can we save the outrage? TPM is usually better than that. Also, vote Warren \/ Harris \/ Klobuchar!","name":"joseph joe biden","Sentiment":0.3125},{"date":"2019-04-05T12:06:58+00:00","tweet":"A lot of us think this entire thing has been overplayed and the line got a huge laugh, so.....","name":"joseph joe biden","Sentiment":0.2333333333},{"date":"2019-04-05T12:02:18+00:00","tweet":"I abso-fuckin-lutely agree 100% hahaha","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-04-05T12:01:29+00:00","tweet":"I'm not laughing.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T12:00:00+00:00","tweet":"*not be Y'all know what I meant","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T11:56:13+00:00","tweet":"TAKE THE MIC AWAY FOR THE LOVE OF GOD","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-04-05T11:55:10+00:00","tweet":"Yeah, that's ...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T11:52:13+00:00","tweet":"that's like comparing Obama and Hitler.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T11:50:58+00:00","tweet":"I think this might work for him.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-05T11:50:21+00:00","tweet":"If you don't count his video the other day.","name":"joseph joe biden","Sentiment":-0.125},{"date":"2019-04-05T11:48:08+00:00","tweet":"But he gets it! Really!","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-04-05T07:30:43+00:00","tweet":"Ok well if you’re talking about the cartels, you’re sadly mistaken if you think a wall is going to keep them out. They already have 100,000+ tunnels and I can guarantee you they’re making more as we speak (probably big enough to fit their exotic cars through","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-04-05T07:10:02+00:00","tweet":"On the 🇲🇽 Mexican Border there's the highest crime rate.... In the world! Do you enjoy Beheadings?🤔","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-04-05T07:08:30+00:00","tweet":"first step act will be a difficult win to play down. reporters went thru the shipping door of the WH a couple of nights ago so they wouldn’t get caught supporting the first prison reform passed in decades. 🤣","name":"joseph joe biden","Sentiment":0.1490740741},{"date":"2019-04-05T06:57:22+00:00","tweet":"#BetoForAmerica Ha ha ha ha He wants to tear down the wall that's protecting El Paso! What an idiot 🤦‍️ #DemocratsAreDestroyingAmerica #DemocratsHateAmerica","name":"joseph joe biden","Sentiment":-0.2648148148},{"date":"2019-04-05T00:26:21+00:00","tweet":"I see you have such good folks as friends Joseph. Didn't you vote for the disastrous Iraq war? let me guess all the wars ? #biden #Biden2020 @VetsAboutFace #cnn #msnbc @jimmy_dore @miserablelib @grahamelwood #dnc #FeelTheBern #GreenNewDeal @SenSanders","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-04T12:37:09+00:00","tweet":"I have a feeling that Paul Joseph Watson's creepy uncle Joe Biden video will to go up a couple million views. Lol","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-04-04T11:03:38+00:00","tweet":"I re-posted a clip below about joe biden touching little girls from Paul Joseph Watson on YouTube because the link I posted of the video wasn't working before. This isn't the worst video of joe biden. He was rubbing the little Asian girl's breast in another clip I posted below.","name":"joseph joe biden","Sentiment":-0.175},{"date":"2019-04-04T06:18:18+00:00","tweet":"Joe Biden’s Deviant Decency “Is Joe Biden a bad man?” asked the headline of a Washington Post piece about his interaction with women. Anyone who has seen former Vice President Joseph Biden in private settings knows that his attention strays in un-Washingtonian ways. I sure …","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-04-03T22:32:28+00:00","tweet":"I challenge Joe Biden(D) to find even one man he has kissed on the head and smelled the hair of. Just one. Good luck, Joseph.","name":"joseph joe biden","Sentiment":0.7},{"date":"2019-04-02T14:29:41+00:00","tweet":"Now I have A LOT of respect toward former Vice President Joe Biden , as well as his VERY meaningful work in the US Senate , HOWEVER , when the Washington Post labels Joe Biden , \"Creepy Uncle Joe\" , well thats a BIG deal !! Here is Paul Joseph Watson (@PrisonPlanet ) ..","name":"joseph joe biden","Sentiment":0.0375},{"date":"2019-04-02T13:21:55+00:00","tweet":"Nancy Pelosi Tells Joe Biden to Stop Touching Women Paul Joseph Watson | - Powered by YOU \"Just pretend you have a cold and I have a cold\" …","name":"joseph joe biden","Sentiment":-0.2333333333},{"date":"2019-04-01T09:20:46+00:00","tweet":"CREEPY UNCLE JOE BIDEN Groping Children And Young Women Paul Joseph Watson via @YouTube @JoeBiden","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-03-30T08:11:24+00:00","tweet":"And creepy Joe Biden gropes and sexually assaults women and children! Maybe Avenatti is his attorney!","name":"joseph joe biden","Sentiment":0.140625},{"date":"2019-03-27T09:04:54+00:00","tweet":"Joe Biden Blames “White Man’s Culture” For Violence Against Women Paul Joseph Watson | - Powered by YOU Former VP previously celebrated demographic decline of whites …","name":"joseph joe biden","Sentiment":0.1166666667},{"date":"2019-03-25T13:32:22+00:00","tweet":"Do you also get this upset that Joe Biden is not running as Joseph Biden? It’s a shortened version of his name that he’s literally gone by his whole life, but ok.","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-03-22T00:51:17+00:00","tweet":"joe biden’s got you in a headlock","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-21T08:06:19+00:00","tweet":"R: I can’t believe Joe Biden is running for President! Biden is a laugingstock who says silly things and nobody takes him seriously D: The Republican Senate cheated when they refused a hearing for Merrick Garland R: WE MUST NEVER FORGET THE SACROSANCT WORDS OF JOSEPH BIDEN","name":"joseph joe biden","Sentiment":-0.4166666667},{"date":"2019-03-16T00:20:00+00:00","tweet":"Joe Squared 2020 so everyone gets a square deal and fair shake! Joe Biden\/Joseph Kennedy III!","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-03-14T07:38:42+00:00","tweet":"This is a bad take. Are you insisting we call Joe Biden Joseph? Bernie Bernard? Something seems off with you criticizing a more “ethnic” nickname and giving Anglo ones a pass.","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-03-13T11:55:52+00:00","tweet":"Never forget. Remember, in Feb, 1988 Joseph Robinette \"Joe\" Biden Jr. had a brain aneurysm. He's not healthy enough to be President. Luckily for the American people, being a former Vice President was enough. Naw, can't risk it.","name":"joseph joe biden","Sentiment":0.0138888889},{"date":"2019-03-12T20:30:00+00:00","tweet":"Opinion | Joseph Curl writes \"Why Uncle Joe Biden will be America's next president\"","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-09T06:06:19+00:00","tweet":"Interesting to see that Joe Biden becomes ‘Joseph R. Biden Jr.’ and ‘Bernie Sanders’ remains Bernie","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-03-08T15:59:10+00:00","tweet":"Why Joseph Crowley’s Defeat Should Scare Joe Biden …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-03-06T11:56:14+00:00","tweet":"Yes Joe Biden who has run for President Twice and never even won a single State. Can't wait for more of Bidens idiotic gaffes to end his campaign before the primaries and debates even start.","name":"joseph joe biden","Sentiment":-0.0793650794},{"date":"2019-03-06T11:47:21+00:00","tweet":"And yet he still polls 10 points higher than Sanders... hmmm...","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-03-06T11:42:23+00:00","tweet":"@JoeBiden hasn't even announced and likely won't","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-04T05:17:03+00:00","tweet":"Joseph Sabino Mistick: Joe Biden may be antidote for those sick of fighting via @TribLIVE","name":"joseph joe biden","Sentiment":-0.7142857143},{"date":"2019-06-03T09:22:12+00:00","tweet":"AMERICA 2020 Be VERY careful I DO NOT LIKE Joseph Biden or Bernie, Kamala, Warren, Booker, Gillibrand etc. BERNIE SANDERS Showed socialist USA they want HOW Joe Biden stayed out of their Group Hug. BERNIE Says Biden should be with Group Do you want to be told what to do","name":"joseph joe biden","Sentiment":-0.13},{"date":"2019-05-31T09:28:25+00:00","tweet":"I am honored to have been named to a major leadership role in Joseph R. Biden,Jr.’s presidential campaign! #CedricRichmond @JoeBiden @nytimes … #NewYorkTimes #JoeBiden #Biden2020 #PresidentialElection","name":"joseph joe biden","Sentiment":0.078125},{"date":"2019-05-31T04:44:09+00:00","tweet":"Laurel Federbush stating her opposition to Joseph (Joe) Biden …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-29T12:15:00+00:00","tweet":"2020 Democrat Frontrunner @JoeBiden Asks For 10-Year-Old Girl’s Address, Tells Her She’s “Good Looking” Creepy Uncle Joe back up to his old tricks. via Paul Joseph Watson @PrisonPlanet …","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-05-29T08:37:22+00:00","tweet":"Praying for Joe Biden's soul that he will have conversion and not be a hypocrite! Your job is not worth YOUR soul Joe Biden! Saint Joseph please intercede for his metanoia AMEN️ …","name":"joseph joe biden","Sentiment":-0.1875},{"date":"2019-05-28T19:39:32+00:00","tweet":"Joseph Robinette „Joe” Biden does not sniff Serbian people too. He just has only one sniff in his nose! And its smell of money!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-28T14:21:06+00:00","tweet":"Instead of having the courage to say the same thing now that Joe Biden said many years ago, Donald Trump will say, \"AHA!!!!! Joseph Biden is a RACIST!!!!,\" and try to distance himself from the same beliefs. I agree with the old Joe Biden.","name":"joseph joe biden","Sentiment":0.275},{"date":"2019-05-25T20:03:16+00:00","tweet":"Joe Biden; proper noun Spelling: J - O - E - B - I - D - E - N Used it in a sentence: The name of the former 47th Vice President of the United States is Joe Biden, not in fact, Bidan. Synonym: Mr Vice President, Mr Biden, Joseph Robinette Biden Jr. Antonym: Bidan","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-23T13:34:43+00:00","tweet":"Are you ready @JoeBiden when God calls you home! @Pontifex #OurLadyOfGuadlupe Protectress of the Unborn, pray for Joe Biden & unborn. Shameful Bishop! Biden and his wife are both Roman Catholics and regularly attend Mass at St. Joseph’s on the Brandywine in Greenville, Delaware.. …","name":"joseph joe biden","Sentiment":0.15625},{"date":"2019-05-23T01:09:41+00:00","tweet":"Joseph \"Uncle Joe\" Biden and Family - Joe the alleged #Catholic who promotes abortion and for whom feminism is an ideological and political necessity‼️ …","name":"joseph joe biden","Sentiment":-0.0333333333},{"date":"2019-05-19T07:23:01+00:00","tweet":"\"Give me the media and I will make of any nation a herd of swine” — Joseph Goebbels. We’ll Simply Assume, as the American Propagandists, would Prefer, @JoeBiden, was Absent During the Hero of Zero’s “Scandal Free” Eight (8) Years. …","name":"joseph joe biden","Sentiment":0.225},{"date":"2019-05-18T10:59:27+00:00","tweet":"\"Hey, don't worry bout --MAMA's gonna Make America Moral Again\" - Joseph \"Ms. Joe Joe\" Biden, circa 2020","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-16T17:09:54+00:00","tweet":"Joseph Biden IS the reason the US House of Representatives never preferred charges against Barack Obama. Everyone in Congress had worked with Joe Biden for decades. None of them wanted Biden as Obama's alternative.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-15T12:26:41+00:00","tweet":"Joseph \"Creepy Joe\" Biden Failure are a Member of Congress for 30plus years. Failure as a Vice President for eight. What makes any one think his policies-which have been enormous failures for over 40 years--will bring this Republic success and prosperity?? Keep America moving??","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-05-14T20:08:02+00:00","tweet":"I can't barely wait for President Joseph R Biden come 2020, 2020 not coming soon enough, save us Joe Biden, man save us and save this country. Biden#2020","name":"joseph joe biden","Sentiment":0.025},{"date":"2019-05-10T20:30:28+00:00","tweet":"1. Here's a few instances of #JoeB's interaction with young girls well documented, and compiled by Paul Joseph Watson: Ex-Secret Service Agent Claims Joe Biden Engaged in 'Weinstein-Level' Groping — Paedophilia Questions Raised never-@joebiden","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-05-09T23:47:01+00:00","tweet":"When the [bankruptcy] bill finally passed, in 2005, then-Senator Joseph Biden was one of its biggest backers. “Senators like Joe Biden should not be allowed to sell out women in the morning and be heralded as their friend in the evening,” @ewarren wrote.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-08T13:49:02+00:00","tweet":"Joe Biden said that Black women don’t talk to their babies. How then was I reading at 3, Joseph Robinette?","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-06-05T14:24:34+00:00","tweet":"Joseph Robinette Biden Jr. an American politician who served as the 44th Vice President of the U.S. from 2009 to 2017. Biden represented Delaware in the U.S. Senate from 1973 to 2009 and has a long evolution on abortion rights. #2020Election #Biden2020 @JoeBiden","name":"joseph joe biden","Sentiment":-0.025},{"date":"2019-06-04T14:16:35+00:00","tweet":"An Idea Whose Time Has Come? Joe Biden, Primary Donald Trump as a Republican - SOME MORE NEWS [VIDEO]: In this week's episode, we discuss Joseph Robinette Biden, Jr. and why he needs to run for president as a Republican against Donald Trump.… LiGrFballs","name":"joseph joe biden","Sentiment":0.45},{"date":"2019-05-31T23:30:43+00:00","tweet":"\"11 innocent lives cut down. 11 futures denied.\" Joseph Biden (5\/31\/2019) Presumably Joe is referring to aborted children.","name":"joseph joe biden","Sentiment":0.1722222222},{"date":"2019-05-31T18:16:58+00:00","tweet":"Unless Joe Biden or Al Franken or Bill Clinton are around!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-30T09:48:09+00:00","tweet":"JOE BIDEN ASKS FOR 10-YEAR-OLD GIRL’S ADDRESS, TELLS HER SHE’S “GOOD LOOKING” 🥴🤢🤮 Creepy Uncle Joe back up to his old tricks. 🤬 Paul Joseph Watson |","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-05-29T11:49:39+00:00","tweet":"Many see Joseph Robinette Biden Jr. aka Joe Biden aka Uncle Joe as the one able to rid our south of the border neighbours, USA, of their best ratings showman. Here's why. And, oh yeah, why 45 may well be a... …","name":"joseph joe biden","Sentiment":0.6666666667},{"date":"2019-05-28T20:16:12+00:00","tweet":"More to the point: Joseph Biden has absolutely no history whatsoever of major engagement with education reform. For him to suggest that he has any plan at all is very suspicious - he should be questioned on his amazing and recent interest in education.","name":"joseph joe biden","Sentiment":0.2104166667},{"date":"2019-05-28T14:55:35+00:00","tweet":"FDR sided with a murderous dictator Joseph Stalin. Perception can be deceptive, besides Joe Biden is a dumbass sex pervert President Trump will chew him up and spit him out, no contest. 🇺🇸🇮🇱 …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-25T21:29:18+00:00","tweet":"Who is Joe Bidan? Any clue, @JoeBiden? Btw, I donated $5 to your campaign, sir, @JoeBiden. That is all that I could spare. Thank you for your service, Frmr. Vice President, Joseph Biden. DJT STILL occupying the White House?! haha That's prison, for him... constant surveillance!","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-05-25T07:29:28+00:00","tweet":"tru\"A thousand times stated a lie becomes a truth\" Joseph Goebbels. (could be the philosophy of @PressSec js}Thanks to @nytopinion @washingtonpost @SpeakerPelosi @RepJerryNadler @RepAdamSchiff @SenKamalaHarris @PeteButtigieg @JoeBiden @JoeNBC @morningmika Speaking the truth","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-20T10:04:57+00:00","tweet":"Fox is the network of White Supremacy. Period. There is no one who watches Fox News whose mind I'd want to change. It's like thinking going the Joseph Goebbels radio show would have been an effective idea back when. The 21st Century network of racists & Nazi excusers? Hard pass.","name":"joseph joe biden","Sentiment":0.0616666667},{"date":"2019-05-16T13:43:04+00:00","tweet":"When Joe Biden Voted to Let States Overturn Roe v. Wade Senator Joseph R. Biden Jr. in 1981. His changing record on abortion is getting fresh scrutiny as he considers running for president in a Democratic primary where women are expected to make... …","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-05-15T12:24:08+00:00","tweet":"Joseph \"Creepy Joe\" Biden Failure are a Member of Congress for 30plus years. Failure as a Vice President for eight. What makes any one think his policies-which have been enormous failures for over 40 years--will bring this Republic success and prosperity?? Keep America moving??","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-05-15T11:41:32+00:00","tweet":"'Hope and Change' and 'Fundamental Change' are code for Communism and the destruction of America! That makes Joseph Stalin Biden a TRAITOR in my books!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-14T19:22:45+00:00","tweet":"\"Make America Feel Good Again\" and Joe Biden in the same sentence..... **shudders** Nice way of combining @KyleKulinski \"Handsy Uncle Joseph\" and the same middle of the road nothingness that gave us Trump in the first place …","name":"joseph joe biden","Sentiment":0.2583333333},{"date":"2019-05-13T03:22:25+00:00","tweet":"Our next President of the United States, Joseph Biden. Trump’s one term mistake ends with Joe. Had Joe ran first time around it would have been his term. The man gave Trump this economy. Go Joe, go!","name":"joseph joe biden","Sentiment":0.15625},{"date":"2019-05-10T17:41:35+00:00","tweet":"“Rice would chair meetings—which brought together Brennan, Comey, Kerry, Clapper, Ash Carter, Jeh Johnson, Jack Lew, Loretta Lynch, Joseph Dunford, Denis McDonough, Lisa Monaco, Colin Kahl, Joe Biden’s national security adviser. (Kahl had to insist to Rice that he be allowed)”","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-10T09:04:44+00:00","tweet":"\"pre-Obama horrors\", for fuck sake Glenn, I think you've confused Joe Biden with Joseph Goebbels. You're getting more hysterical with each passing day.","name":"joseph joe biden","Sentiment":-0.325},{"date":"2019-05-09T08:23:40+00:00","tweet":"Yes we know @JoeBiden Margaret Thatcher. Winston Churchill. And Joseph Stalin called! We know.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-08T18:04:49+00:00","tweet":"WAIT! Wasn't he standing with unions the other day?","name":"joseph joe biden","Sentiment":-0.125},{"date":"2019-05-08T09:31:08+00:00","tweet":"Joe Biden 2020 campaign wins Baby #Boomers, Silent Generation Washington Times Former Vice President Joseph R. Biden has found a core constituency in the early stages of the 2020 Democratic nomination race: Baby Boomers a... via @60sfolks #seniors #1960s","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-05-07T18:13:09+00:00","tweet":"After \"The iron lady\" rang @JoeBiden With concerns about @realDonaldTrump we r super excited that he's appearing with Stan Laurel & Oliver Hardy with special guest appearance from Joseph Stalin on #SNL #Joe2020 #factsdontmatter #MAGA","name":"joseph joe biden","Sentiment":0.3551587302},{"date":"2019-05-06T12:13:59+00:00","tweet":"Joseph Biden Former Vice President Joe Biden has fallen foul of plagiarism several times throughout the years. He failed a course when he was in law school because he plagiarized a paper. According to the New York Times, Biden stated that he had \"used five pages from a published","name":"joseph joe biden","Sentiment":-0.0909090909},{"date":"2019-05-06T07:05:39+00:00","tweet":"Familiar playbook! “...the opening days of Joseph R. Biden Jr.’s third presidential campaign are giving some Democrats flashbacks to another presidential front-runner: Hillary Clinton.” Some Look at Joe Biden’s Campaign and See Hillary Clinton’s …","name":"joseph joe biden","Sentiment":0.234375},{"date":"2019-05-05T11:19:16+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson via @YouTube If Joe Biden is the favored demo candidate, then your party is hiding and covering for him. @SpeakerPelosi @SenSchumer @DemocraticParty @republicanparty @realDonaldTrump #metoo #MeToo","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-05-05T11:15:10+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson via @YouTube @JoeBiden @DemocraticParty @republicanparty @realDonaldTrump @SpeakerPelosi @SenSchumer No decent man puts his hands all over a little girl’s breast\/chest area. He is disgusting! #MeToo #metoo","name":"joseph joe biden","Sentiment":-0.4427083333},{"date":"2019-05-05T11:11:10+00:00","tweet":"Creepy Joe Biden Exposed By Paul Joseph Watson via @YouTube @JoeBiden @DemocraticParty @realDonaldTrump @republicanparty Women of all political parties, do not vote for this man! #MeToo #metoo #womenempowerment","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-05-02T12:25:17+00:00","tweet":"Joseph Robinette \"Beau\" Biden III (Feb 3, 1969 – May 30, 2015) was an American attorney, officer in the Army Judge Advocate General's Corps, politician fm Wilmington, Delaware. He was the eldest of 3 children from the marriage of fmr U.S. VP Joe Biden and first wife, Neilia Biden","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-05-01T18:36:35+00:00","tweet":"And how do you know that Trump is going to win? Have you heard of a man named Joseph [Joe] Biden? The 47th Vice President of The USA, That man may not be agreed by whole of the Democratic Party, But he has the SAME longshot as Obama did, And we already see a Biden Victory in 2020","name":"joseph joe biden","Sentiment":0.3333333333},{"date":"2019-04-30T08:27:49+00:00","tweet":"Truth over Lies, Truth over Lies, All the time Joe Biden stood behind Pres Obama never to challenge the lies esp Benghazi\/Obamacare\/Obama's fake aim workers like (Joe the Plumber, Samuel Joseph Wurzelbacher) in campaign for Pres & it shows the evil that lurked the @WhiteHouse.","name":"joseph joe biden","Sentiment":-0.6333333333},{"date":"2019-04-30T01:59:29+00:00","tweet":"Bijo m joseph and Joe Biden will be in the white doubt.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-26T11:07:36+00:00","tweet":"Former U.S. Senator, former U.S. Vice President & 2020 Presidential candidate Joseph \"Joe\" R. Biden !","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T23:29:12+00:00","tweet":"Figures just in: former Vice-President Joseph 'Joe' Biden 1st day donations: 1.4 billion dollars and the six media giants are all stars and rainbows for him. Chris Cuomo donated his aging dog, the one with the diamond collar. It's all over but the cryin'","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T22:36:53+00:00","tweet":"trump calls The honorable Joseph Biden “sleepy Joe”. Biden just might be a sleeping political giant.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T16:45:02+00:00","tweet":"Pretty disappointed Trump went with Sleepy Joe Biden for his nickname instead of the obviously superior Handsy Uncle Joseph","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-04-25T12:11:36+00:00","tweet":"Joe Biden Launches His Campaign on the Lie That Trump Said Neo-Nazis Were “Very Fine People” Paul Joseph Watson | Trump never referred to Charlottesville racists as \"very fine people\" - he specifically condemned them …","name":"joseph joe biden","Sentiment":0.5416666667},{"date":"2019-04-25T08:11:01+00:00","tweet":"Joseph Robinette \"Joe\" Biden, Jr. 2020 U. S. presidential run original expression expression …","name":"joseph joe biden","Sentiment":0.375},{"date":"2019-04-25T07:53:10+00:00","tweet":"Joseph Robinette Biden had the luxury to wait, and did. Here we go. Joe Biden Is the Front-Runner Over Democrats, and Donald Trump …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-25T05:51:57+00:00","tweet":"Where else would you start @JoeBiden announcement day but the Joseph R. Biden Jr Rail Station","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-23T14:54:30+00:00","tweet":"THESE MEN SUPPORT YOUR RIGHT TO BEAR ARMS: - George Washington - Thomas Jefferson - James Madison - Alexander Hamilton - Donald Trump THESE MEN OPPOSE IT - Adolf Hitler - Fidel Castro - Joseph Stalin - Vladimir Lenin - Joe Biden WHO DO YOU TRUST?","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-04-23T03:33:24+00:00","tweet":"While it may be surprising, Bernie Sanders (77) is only a single year older than Joseph “Joe” Biden (76). Their combined age is 153 years which is the exact amount of time since the South began reconstruction!","name":"joseph joe biden","Sentiment":0.221547619},{"date":"2019-04-19T20:02:20+00:00","tweet":"First of all, that isn't how this works, and if it were that stupid (it's close, don't worry), you think uniting behind Joseph \"handsy uncle Joe\" Biden would be wonderful? Gross.","name":"joseph joe biden","Sentiment":0.01},{"date":"2019-04-19T18:18:33+00:00","tweet":"@TheFive @JoeBiden is really none other than... Lex Luthor. Alexander Joseph Luthor. Ha! Who says politics can't be fun? @JesseBWatters @greggutfeld @DanaPerino @dbongino","name":"joseph joe biden","Sentiment":0.1145833333},{"date":"2019-04-19T18:13:06+00:00","tweet":"Joseph R. Biden, will you please go now ?! Go away Joe. #GoAwayJoe #NoWayJoe #NoBiden #NoJoe @JoeBiden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-19T17:45:42+00:00","tweet":"Joe Biden Begins Taking Money for a 2020 Presidential Campaign - … - Former Vice President Joseph R. Biden Jr. has begun accepting financial donations for a 2020 presidential campaign, an unambiguous sign that he intends to begin his challenge to Presid...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-17T01:07:05+00:00","tweet":"Joe Biden eulogizes the ‘constantly evolving’ Fritz Hollings as he looks toward 2020 As Joseph R. Biden Jr. mulls another run for the White House, the former vice president traveled to South Carolina to fulfill a duty that underscores his ties to... #USRC","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-16T14:10:00+00:00","tweet":"17. i saw every single one of my favorite bands, except bts, but i'll see them in june 18. passenger, jamie campbell bower, joseph morgan 19. i am currently reading the autobiography of joe biden (he's one of my favorite people in the world) 20. lavender","name":"joseph joe biden","Sentiment":0.2321428571},{"date":"2019-04-16T10:48:29+00:00","tweet":"“He did us a disservice in the last election,” said Mr. Schwartz, a longtime Clinton supporter who said he will support former Vice President Joseph R. Biden Jr\" who tf call Joe Biden that?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-16T06:14:56+00:00","tweet":"JOSEPH BIDEN IS ALL WASHED UP RUNS HIS MOUTH HE HAD HIS CHANCE AT BID FOR WHITE HOUSE AND BLEW IT OUR COUNTRY AND ITS PEOPLE SHOULD HAVE COME FIRST JOE DID NOT SEE IT THAT WAY .BY BY JOE .Primary problem? Seven times Joe Biden praised Republicans","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-04-14T11:59:02+00:00","tweet":"@JoeBiden Robert Biden Has Been used By Thee,46A3Aa3461666aftere;3r3(((Joseph AloisiousENT A3221 1PopeJohnPaulISAYSDavidNeww.wberNG.gggggggggggGG.ENTER.WAaaa'h'aleIsALIVE.aa1ERQ33onepoppepoppere","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-12T14:29:47+00:00","tweet":"Compare and contrast this with Cameron Joseph’s press release—I mean puff piece—about Kamala Harris at TPM","name":"joseph joe biden","Sentiment":-0.3125},{"date":"2019-04-11T13:24:57+00:00","tweet":"Gun Free Zones - Thank Joe Biden for them! The Gun-Free School Zones Act (GFSZA) is an act of the U.S. Congress prohibiting any ... Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE) on October 27, 1990; Passed the Senate on October 27, 1990 (passed voice vote) ..","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-04-09T16:49:41+00:00","tweet":"No that's just St. Joseph County Indiana and Cass County Michigan. Not berrien","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-08T00:19:32+00:00","tweet":"Ohh, easy peasy. Let’s start now, @SenhorRaposa, I hereby proclaim you a Republican state senator of Montana, you will replace Joseph Tropila, congrats!","name":"joseph joe biden","Sentiment":0.5416666667},{"date":"2019-04-07T12:17:08+00:00","tweet":"@joeBiden America is watching you. Who would want you to be our President. Only ppl. that think like you (Prevert).","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-04-07T00:16:49+00:00","tweet":"Being called #JoeBiden comes with immaturity & got to stop if to change. Joseph Robinette Biden Jr. tells women what they want to hear in this Twitter video defense of #BidenGropeTapes, then goes on a #comedy tour about it. #UncleJoe, just doesn’t get it. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-06T11:44:00+00:00","tweet":"Joe Biden is a good man. That’s not the only qualification to be President. Barack Obama was a great President. That doesn’t mean that a Vice President he clearly loved would be great. The question is whether or not he can work in today’s hyperpartisan environment. He can’t.","name":"joseph joe biden","Sentiment":0.4479166667},{"date":"2019-06-30T21:30:11+00:00","tweet":"Joe Biden's Vulnerabilities Become Warning Signs, Show Democratic Field is Still Wide Open - blackchristiannews: Joe Biden’s Vulnerabilities Become Warning Signs, Show Democratic Field is Still Wide Open Joseph R. Biden Jr. spoke at a labor...","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-06-28T01:27:39+00:00","tweet":"Lotta people out there tonight like \"WE DON'T FUCKING NEED JOE BIDEN! LET'S WIN THIS THING!\" Dude, you need Joe Biden. Maybe not this specific former VP Uncle Joseph Robinette Biden Jr., but you will need every Joe Biden you can get.","name":"joseph joe biden","Sentiment":0.0625},{"date":"2019-06-26T15:36:26+00:00","tweet":"IMO, the nickname thing gives men a subconscious advantage. Makes them seem like approachable, regular American etc. Joseph Biden —> Joe Biden Peter Buttigieg—> Pete Buttigieg Robert O’Rourke —> Beto O’Rourke Bernard Sanders—> Bernie Sanders","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-26T15:26:03+00:00","tweet":"(at full shouting volume) JOE BIDEN? JOSEPH BIDEN? JOE MOTHERFUCKING BIDEN!?","name":"joseph joe biden","Sentiment":0.4375},{"date":"2019-06-24T21:19:55+00:00","tweet":"Joe Biden said China is not our biggest enemy. I disagree with him about everything. China must be held accountable.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-23T03:02:37+00:00","tweet":"I'm convinced Joe Biden doesn't want to be president.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-20T21:31:54+00:00","tweet":"ok i’ll bite, who is joseph “joe” biden?","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-06-20T14:58:01+00:00","tweet":"THESE MEN SUPPORT YOUR RIGHT TO BEAR ARMS: - George Washington - Thomas Jefferson - James Madison - Alexander Hamilton - Donald Trump THESE MEN OPPOSE IT - Adolf Hitler - Fidel Castro - Joseph Stalin - Vladimir Lenin - Joe Biden - Bernie Sanders WHO DO YOU TRUST?","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-06-19T13:01:01+00:00","tweet":"\"progressive\" leftists are disciples of Joseph Goebbels & the big lie. Lyin’ Joe Biden: Not a ‘hint of a scandal’ during Obama administration? Let’s look back! …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-18T01:51:05+00:00","tweet":"First hero of the revolution: Joseph “Uncle Joe” Stalin Second hero of the revolution: Joseph “Uncle Joe” Biden","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-06-16T11:56:57+00:00","tweet":"Joe Biden on his dad, Joseph: \"As my father believed, there’s no higher calling for a woman or a man than to be a good mother or a good father\"","name":"joseph joe biden","Sentiment":0.425},{"date":"2019-06-14T16:24:40+00:00","tweet":"We have 2 plagiarists in the #Democratic race. @JoeBiden and @SenSanders. Bernie Sanders has stolen his agenda from Joseph Stalin's USSR Constitution in 1936. #SayNoToSocialism #MAGA …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-13T23:23:11+00:00","tweet":"We all knew creepy @JoeBiden was a plagiarist since Wayback when but the great one @marklevinshow points out @BernieSanders is plagiarizing stuff from Joseph Stalin. Everyone really needs to be re-tweeting this tweet.","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-06-13T09:01:20+00:00","tweet":"@JoeBiden Joe Biden reminds me of another Joe- Joseph Goebels. Just repeat a lie until your followers believe it.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-12T20:44:53+00:00","tweet":"“OPEN LETTER TO SCOTT BAIO & JOE BIDEN” by Donald Joseph Kingsbury @JoeBiden @ScottBaio","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-12T08:03:36+00:00","tweet":"Ex-Secret Service Agent Claims Joe Biden Engaged in ... … “He would mess with every single woman or teen. It was horrible.” By Paul Joseph Watson, Guest writer An ex-Secret Service agent is claiming that former Vice President Joe Biden engaged in “Weinst","name":"joseph joe biden","Sentiment":-0.2492857143},{"date":"2019-06-11T23:02:01+00:00","tweet":"Joseph Biden - The Miracle Healer. Hallelujah! The world has been waiting for a long time for the cancer cure. Wait no longer. Here comes Joe Biden. Wow! @JoeBiden @realDonaldTrump","name":"joseph joe biden","Sentiment":0.0375},{"date":"2019-06-11T18:39:34+00:00","tweet":"Some Look at Joe Biden’s Campaign and See Hillary Clinton ... … May 06, 2019 · Some Look at Joe Biden’s Campaign and See Hillary Clinton’s Image Hillary Clinton and Joseph R. Biden Jr. at a campaign rally for Mrs. Clinton in Scranton, Pa., in","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-07T06:38:49+00:00","tweet":"Sorry I meant Joseph Stalin, not Joe Biden.","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-07-03T00:04:04+00:00","tweet":"And we wonder why our debt keeps going up! We will never get that money back!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-01T13:31:53+00:00","tweet":"I can only dream of doing that","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-29T19:26:54+00:00","tweet":"Joe ... I shouldn't be at all surprised, and I'm not, but tears are still streaming down my face. You have just shown what you mean by \"working together to get things done\" ... You're my first, my last, my always Joseph Robinette Biden!","name":"joseph joe biden","Sentiment":-0.0236111111},{"date":"2019-06-29T13:41:19+00:00","tweet":"\"What (Just) Happened\" by Joe Biden - Amazon's best seller \"Wha Juust Happs\" by Uncle Joe! - Millennial Edition \"What The Woke Happened\" by Joseph R Biden Jr - Centrists Choice Awards","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-06-27T22:10:37+00:00","tweet":"Joe Biden looking like Joseph Gordon-Levitt at the end of 500 Days of Summer when he realizes that the trip to Ikea actually sucked.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-27T22:09:46+00:00","tweet":"lmfaoooooo joe biden. the only presidential candidate to decide his own time was up on a debate stage ever. you're done now, joseph","name":"joseph joe biden","Sentiment":0.3},{"date":"2019-06-27T21:30:32+00:00","tweet":"Democratic presidential hopefuls former US vice president Joseph @JoeBiden and US Senator for Vermont @BernieSanders speak during the second #DemocraticDebate in Miami, Florida","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-25T13:31:46+00:00","tweet":"Why the #metoo movement must now be ignored. Liberals, Democrats, and feminists having ignored #metoo allegations against Bill Clinton Joe Biden Joseph Morrissey Cristina Garcia So, \"It's not sexual harassment when we do it\" hypocrisy has killed the movement.","name":"joseph joe biden","Sentiment":-0.225},{"date":"2019-06-25T08:39:32+00:00","tweet":"Why is the NYT referring to Joe Biden as Joseph R. Biden Jr., but none of the othe candidates by full names and middle initials? Shouldn’t Tim Ryan be Timothy J. Ryan, then? And, my god, Beto!?","name":"joseph joe biden","Sentiment":0.175},{"date":"2019-06-23T16:26:24+00:00","tweet":"“Joe Biden Sunday” —> “Joseph R. Biden on Sunday” (Yep, that’s our style for the former veep and 2020 hopeful.) #AmEditing","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-22T23:31:19+00:00","tweet":"He's went by Beto since childhood. That's like saying Joe Biden should go by Joseph.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-20T16:46:52+00:00","tweet":"* THESE MEN SUPPORT YOUR RIGHT TO BEAR ARMS: - George Washington - Thomas Jefferson - James Madison - Alexander Hamilton - Donald Trump * THESE MEN OPPOSE IT : - Adolf Hitler - Fidel Castro - Joseph Stalin - Vladimir Lenin - Joe Biden - Bernie Sanders WHO DO U TRUST??","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-06-20T11:19:47+00:00","tweet":"I googled Joe Biden's full name so I could mutter \"Joseph Robinette Biden Jr.!!\" under my breath in a tone of complete frustration","name":"joseph joe biden","Sentiment":0.3234375},{"date":"2019-06-19T21:53:24+00:00","tweet":"\"Eastland was particularly eager to mentor young members. One favorite over his last term was Joseph Biden....Aware that Biden shared his opposition to busing...\" - from Big Jim Eastland Godfather of Mississippi …","name":"joseph joe biden","Sentiment":0.1533333333},{"date":"2019-06-17T22:35:54+00:00","tweet":"account tweeting in good faith calls joe biden Joseph","name":"joseph joe biden","Sentiment":0.7},{"date":"2019-06-17T14:13:54+00:00","tweet":"These Democrats have completely destroyed the #metoo movement. Because these politicians are supported by Democrats, women, and feminists the movement is dead. Joe Biden Joseph Morrissey Cristina Garcia I will yawn at any future accusations from the #metoo movement. #Hypocrisy","name":"joseph joe biden","Sentiment":-0.0333333333},{"date":"2019-06-16T11:31:08+00:00","tweet":"Perhaps Bernie Sanders quoting from the Joseph Stalin playbook? Or maybe Joe Biden who steals everyone else's lame \"s? Or a fake Indian? Who knows maybe even Spartacus himself? But certainly not someone that carried an inflatable mattress for the 1st 2 years of her career?","name":"joseph joe biden","Sentiment":-0.369047619},{"date":"2019-06-13T18:20:19+00:00","tweet":"Joe Biden said that there was not 1 single scandal during the 8 yrs of Obama’s terms. This lie is often repeated by the Obamas. Hitler’s Minister of Propaganda, Joseph Goebbels said, “If you tell a lie big enough and keep repeating it, people will eventually come to believe it.”","name":"joseph joe biden","Sentiment":-0.0160714286},{"date":"2019-06-13T17:06:04+00:00","tweet":"Just for extra context, Joe Biden's son Joseph III passed away from Brain cancer in 2015. He simply wants to make cancer research a signature issue in his campaign. It's really not something realistic to promise in a campaign speech though. …","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-06-12T17:18:53+00:00","tweet":"Definitely Joe Strummer at 1, Joseph Albers at 2 and between 2 and wherever Joe Biden is, I'd insert Shoeless Joe Jackson. Yes, I said it. I prefer him to Biden.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-12T16:56:04+00:00","tweet":"\"Repeat a lie\".....Joseph Goebbels, Joe Isuzu, Baghdad Bob and now Joe Biden.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-12T13:17:34+00:00","tweet":"I see his Majesty King Joseph has condescended to bestow his majestic presence on the masses.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-11T15:45:11+00:00","tweet":"#politics #government Joe Biden dings President Trump in Iowa: OTTUMWA, Iowa — Former Vice President Joseph R. Biden on Tuesday made his second trip as a presidential candidate to Iowa ahead of its first-in-the-nation caucus, see","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-11T03:50:23+00:00","tweet":"You’re talking about Joseph Kennedy and his son, Ted, right? Or Joe Biden’s son, right?","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-06-10T23:29:55+00:00","tweet":"Tell the whole story Ibram. Joe \"Foot in the Mouth\" Biden @JoeBiden want so-called Black America to forget his position on Desegregation in Delaware and his being one of the architects on the 1994 Crime Bill with both Jesse Helm & Strom Thurmond. Bye Joseph Robinette!","name":"joseph joe biden","Sentiment":-0.0041666667},{"date":"2019-06-10T07:04:50+00:00","tweet":"Barack hasn't received his paycheck in the mail @JoeBiden to be considered a true Dem friend. You know how this works Joe amongst \"Best Friends\"","name":"joseph joe biden","Sentiment":0.675},{"date":"2019-06-09T13:59:54+00:00","tweet":"Please retire Joseph!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-08T23:16:23+00:00","tweet":"this cute shit don’t work in 2019 Joseph","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-06-08T15:57:54+00:00","tweet":"Monica here is where we need to go. An electricity producing generator that ONLY uses magnets to turn it's turbine! You can live ANYWHERE with one of these providing your power. No wind, NO FOSIL FUEL! Please watch this viddy of Joseph Newman thankyou! … …","name":"joseph joe biden","Sentiment":0.1065340909},{"date":"2019-06-07T13:17:47+00:00","tweet":"Why would we start with that, buddy? You posted a fake pic. You spread disinformation. Joseph Goebbels would be proud.","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-06-07T12:42:21+00:00","tweet":"What ticket? How about 2018 tickets? Andrew Gillum Sanjay Patel Stacey Abrams Jesus Garcia Ben Jealous David Garcia Barbara Lee Carlos Guillermo Smith Jumaane Williams Jovanka Beckles Dotie Joseph","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-07T12:06:48+00:00","tweet":"Joe Biden plagiarism threatens 2020 bid, recalls failed 1988 ... … Jun 05, 2019 · Charges of plagiarizing policy documents piled up Wednesday against former Vice President Joseph R. Biden, putting the 2020 frontrunner's campaign on defense in a replay of the","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-06-07T09:18:43+00:00","tweet":"Joseph running his campaign like it’s 1998. Nothing has been flawless. He appears to be coasting.","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-06-07T07:12:54+00:00","tweet":"Joseph, Give Up.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-07T00:56:07+00:00","tweet":"Joe 2-1-3 Joseph 2-8-1 The 2 is the most truth challenged. I wonder when was the last time he told the actual truth.","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-06-07T00:34:48+00:00","tweet":"@JoeBiden what else can we get you to flip flopping on old handsy Joseph?","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-06-04T05:17:03+00:00","tweet":"Joseph Sabino Mistick: Joe Biden may be antidote for those sick of fighting via @TribLIVE","name":"joseph joe biden","Sentiment":-0.7142857143},{"date":"2019-06-03T09:22:12+00:00","tweet":"AMERICA 2020 Be VERY careful I DO NOT LIKE Joseph Biden or Bernie, Kamala, Warren, Booker, Gillibrand etc. BERNIE SANDERS Showed socialist USA they want HOW Joe Biden stayed out of their Group Hug. BERNIE Says Biden should be with Group Do you want to be told what to do","name":"joseph joe biden","Sentiment":-0.13},{"date":"2019-05-31T09:28:25+00:00","tweet":"I am honored to have been named to a major leadership role in Joseph R. Biden,Jr.’s presidential campaign! #CedricRichmond @JoeBiden @nytimes … #NewYorkTimes #JoeBiden #Biden2020 #PresidentialElection","name":"joseph joe biden","Sentiment":0.078125},{"date":"2019-05-31T04:44:09+00:00","tweet":"Laurel Federbush stating her opposition to Joseph (Joe) Biden …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-29T12:15:00+00:00","tweet":"2020 Democrat Frontrunner @JoeBiden Asks For 10-Year-Old Girl’s Address, Tells Her She’s “Good Looking” Creepy Uncle Joe back up to his old tricks. via Paul Joseph Watson @PrisonPlanet …","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-05-29T08:37:22+00:00","tweet":"Praying for Joe Biden's soul that he will have conversion and not be a hypocrite! Your job is not worth YOUR soul Joe Biden! Saint Joseph please intercede for his metanoia AMEN️ …","name":"joseph joe biden","Sentiment":-0.1875},{"date":"2019-05-28T19:39:32+00:00","tweet":"Joseph Robinette „Joe” Biden does not sniff Serbian people too. He just has only one sniff in his nose! And its smell of money!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-28T14:21:06+00:00","tweet":"Instead of having the courage to say the same thing now that Joe Biden said many years ago, Donald Trump will say, \"AHA!!!!! Joseph Biden is a RACIST!!!!,\" and try to distance himself from the same beliefs. I agree with the old Joe Biden.","name":"joseph joe biden","Sentiment":0.275},{"date":"2019-05-25T20:03:16+00:00","tweet":"Joe Biden; proper noun Spelling: J - O - E - B - I - D - E - N Used it in a sentence: The name of the former 47th Vice President of the United States is Joe Biden, not in fact, Bidan. Synonym: Mr Vice President, Mr Biden, Joseph Robinette Biden Jr. Antonym: Bidan","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-23T13:34:43+00:00","tweet":"Are you ready @JoeBiden when God calls you home! @Pontifex #OurLadyOfGuadlupe Protectress of the Unborn, pray for Joe Biden & unborn. Shameful Bishop! Biden and his wife are both Roman Catholics and regularly attend Mass at St. Joseph’s on the Brandywine in Greenville, Delaware.. …","name":"joseph joe biden","Sentiment":0.15625},{"date":"2019-05-23T01:09:41+00:00","tweet":"Joseph \"Uncle Joe\" Biden and Family - Joe the alleged #Catholic who promotes abortion and for whom feminism is an ideological and political necessity‼️ …","name":"joseph joe biden","Sentiment":-0.0333333333},{"date":"2019-05-19T07:23:01+00:00","tweet":"\"Give me the media and I will make of any nation a herd of swine” — Joseph Goebbels. We’ll Simply Assume, as the American Propagandists, would Prefer, @JoeBiden, was Absent During the Hero of Zero’s “Scandal Free” Eight (8) Years. …","name":"joseph joe biden","Sentiment":0.225},{"date":"2019-05-18T10:59:27+00:00","tweet":"\"Hey, don't worry bout --MAMA's gonna Make America Moral Again\" - Joseph \"Ms. Joe Joe\" Biden, circa 2020","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-16T17:09:54+00:00","tweet":"Joseph Biden IS the reason the US House of Representatives never preferred charges against Barack Obama. Everyone in Congress had worked with Joe Biden for decades. None of them wanted Biden as Obama's alternative.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-15T12:26:41+00:00","tweet":"Joseph \"Creepy Joe\" Biden Failure are a Member of Congress for 30plus years. Failure as a Vice President for eight. What makes any one think his policies-which have been enormous failures for over 40 years--will bring this Republic success and prosperity?? Keep America moving??","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-05-14T20:08:02+00:00","tweet":"I can't barely wait for President Joseph R Biden come 2020, 2020 not coming soon enough, save us Joe Biden, man save us and save this country. Biden#2020","name":"joseph joe biden","Sentiment":0.025},{"date":"2019-05-10T20:30:28+00:00","tweet":"1. Here's a few instances of #JoeB's interaction with young girls well documented, and compiled by Paul Joseph Watson: Ex-Secret Service Agent Claims Joe Biden Engaged in 'Weinstein-Level' Groping — Paedophilia Questions Raised never-@joebiden","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-05-09T23:47:01+00:00","tweet":"When the [bankruptcy] bill finally passed, in 2005, then-Senator Joseph Biden was one of its biggest backers. “Senators like Joe Biden should not be allowed to sell out women in the morning and be heralded as their friend in the evening,” @ewarren wrote.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-05-08T13:49:02+00:00","tweet":"Joe Biden said that Black women don’t talk to their babies. How then was I reading at 3, Joseph Robinette?","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-05-08T09:31:08+00:00","tweet":"Joe Biden 2020 campaign wins Baby #Boomers, Silent Generation Washington Times Former Vice President Joseph R. Biden has found a core constituency in the early stages of the 2020 Democratic nomination race: Baby Boomers a... via @60sfolks #seniors #1960s","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-08-06T17:36:17+00:00","tweet":"Joe Biden's nicknames: Joe \"Handsy Uncle Joseph\" Biden Joe \"Sleepy Joe\" Biden Joe \"Millenials should get up and do something if they're gonna complain but I'm not gonna let them fundamentally change anything if I'm in office!\" Biden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-06T15:02:13+00:00","tweet":"August 6, 2019 - Warren Up, Harris Down, But Biden Leads Among U.S. Dems Quinnipiac University National Poll Finds; 14 Dems Have Less Than 1 Percent Former Vice President Joseph Joe Biden retains his front-runner... …","name":"joseph joe biden","Sentiment":-0.1074074074},{"date":"2019-08-04T17:35:40+00:00","tweet":"Another gun-free zone. One of Joe Biden's more stupid ideas, violating Rule One of deterrence - keep your opponents guessing. Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE) on October 27, 1990","name":"joseph joe biden","Sentiment":-0.15},{"date":"2019-08-02T17:38:18+00:00","tweet":"Do you like gay marriage? Thank @JoeBiden for fast tracking that. Anyone who doubts the progressive credentials of Joseph Robinette Biden must’ve missed his eight years as the most progressive Vice President in our nation’s history.","name":"joseph joe biden","Sentiment":0.3722222222},{"date":"2019-08-01T15:05:03+00:00","tweet":"Did you know @JoeBiden’s middle name is a girls...Joseph Robinette Biden Jr. #FactsMatter... #SCOTUS #POTUS45 #PresidentT @DonaldJTrumpJr @realDonaldTrump @parscale @GOPLeader @WhiteHouse @SecretService","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-31T23:37:40+00:00","tweet":"Joe Biden closes debate with ‘Joe 30330’ gaffe: DETROIT — Former Vice President Joseph R. Biden came into the...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-28T17:57:33+00:00","tweet":"The Candace Owens Show: Paul Joseph Watson via @YouTube @BernieSanders @Joe Biden @CoryBooker @PeteButtigieg @JulianCastro @SenGillibrand @KamalaHarris @GovInslee @AmyKlobuchar @BetoORouke @SenWarren @AOC @IlhanMN","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-26T15:49:58+00:00","tweet":"Please do, Handsy Uncle Joseph. Roast Kamala Harris, Joe Biden, And that one M I L F","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-26T12:21:21+00:00","tweet":"\"A June 11 Quinnipiac poll showed Trump losing 40-53 to Joe Biden...\" Today: \"...Joseph Biden leads President Donald Trump 50 - 42 percent in swing state of Ohio, only leading Democratic candidate to top the Republican incumbent\" You've gained 5 points! This is awesome Sir!","name":"joseph joe biden","Sentiment":0.5416666667},{"date":"2019-07-24T11:49:35+00:00","tweet":"Yeah, that's not going to fly. Sorry. People who supported it back then can admit they were wrong. Biden should too.","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-07-24T10:32:57+00:00","tweet":"will they forget this Joe #Biden's family owned African #slaves - TRUTH FIRST … Aug 27, 2008 - Joe Biden's family owned African slaves. Joe Biden's great-grandfather Joseph J. Biden (1828 - 1880) was a slave-owner and fought for the ...","name":"joseph joe biden","Sentiment":0.0833333333},{"date":"2019-07-22T20:03:37+00:00","tweet":"I’m a Democrat, Bernie would never get my vote, he’s not a Democrat. Not a fan of Warren or Harris. My vote will be for Joseph Robinette (Joe) Biden Jr., or no one!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-21T08:54:17+00:00","tweet":"Interesting they put the next President, The Honorable Joseph Robinette “Joe” Biden Jr., between two African Americans. No chance Booker, and lying on her back Harris! I’m Black, and my loyalty, trust, and vote will be for Joe Biden. #BIDEN2020","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-07-18T19:16:17+00:00","tweet":"Man I dont know. I promise I’m tryin real hard to get the reference but when I googled uncle joe I came up with joe Biden, Joseph Stalin and this -","name":"joseph joe biden","Sentiment":-0.4375},{"date":"2019-07-18T16:11:55+00:00","tweet":"However, I agree with Ann Coulter, Joseph Biden is President Donald Trump's most serious rival. Joe Biden has taken a leave of absence from his Visiting Professor position at the University of Pennsylvania, without any pay.","name":"joseph joe biden","Sentiment":0.0513888889},{"date":"2019-07-17T13:16:23+00:00","tweet":"Via The Washington Examiner's Joseph Simonson, former Vice President Joe Biden's campaign hired a prominent speech coach the day after the last Democratic... …","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-07-17T08:12:59+00:00","tweet":"#NEWS: @QuinnipiacPoll shows @KamalaHarris rise in California, as poll asst. dir. says \"Harris leaps from promising contender to prominent player putting her neck and neck with former Vice President Joseph Biden\" @JoeBiden …","name":"joseph joe biden","Sentiment":0.2333333333},{"date":"2019-07-16T04:33:27+00:00","tweet":"@JoeBiden Please Sir Joe Biden help give a stronger voice to find Sadie Roberts-Joseph killer","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-15T18:57:14+00:00","tweet":"THIS JUST IN: Bernie isn’t Sanders’ first name Neither is Pete Buttigieg’s.. Joe Biden’s.. Bill Clinton’s... Basically any president\/candidate in history w\/ the name Pete (Peter), Bill\/Will (William), Joe (Joseph), Tim (Timothy), Steve (Steven), Jim (James), Rick (Richard)....","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-07-15T12:44:48+00:00","tweet":"hi you’re a fucking liar joseph","name":"joseph joe biden","Sentiment":-0.6},{"date":"2019-08-05T16:55:53+00:00","tweet":"When he started getting big, I just assumed Joe Budden chose his rap name to be a humorous, topical Joe Biden + weed mash-up. But no, his parents literally just named him Joseph, and his surname is Budden, and it was coincidence he got big during the Obama\/Biden years.","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-08-04T19:39:30+00:00","tweet":"And we'd dump idiots like Biden as well. Another gun-free zone. One of Joe Biden's more stupid ideas, violating Rule One of deterrence - keep your opponents guessing. Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE) on October 27, 1990","name":"joseph joe biden","Sentiment":-0.3666666667},{"date":"2019-08-02T11:11:02+00:00","tweet":"A right-wing healthcare plan designed by the @Heritage Foundation. Thanks a lot, Handsy Joseph.","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-07-31T22:03:16+00:00","tweet":"Joe Biden, to himself right now: “ Go, go go Joseph, you know what they say Hang on now, Joseph, you'll make it some day. Don't give up, Joseph, fight till you drop”","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-07-26T15:48:42+00:00","tweet":"I finally agree with her! James Clapper John Brennan James Comey Rod Rosenstein Robert Mueller Andy McCabe Peter Strzok Joe Pientka Andrew Weissman Glenn Simpson Christopher Steele Joseph Mifsud Alexander Downer Stefan Halper Sidney Blumenthal Cody Shearer Harry Reid Joe Biden …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-25T17:27:57+00:00","tweet":"Joe Biden is calling Joseph of CBC laboratories America's most wanted lab guy in the history of Americana and yet his lovely wife Bonzo insisted that he is a stand up guy who achieves greatness with his schematic designs and yet Senator Clinton was the self appointed czar once","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-07-25T14:12:58+00:00","tweet":"@esaagar Joseph R. Biden. The poll out just today days Joe bests Trump in Ohio 50 to 42! No other candidate beats Trump in Ruby red Ohio! Joe Biden has the background and history to peel many, many votes from Trump and Republicans. You and others know this, so you try and kill","name":"joseph joe biden","Sentiment":0.265625},{"date":"2019-07-24T12:23:23+00:00","tweet":"Interesting how they all skip over the root causes and systemic design implemented to oppress black communities. Common sense says these oppressive measures juxtaposed with funneling drugs, alcohol and guns into black communities would create an ‘epidemic of violence.’","name":"joseph joe biden","Sentiment":-0.0333333333},{"date":"2019-07-24T11:50:52+00:00","tweet":"This right here!","name":"joseph joe biden","Sentiment":0.3571428571},{"date":"2019-07-24T11:41:35+00:00","tweet":"actually that is exactly why he would have picked him","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-07-24T11:40:01+00:00","tweet":"Well. Obama picked Biden because he's a white guy and he needed someone like Biden to win. I don't think his civil rights record figured into it.","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-07-24T11:38:40+00:00","tweet":"Shocker, Biden attempts to use Obama as a shield. Not getting tired of this at all!","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-07-22T09:04:22+00:00","tweet":"Joe Biden is en route to a Joseph Travis experience.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-16T02:46:32+00:00","tweet":"Wow, just realised here that Joe Biden is a Joseph Jr. too. Look @jjsipalan ! …","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-07-15T15:10:47+00:00","tweet":"It wouldn't be starting over, Joseph. Medicare has been around for a LOOOOOOONG time.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-12T08:25:03+00:00","tweet":"Vice President Joseph Biden, one of the Democratic presidential candidates, this week publicly disclosed his finances. It turns out that he and his spouse are what used to be a relatively rare thing: higher-education millionaires. @JoeBiden @DrBiden","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-07-09T22:16:16+00:00","tweet":"What a joke! No one on the world stage respected the Obama\/Biden administration's \"lead from behind\" foreign policy which emboldened our enemies and weakened our friends. It was a complete and utter failure.","name":"joseph joe biden","Sentiment":-0.1483333333},{"date":"2019-07-09T18:51:51+00:00","tweet":"Maybe we don’t want to go back to paying for nearly all of NATO costs and agreeing to bad trade deals. Been there, done that!","name":"joseph joe biden","Sentiment":-0.2583333333},{"date":"2019-07-09T17:10:41+00:00","tweet":"Does that mean prep for another world wide apology tour?","name":"joseph joe biden","Sentiment":-0.20625},{"date":"2019-07-09T17:03:16+00:00","tweet":"Oh! I can't hardly... \/is already asleep","name":"joseph joe biden","Sentiment":-0.2916666667},{"date":"2019-07-09T12:02:37+00:00","tweet":"Our beloved vice president is having a full-circle moment. Sure, he's run before, but that wasn't the right time. The time is NOW! Let's do what's in the best interest of our country and put our full support behind Joseph Robinette Biden, Jr. for POTUS. #teamjoe... let's go","name":"joseph joe biden","Sentiment":0.4178571429},{"date":"2019-07-07T14:48:40+00:00","tweet":"@JoeBiden is done! It's only a matter of time before he apologize for being named Joseph instead of Joe. Biden has failed to bring his A-game. Whomever is leading campaign must sit Candidate down & explain. This is NOT his father's America. History is judged by today's std🤯🥺 …","name":"joseph joe biden","Sentiment":-0.2185185185},{"date":"2019-07-06T11:44:00+00:00","tweet":"Joe Biden is a good man. That’s not the only qualification to be President. Barack Obama was a great President. That doesn’t mean that a Vice President he clearly loved would be great. The question is whether or not he can work in today’s hyperpartisan environment. He can’t.","name":"joseph joe biden","Sentiment":0.4479166667},{"date":"2019-06-30T21:30:11+00:00","tweet":"Joe Biden's Vulnerabilities Become Warning Signs, Show Democratic Field is Still Wide Open - blackchristiannews: Joe Biden’s Vulnerabilities Become Warning Signs, Show Democratic Field is Still Wide Open Joseph R. Biden Jr. spoke at a labor...","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-06-28T01:27:39+00:00","tweet":"Lotta people out there tonight like \"WE DON'T FUCKING NEED JOE BIDEN! LET'S WIN THIS THING!\" Dude, you need Joe Biden. Maybe not this specific former VP Uncle Joseph Robinette Biden Jr., but you will need every Joe Biden you can get.","name":"joseph joe biden","Sentiment":0.0625},{"date":"2019-06-26T15:36:26+00:00","tweet":"IMO, the nickname thing gives men a subconscious advantage. Makes them seem like approachable, regular American etc. Joseph Biden —> Joe Biden Peter Buttigieg—> Pete Buttigieg Robert O’Rourke —> Beto O’Rourke Bernard Sanders—> Bernie Sanders","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-26T15:26:03+00:00","tweet":"(at full shouting volume) JOE BIDEN? JOSEPH BIDEN? JOE MOTHERFUCKING BIDEN!?","name":"joseph joe biden","Sentiment":0.4375},{"date":"2019-06-24T21:19:55+00:00","tweet":"Joe Biden said China is not our biggest enemy. I disagree with him about everything. China must be held accountable.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-23T03:02:37+00:00","tweet":"I'm convinced Joe Biden doesn't want to be president.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-20T21:31:54+00:00","tweet":"ok i’ll bite, who is joseph “joe” biden?","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-06-20T14:58:01+00:00","tweet":"THESE MEN SUPPORT YOUR RIGHT TO BEAR ARMS: - George Washington - Thomas Jefferson - James Madison - Alexander Hamilton - Donald Trump THESE MEN OPPOSE IT - Adolf Hitler - Fidel Castro - Joseph Stalin - Vladimir Lenin - Joe Biden - Bernie Sanders WHO DO YOU TRUST?","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-06-19T13:01:01+00:00","tweet":"\"progressive\" leftists are disciples of Joseph Goebbels & the big lie. Lyin’ Joe Biden: Not a ‘hint of a scandal’ during Obama administration? Let’s look back! …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-18T01:51:05+00:00","tweet":"First hero of the revolution: Joseph “Uncle Joe” Stalin Second hero of the revolution: Joseph “Uncle Joe” Biden","name":"joseph joe biden","Sentiment":0.125},{"date":"2019-06-16T11:56:57+00:00","tweet":"Joe Biden on his dad, Joseph: \"As my father believed, there’s no higher calling for a woman or a man than to be a good mother or a good father\"","name":"joseph joe biden","Sentiment":0.425},{"date":"2019-06-14T16:24:40+00:00","tweet":"We have 2 plagiarists in the #Democratic race. @JoeBiden and @SenSanders. Bernie Sanders has stolen his agenda from Joseph Stalin's USSR Constitution in 1936. #SayNoToSocialism #MAGA …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-13T23:23:11+00:00","tweet":"We all knew creepy @JoeBiden was a plagiarist since Wayback when but the great one @marklevinshow points out @BernieSanders is plagiarizing stuff from Joseph Stalin. Everyone really needs to be re-tweeting this tweet.","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-06-13T09:01:20+00:00","tweet":"@JoeBiden Joe Biden reminds me of another Joe- Joseph Goebels. Just repeat a lie until your followers believe it.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-12T20:44:53+00:00","tweet":"“OPEN LETTER TO SCOTT BAIO & JOE BIDEN” by Donald Joseph Kingsbury @JoeBiden @ScottBaio","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-12T08:03:36+00:00","tweet":"Ex-Secret Service Agent Claims Joe Biden Engaged in ... … “He would mess with every single woman or teen. It was horrible.” By Paul Joseph Watson, Guest writer An ex-Secret Service agent is claiming that former Vice President Joe Biden engaged in “Weinst","name":"joseph joe biden","Sentiment":-0.2492857143},{"date":"2019-06-11T23:02:01+00:00","tweet":"Joseph Biden - The Miracle Healer. Hallelujah! The world has been waiting for a long time for the cancer cure. Wait no longer. Here comes Joe Biden. Wow! @JoeBiden @realDonaldTrump","name":"joseph joe biden","Sentiment":0.0375},{"date":"2019-06-11T18:39:34+00:00","tweet":"Some Look at Joe Biden’s Campaign and See Hillary Clinton ... … May 06, 2019 · Some Look at Joe Biden’s Campaign and See Hillary Clinton’s Image Hillary Clinton and Joseph R. Biden Jr. at a campaign rally for Mrs. Clinton in Scranton, Pa., in","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-11T15:45:47+00:00","tweet":"Jeez, I looked at the statement so quickly that I thought Presidential candidate Joseph Biden said --- Trump is an extraterrestrial threat... I paused, hesitated, said Oh Well to myself, then, I re-read the statement!","name":"joseph joe biden","Sentiment":0.4166666667},{"date":"2019-06-11T15:45:11+00:00","tweet":"#politics #government Joe Biden dings President Trump in Iowa: OTTUMWA, Iowa — Former Vice President Joseph R. Biden on Tuesday made his second trip as a presidential candidate to Iowa ahead of its first-in-the-nation caucus, see","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-06-11T03:50:23+00:00","tweet":"You’re talking about Joseph Kennedy and his son, Ted, right? Or Joe Biden’s son, right?","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-06-10T23:54:48+00:00","tweet":"I'm not a Bernie Sanders supporter, I'm talking about Joseph Biden and his horrible record as it relates to African Americans. I am not voting for him and I don't care how many pictures he takes with black women...","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-06-10T23:29:55+00:00","tweet":"Tell the whole story Ibram. Joe \"Foot in the Mouth\" Biden @JoeBiden want so-called Black America to forget his position on Desegregation in Delaware and his being one of the architects on the 1994 Crime Bill with both Jesse Helm & Strom Thurmond. Bye Joseph Robinette!","name":"joseph joe biden","Sentiment":-0.0041666667},{"date":"2019-06-10T07:04:50+00:00","tweet":"Barack hasn't received his paycheck in the mail @JoeBiden to be considered a true Dem friend. You know how this works Joe amongst \"Best Friends\"","name":"joseph joe biden","Sentiment":0.675},{"date":"2019-06-09T13:59:54+00:00","tweet":"Please retire Joseph!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-08T07:13:57+00:00","tweet":"There are only 2 candidates. Vice President Joseph R “Joe” Biden and Elizabeth Warren. The others are seriously a joke and a distraction. Even though I felt the Burn last time, the passion is not behind any other than Joe and Libby now. Either way USA gets a new Prez in 2020!","name":"joseph joe biden","Sentiment":-0.0146464646},{"date":"2019-09-07T00:56:40+00:00","tweet":"Hell yeah they are scared of Joe Biden, President Joseph R Biden. Biden 2020","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-05T16:22:19+00:00","tweet":"If the opposition disarms, well and good. If it refuses to disarm, we shall disarm it ourselves. Joseph Stalin ————— Stalin wants to take away your guns In 2019 so does: Joe Biden Cory Booker Beto “the fake Mexican” O’Rourke Kamala Harris Elizabeth “LYING INJUN” Warren @POTUS …","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-09-05T03:06:51+00:00","tweet":"Joe Biden could be vomiting up blood and pleading with Kamala Harris to give him a sponge bath and CNN would still be broadcasting a closeup of Bernie’s face with the chyron “when did you stop supporting Joseph Stalin?” …","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-08-31T21:49:31+00:00","tweet":"If (when!) @JoeBiden wins the election, do you think @realDonaldTrump will invite then President-Elect Joseph Biden to the White House as previous outgoing presidents have done? Do you think he'll leave a gracious, courteous & optimistic letter for President Biden? Be honest.","name":"joseph joe biden","Sentiment":0.2666666667},{"date":"2019-08-31T14:53:20+00:00","tweet":"Joe Biden, Joe Jackson, Joseph Stalin, Joe Dumars, Joey from Nsync. Its too many God Damn Joes..","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-29T13:56:06+00:00","tweet":"Since when did we start referring to Joe Biden as 'Joseph R. Biden Jr.'??? …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-26T16:07:49+00:00","tweet":"Is Joe #Biden the #Democrats best shot at beating Trump? Joseph Pinion and @DelegateMark weigh in on Biden's recent blunders and his ability to go head-to-head with @realDonaldTrump in #Election2020. @FoxFriendsFirst at 4am with @HeatherChilders …","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-25T16:08:03+00:00","tweet":"I love John McCain. I love Joe Biden. The words he spoke at Senator McCain’s memorial in Phoenix helped thousands of grieving mourners, and still do. God Bless the McCain family. God Bless Joseph R. Biden, Jr. God Bless the United States. 🇺🇸","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-24T16:41:59+00:00","tweet":"please do not fight the child joseph","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-22T21:22:36+00:00","tweet":"your team is desperately trying to get you out of the climate change debate. and you’re here pulling your classic “im the only one who cant beat trump” fear mongering CLIMATE CHANGE DEBATE NOW JOSEPH …","name":"joseph joe biden","Sentiment":-0.1444444444},{"date":"2019-08-12T12:38:34+00:00","tweet":"Joe Biden's great-grandfather Joseph J. Biden (1828 - 1880) was a slave-owner and fought for the Confederate States of America. The Biden family remained wealthy even after slavery was abolished, having a great deal of power and privilege even to this day Mr. Biden is corrupt.","name":"joseph joe biden","Sentiment":0.2666666667},{"date":"2019-08-12T11:56:23+00:00","tweet":"Exactly right! Those of us who love Joe Biden and believe in him let these charges regarding foibles just roll off the back. They are meaningless except that they waste everyone's time and take the pressure off Trump.🇺🇸","name":"joseph joe biden","Sentiment":0.0314285714},{"date":"2019-08-12T11:51:59+00:00","tweet":"If you stand in a small circle of people who like you & think the way you do, of course they're going to agree w\/ you & point out what they think are weaknesses regarding Joe Biden. But every time you speak in this way, the rest of us say, \"Integrity makes the man.\" 🇺🇸","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-08-12T10:48:37+00:00","tweet":"You are correct, but voters do care. Older voters love Joe Biden, because they know he will defend their right to be selfish. They will actually show up, and vote in the primaries. They will make Biden the Dem candidate, and we will get another 4 years of Trump.","name":"joseph joe biden","Sentiment":0.0904761905},{"date":"2019-08-12T09:53:28+00:00","tweet":"A media created story. Average voters don't care. This will be born out in the Morning Consult tracking poll tonight. Every week the media tries to create a story to knock Biden down, and it doesn't work. Just another week.","name":"joseph joe biden","Sentiment":-0.1351851852},{"date":"2019-08-12T09:50:08+00:00","tweet":"Lol. Jesus people. There are better choices than mentally failing Joe Biden","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-08-11T17:30:37+00:00","tweet":"Accuse the other side of that which you are guilty. Right out of the GOP Joseph Goebbels propaganda handbook.","name":"joseph joe biden","Sentiment":-0.1098214286},{"date":"2019-08-10T08:19:46+00:00","tweet":"Joe Biden is a sick man … true to Joesph McCarthy and Joseph Stalin","name":"joseph joe biden","Sentiment":-0.1821428571},{"date":"2019-09-06T18:52:41+00:00","tweet":"I’m not talking about Joe Biden, Joe Budden, Joe Manganiello, Jesus Mary & Joseph, I’m talking bout JOE MAMA","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-05T20:21:50+00:00","tweet":"What’s wrong with your eye, Joseph?","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-09-05T10:03:51+00:00","tweet":"Jesus Mary and Joseph. Charleston is getting pummeled and he is still tweeting about this. WHY IS HE THE PRESIDENT?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-03T14:55:38+00:00","tweet":"Listen I don’t like to get too political but I think Joe Biden would have a better chance at winning the contest if he changed his name to Joseph Boseph","name":"joseph joe biden","Sentiment":0.3333333333},{"date":"2019-09-01T17:51:02+00:00","tweet":"You're a special kind of stupid. If you want to point fingers at \"draft dodgers\", how about Bill Clinton, Joe Biden, Joseph Kennedy II, and Harry Reid just to name a few. They all received deferments, which seems to be your defining criteria for a draft dodger. Have you served?","name":"joseph joe biden","Sentiment":-0.0107142857},{"date":"2019-08-26T07:21:45+00:00","tweet":"Is Joe Biden the Democrats best shot at beating Trump? Joseph Pinion and Mark Levine weigh in on Biden's recent blunders and his ability to go head-to-head with Trump in 2020.@FoxFriendsFirst at 4am with @HeatherChilders …","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-25T01:00:10+00:00","tweet":"I don’t know why but seeing you call him joseph in all lowercase made me uncontrollably laugh","name":"joseph joe biden","Sentiment":0.3},{"date":"2019-08-24T17:53:57+00:00","tweet":"No! Fight the kid, Joseph! She's dangerous!","name":"joseph joe biden","Sentiment":-0.75},{"date":"2019-08-22T18:40:26+00:00","tweet":"Me when Joe Biden emails me to beg for money with a subject line of “Please, Joseph”","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-08-20T11:05:35+00:00","tweet":"This is Kenneth Lee McGinniss in Rehoboth Beach DE, I have been reaching out for help for some time now. I am the guy who former Vice President Joe Biden instructed Joseph Batluck former President of Teen Challenge to put military cameras in my eyes and a chip in my tooth","name":"joseph joe biden","Sentiment":-0.025},{"date":"2019-08-12T13:06:21+00:00","tweet":".@vicenews senior political reporter @cam_joseph writes that after a weekend of gaffes during former Vice President Joe Biden's longest swing to-date through Iowa, local Democrats are worried. @MSNBC @craigmelvin discusses the report …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-12T12:33:26+00:00","tweet":"To put it another way: General election voters DO NOT CARE about gaffes and mistakes like those of Biden. They care about the candidate's character. And that is why he continues to lead the field and Trump.","name":"joseph joe biden","Sentiment":0.05},{"date":"2019-08-12T11:31:23+00:00","tweet":"\"want to see him tighten things up — if he can\" - Maybe, maybe not. Biden has always been gaffe prone. Nothing likely to change. Let not perfect be the enemy of good.","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-08-12T11:30:05+00:00","tweet":"“But his gaffes” is the new “but her e-mails.”","name":"joseph joe biden","Sentiment":0.1363636364},{"date":"2019-08-12T11:22:09+00:00","tweet":"Remember all the blood of the school children shot since 1990 rests at the feet of Joe Biden!! (The Gun-Free School Zones Act (GFSZA) is an act of the U.S. Congress prohibiting any ... Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE)","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-12T09:49:14+00:00","tweet":"This is Joe's life. It's not going to change. Not a good candidate for us, for this reason and many many others.","name":"joseph joe biden","Sentiment":0.2166666667},{"date":"2019-08-12T09:43:40+00:00","tweet":"No old dudes. This was NOT what 2018 was about and it will not be what 2020 is about, either. Women own this time, women have paid dearly because of the theft of the 2016 election. Dump Trump; Select the Woman Candidate.","name":"joseph joe biden","Sentiment":0.275},{"date":"2019-08-09T06:39:55+00:00","tweet":"@RepJerryNadler Jerry Nadler stands with the three Joes … Joseph Stalin, Joesph McCarthy and Socialist Joe Biden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-08T23:06:38+00:00","tweet":"Still loving you Joe Biden, I love you a lot and I am standing with you to the very end, come Jan 2021, It's President Joseph Biden. I love You man. Biden 2020.","name":"joseph joe biden","Sentiment":0.45},{"date":"2019-08-08T08:37:01+00:00","tweet":"Yesterday in Iowa, as Trump goons rounded up Latinos in Mississippi like the Gestapo once rounded up those disfavored by the Nazis, @JoeBiden spoke w\/ the eloquence of a Delawarean Churchill in the best fashion of Joseph Welch’s query to an earlier fascist divider, Joe McCarthy.","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-07T20:49:56+00:00","tweet":"@BreitbartNews 3\/3 \" ... It thus becomes vitally important for the [party] to use all of its powers to repress dissent, for the truth is the mortal enemy of the lie, and thus by extension, the truth is the greatest enemy of the [party].” Joseph Goebbels, meet Joe Biden.","name":"joseph joe biden","Sentiment":0.7},{"date":"2019-08-06T17:36:17+00:00","tweet":"Joe Biden's nicknames: Joe \"Handsy Uncle Joseph\" Biden Joe \"Sleepy Joe\" Biden Joe \"Millenials should get up and do something if they're gonna complain but I'm not gonna let them fundamentally change anything if I'm in office!\" Biden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-06T15:02:13+00:00","tweet":"August 6, 2019 - Warren Up, Harris Down, But Biden Leads Among U.S. Dems Quinnipiac University National Poll Finds; 14 Dems Have Less Than 1 Percent Former Vice President Joseph Joe Biden retains his front-runner... …","name":"joseph joe biden","Sentiment":-0.1074074074},{"date":"2019-08-02T17:38:18+00:00","tweet":"Do you like gay marriage? Thank @JoeBiden for fast tracking that. Anyone who doubts the progressive credentials of Joseph Robinette Biden must’ve missed his eight years as the most progressive Vice President in our nation’s history.","name":"joseph joe biden","Sentiment":0.3722222222},{"date":"2019-08-01T15:05:03+00:00","tweet":"Did you know @JoeBiden’s middle name is a girls...Joseph Robinette Biden Jr. #FactsMatter... #SCOTUS #POTUS45 #PresidentT @DonaldJTrumpJr @realDonaldTrump @parscale @GOPLeader @WhiteHouse @SecretService","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-31T23:37:40+00:00","tweet":"Joe Biden closes debate with ‘Joe 30330’ gaffe: DETROIT — Former Vice President Joseph R. Biden came into the...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-28T17:57:33+00:00","tweet":"The Candace Owens Show: Paul Joseph Watson via @YouTube @BernieSanders @Joe Biden @CoryBooker @PeteButtigieg @JulianCastro @SenGillibrand @KamalaHarris @GovInslee @AmyKlobuchar @BetoORouke @SenWarren @AOC @IlhanMN","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-26T15:49:58+00:00","tweet":"Please do, Handsy Uncle Joseph. Roast Kamala Harris, Joe Biden, And that one M I L F","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-24T11:49:35+00:00","tweet":"Yeah, that's not going to fly. Sorry. People who supported it back then can admit they were wrong. Biden should too.","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-07-24T10:32:57+00:00","tweet":"will they forget this Joe #Biden's family owned African #slaves - TRUTH FIRST … Aug 27, 2008 - Joe Biden's family owned African slaves. Joe Biden's great-grandfather Joseph J. Biden (1828 - 1880) was a slave-owner and fought for the ...","name":"joseph joe biden","Sentiment":0.0833333333},{"date":"2019-07-22T20:03:37+00:00","tweet":"I’m a Democrat, Bernie would never get my vote, he’s not a Democrat. Not a fan of Warren or Harris. My vote will be for Joseph Robinette (Joe) Biden Jr., or no one!","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-21T08:54:17+00:00","tweet":"Interesting they put the next President, The Honorable Joseph Robinette “Joe” Biden Jr., between two African Americans. No chance Booker, and lying on her back Harris! I’m Black, and my loyalty, trust, and vote will be for Joe Biden. #BIDEN2020","name":"joseph joe biden","Sentiment":0.0666666667},{"date":"2019-07-18T19:16:17+00:00","tweet":"Man I dont know. I promise I’m tryin real hard to get the reference but when I googled uncle joe I came up with joe Biden, Joseph Stalin and this -","name":"joseph joe biden","Sentiment":-0.4375},{"date":"2019-07-17T13:16:23+00:00","tweet":"Via The Washington Examiner's Joseph Simonson, former Vice President Joe Biden's campaign hired a prominent speech coach the day after the last Democratic... …","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-07-17T08:12:59+00:00","tweet":"#NEWS: @QuinnipiacPoll shows @KamalaHarris rise in California, as poll asst. dir. says \"Harris leaps from promising contender to prominent player putting her neck and neck with former Vice President Joseph Biden\" @JoeBiden …","name":"joseph joe biden","Sentiment":0.2333333333},{"date":"2019-07-16T04:33:27+00:00","tweet":"@JoeBiden Please Sir Joe Biden help give a stronger voice to find Sadie Roberts-Joseph killer","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-15T18:57:14+00:00","tweet":"THIS JUST IN: Bernie isn’t Sanders’ first name Neither is Pete Buttigieg’s.. Joe Biden’s.. Bill Clinton’s... Basically any president\/candidate in history w\/ the name Pete (Peter), Bill\/Will (William), Joe (Joseph), Tim (Timothy), Steve (Steven), Jim (James), Rick (Richard)....","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-07-15T15:10:47+00:00","tweet":"It wouldn't be starting over, Joseph. Medicare has been around for a LOOOOOOONG time.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-15T13:45:16+00:00","tweet":"Joe Biden’s Health Care Plan Focuses on Shoring Up the Affordable Care Act - … - After remaining vague for months about his plans to expand on the Affordable Care Act, Joseph R. Biden Jr. is planning to offer more details in a speech Monday, including c...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-15T12:44:48+00:00","tweet":"hi you’re a fucking liar joseph","name":"joseph joe biden","Sentiment":-0.6},{"date":"2019-07-15T08:45:14+00:00","tweet":"How Joe Biden Became the Democrats’ Anti-Busing Crusader - … - NEWPORT, Del. — In July 1974, with a federal court in Delaware on the verge of ordering busing to integrate Wilmington’s overwhelmingly black public schools, Joseph R. Biden Jr. arrived at a...","name":"joseph joe biden","Sentiment":-0.0833333333},{"date":"2019-07-14T10:45:12+00:00","tweet":"Joe Biden Decides He Doesn’t Need to Stay Above the Fray After All - … - ATKINSON, N.H. — Joseph R. Biden Jr. spent the first months of his presidential campaign largely ignoring his nearly two dozen rivals, seeking to stay above the Democratic fray as ...","name":"joseph joe biden","Sentiment":0.0773809524},{"date":"2019-07-14T08:26:29+00:00","tweet":"Trump’s been trying for 2.5 years Joseph! Where are YOU\/Democrats?! “Manufactured Crisis”, Refuse Border Security Negotiations, Refuse Humanitarian Crisis\/Border Wall Funding, Perpetual OBSTRUCTION, Investigation v. Legislation, Enabling Migrants, Criminals, Propaganda News...","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-07-14T00:34:56+00:00","tweet":"Joseph all you are doing is copying AOC and K Harris. You’ve got to find something new. Old and boring.","name":"joseph joe biden","Sentiment":-0.2545454545},{"date":"2019-07-13T18:20:05+00:00","tweet":"Liberal activists bet Joe Biden drops out of race Liberal activists at the Netroots Nation convention are literally betting on former Vice President Joseph R. Biden dropping out of the Democratic presidential race. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-13T13:07:51+00:00","tweet":"Nobody tell him Bernie isn’t Sanders’ first name. Neither is Pete Buttigieg’s.. Joe Biden’s.. Bill Clinton’s... Basically any president\/candidate in history w\/ the name Pete (Peter), Bill\/Will (William), Joe (Joseph), Tim (Timothy), Steve (Steven), Jim (James), Rick (Richard)...","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-07-12T22:29:06+00:00","tweet":"Joe Biden's next DESPERATE ACT will be referring to himself as Joseph Hussein OBiden #SC #Democrats roflmao","name":"joseph joe biden","Sentiment":-0.3},{"date":"2019-07-12T08:25:03+00:00","tweet":"Vice President Joseph Biden, one of the Democratic presidential candidates, this week publicly disclosed his finances. It turns out that he and his spouse are what used to be a relatively rare thing: higher-education millionaires. @JoeBiden @DrBiden","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-07-11T16:40:50+00:00","tweet":"Joseph, Optimism? You are DELUSIONAL. Hope & a Smile? Really? Oh yeah... Then Pull Lever. Wait for Pixie Dust. You already CONFESSED, You are NOT a Leader. Barack said you are a Leader, then you are a Leader? Sorry Joseppy, A Leader does not require Confirmation or Poles","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-11T14:17:17+00:00","tweet":"Prof. Joseph Massad on ‘Nation Law: Israeli Apartheid State’ at Palestine Expo 2019 – Middle East Monitor … .@BernieSanders .@SenWarren .@ewarren .@TulsiGabbard .@TulsiPress .@BetoORourke .@JoeBiden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-11T14:08:34+00:00","tweet":"Joe Biden: Higher Education Millionaire - Education Next - EducationNext Vice President Joseph Biden, one of the Democratic presidential candidates, this week publicly disclosed his finances. It turns... | …","name":"joseph joe biden","Sentiment":0.0833333333},{"date":"2019-07-11T13:57:38+00:00","tweet":"Does that include killing and ethnically cleansing Palestinians?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-11T13:50:33+00:00","tweet":"remember when bush lied us into two different wars","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-11T13:50:25+00:00","tweet":"He is a sexual predator to boot.Just look to what statements he has made about \"pretty women\", \"young women\", \"committing adultery\", \"grabbing women genitals\" and on and on... Now look at his Sec. of Labor appt. he condones it ! And, the evangelical's of the Christian Church love","name":"joseph joe biden","Sentiment":0.2041666667},{"date":"2019-07-11T13:44:13+00:00","tweet":"they eventually supported the kurds (rightly) but only after sending arms to Islamist groups in their thirst to overthrow Assad","name":"joseph joe biden","Sentiment":0.1428571429},{"date":"2019-07-11T13:30:15+00:00","tweet":"Trump never offered up any details on how he was going to achieve his promises and voters didn’t care.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-07-11T13:22:44+00:00","tweet":"Sorry to say, that sounds sleepy. DT will wipe the floor with that message. There is one progressive voice who brings the Political Revolution to America.","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-10-09T16:43:21+00:00","tweet":"Decode B) We're talking plain text Joe Biden and POTUS calls him out JOSEPH BIDEN! Traitors visiting White House, sounds like Joe Biden as VP! Q then says about Sleepy Joe Biden. > There will be no recusal. > PANIC IN DC. > Q #EndWar #EndWars #QAnon #QArmy #svpol #WWG1WGA","name":"joseph joe biden","Sentiment":-0.1339285714},{"date":"2019-10-05T12:26:22+00:00","tweet":"Explain Joseph, how is Joe Biden “the definition of corruption”?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-02T12:15:06+00:00","tweet":"@JoeBiden They have one JOSEPH BIDEN JR. Joe Biden for President!🇺🇸","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-01T17:24:58+00:00","tweet":"@JoeBiden Accuse the other side of that which you are guilty. Joseph Goebbels, Nazi Propaganda Minister AND Joe Biden, swamp rat.","name":"joseph joe biden","Sentiment":-0.2416666667},{"date":"2019-09-27T12:05:44+00:00","tweet":"John Solomon has archived many documents which have leaked. Many leaked foreign documents implicates Joe Biden, George Soros, Hillary Clinton & Joseph Misfud's collusion and possible criminal activity in Ukraine. #FactsMatter #PatriotsAwakened …","name":"joseph joe biden","Sentiment":0.095},{"date":"2019-09-27T02:58:24+00:00","tweet":"Ukraine CONNECTION! — Cache of CONFIDENTIAL documents purportedly showing COLLUSION and possible CRIMINAL ACTIVITY by Joe Biden, Hillary Clinton, George Soros and Joseph Misfud!...NO SURPRISE!🤔🇺🇸#Q #QAnon #KAG #PatriotsAwakened #FactsMatter #WWG1WGA #TheGreatAwakeningWorldwide …","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-09-26T19:51:17+00:00","tweet":"BREAKING: A large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion and possible criminal activity in Ukraine. Download and start digging! ⬇️ …","name":"joseph joe biden","Sentiment":-0.1026785714},{"date":"2019-09-25T21:13:18+00:00","tweet":"So it wasn't his first time to run for PRESIDENCY! Joe Biden Withdraws 1988 Presidential Campaign. There is one less candidate in the race for the Presidency tonight, Delaware Senator Joseph Biden dropped out. @joebiden … …","name":"joseph joe biden","Sentiment":0.0729166667},{"date":"2019-09-24T22:22:56+00:00","tweet":"The writers of this movie really love irony. Not only are Dems defending America through impeachment, they are doing so under the premise that Joe Biden is the victim. Joe Biden. Joseph Robinette Biden.","name":"joseph joe biden","Sentiment":0.1416666667},{"date":"2019-09-24T00:45:05+00:00","tweet":"@JoeBiden Joe Biden bristles when cornered on Hunter’s business deals: ‘Ask the right questions!’ Former Vice President Joseph R. Biden was visibly upset over the weekend when Fox News' Peter Doocy asked him about his son Hunter Biden's business dealings in Ukraine.","name":"joseph joe biden","Sentiment":0.1785714286},{"date":"2019-09-23T17:57:52+00:00","tweet":"Joseph Robinette Biden Jr. aka Joe Biden @JoeBiden is an American politician who served as the 47th vice president of the United States from 2009 to 2017.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-22T12:22:00+00:00","tweet":"Ooppss! Peter Doocy seems to have \"Triggered Former Vice President Joe Biden\"! Oh, THAT just CAN'T be good when a Democrat Former Vice President starts Pointing his Finger At You! You all remember what happened when Joseph Stalin starting pointing HIS Finger at People?!","name":"joseph joe biden","Sentiment":0.175},{"date":"2019-09-22T10:27:48+00:00","tweet":"#QNN We interrupt your tweeting for this Play-by-play showing corrupt Presidential candidate @JoeBiden doing EXACTLY what he has falsely accused @realDonaldTrump of doing. Be seeing you Joseph! #WWG1WGA #JusticeIsComing …","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-09-19T23:31:22+00:00","tweet":"NOTORIOUS, DENTURE-LESS JOE BIDEN AMERICAN PATRIOTS KNOW WHAT YOU’VE BEEN HIDEN YOUR SON JOSEPH BIDEN CORRUPT TO THE CORE WHEN HE’S NOT DOING CRACK IN THE CAR HIS DADDY JOE DONE BUYED HIM! …","name":"joseph joe biden","Sentiment":-0.3125},{"date":"2019-09-16T06:00:21+00:00","tweet":"A piece of shit Joe Biden together with Kosovo Albanian terrorist leader Ramush Haradinaj and Joseph J. DioGuardi founder of the Albanian American Civic League, who has been lobbying Capitol Hill since the 1980s to promote the Greater Albania agenda & Kosovo Albanian terrorists.","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-09-13T00:53:06+00:00","tweet":"America's dad, Bernard \"Bernie\" Sanders, says that Julián \"Julian\" Castro's attack on Joseph \"Joe\" Biden's mental frailty was \"not right.\" Was it wrong of Castro?","name":"joseph joe biden","Sentiment":-0.2476190476},{"date":"2019-10-06T20:53:15+00:00","tweet":"Is Obama so clean and honest? Why Biden can tolerate the indulgence of the former president’s embarrassing strategy, but can’t accept that what Trump is doing now is a great decision for the United States? Joseph Robinette \"Joe\" Biden It’s not your fault your mouth is your fault","name":"joseph joe biden","Sentiment":0.4416666667},{"date":"2019-09-30T21:41:33+00:00","tweet":"Subpoenas8 Joseph Mifsud, Key to Russia Inquiry Large chunk of border wall funding diverted from tiny Guam, a strategic hub for US forces in the Pacific. A Ukrainian ex-prosecutor general said there is no reason for UKR to investigate Trump's political rival Joe Biden","name":"joseph joe biden","Sentiment":0.0528571429},{"date":"2019-09-30T06:31:24+00:00","tweet":"#Trump reportedly worked with 2 'off the books' lawyers Joseph #diGenova & Victoria #Toensing to pressure #Ukraine for damaging information about Joe #Biden, with help from #Rudy #Giuliani (see full thread Paul #Manafort & Dimtry #Firtash ) …","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-09-29T16:55:35+00:00","tweet":"In addition to Rudy Giuliani, Trump worked with two “off the books” lawyers to pressure Ukraine for damaging information about Joe Biden. Joseph diGenova and Victoria Toensing are two former federal prosecutors best-known for pro-Trump media appearances. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-26T22:49:34+00:00","tweet":"BREAKING: A large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion and possible criminal activity in Ukraine. Download and start digging! ⬇️ … INCOMING","name":"joseph joe biden","Sentiment":-0.1026785714},{"date":"2019-09-26T21:04:08+00:00","tweet":"Apologies for interrupting, but here’s a humongous document dump fingering Joe Biden, George Soros & Joseph Mifsud, among others. This may be the torpedo that sinks the Obama regime in the history books: …","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-09-24T19:00:00+00:00","tweet":"️ \"Chain gang\" Joe #Biden talkin' tough; first it's telling #Trump to meet him behind the bleachers; now it's chain wielding Joseph Biden at the swimming pool against a straight-razor wielding \"corn pop\". #MAGA #WalkAway #QAnon #Q","name":"joseph joe biden","Sentiment":-0.1796296296},{"date":"2019-09-24T16:49:55+00:00","tweet":"House Speaker Nancy Pelosi Whistleblower #ImpeachTrump Transcripts to be released .. DNI Joseph Maguire testifying Thurs .. TRUMP IS NOT GOING ANYWHERE! But THANK YOU for sinking Joe Biden & making it possible to charge him & Hunter Biden with a crime! …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-22T00:49:21+00:00","tweet":"Media outlets, especially national ones, Pick ONE WAY to name someone. Stop doing: Joe Biden Joseph Biden Joseph R. Biden AND Joseph R. Biden Jr. Literally, I promise, no one will be confused if you go with the simplest one. Especially national figures.","name":"joseph joe biden","Sentiment":-0.1333333333},{"date":"2019-09-20T15:45:10+00:00","tweet":"Ironic the Whistleblower who alleged @POTUS spoke inappropriatily or spoke on a matter w the Ukraine POTUS that he shouldn't have. Will bring a lazer focus on Joseph Biden, son of Joe Biden. Dad used his influence to shut down a probe regarding misdeeds of Joseph. Obama scandal🤔","name":"joseph joe biden","Sentiment":-0.0185185185},{"date":"2019-09-16T15:13:44+00:00","tweet":"1. Biden 2. Joe Biden 3. Joseph R. Biden 4. Biden, but wearing one of those masks that is glasses, a nose, and mustache. 5. Mayor Pete …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-13T10:09:31+00:00","tweet":"The NYT calling Joe Biden “Joseph R. Biden Jr.” is a hilarious attempt to make him sound like he’s not almost 80","name":"joseph joe biden","Sentiment":0.45},{"date":"2019-09-13T09:42:05+00:00","tweet":"@SykesCharlie priorities. Beware, Joseph R. Biden. You have a bullseye painted on your back! From the media, opposition colleagues, and worst of all, your own imperfections. God Speed, Joe Biden. God Speed.","name":"joseph joe biden","Sentiment":-0.1333333333},{"date":"2019-09-12T22:25:51+00:00","tweet":"Who said “Make sure you have the record player on at night”? Joseph Gordon-Levitt’s character in 500 Days Of Summer Your barista The band She & Him Urban Outfitters employee c. 2014 Joe Biden at the #DemDebate","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-09-12T21:49:24+00:00","tweet":"Maybe to pay for college? No. These princesse college students will never work.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T21:01:00+00:00","tweet":"I’m not going to have a dime left after this election.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:52:15+00:00","tweet":"Did Castro outright say, “you’re getting old”? That would be an outright, “naked attack”. He merely implied Biden was showing his age by forgetting what he had just said. Bernie is older too but he’s not flubbing like Biden has lately.","name":"joseph joe biden","Sentiment":-0.1066666667},{"date":"2019-09-12T20:46:01+00:00","tweet":"I was proud of the crowd.","name":"joseph joe biden","Sentiment":0.8},{"date":"2019-09-12T20:43:11+00:00","tweet":"His naked attack on Biden’s age was gross. He should apologize","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:41:11+00:00","tweet":"Uncalled for how? Biden literally tried to call out Bernie for not answering the question asked if him. And then said this was a hones debate that they owe the American people! Lol, it’s Okay for Biden to call out BS but no one can call him out?","name":"joseph joe biden","Sentiment":0.4333333333},{"date":"2019-09-12T20:40:34+00:00","tweet":"@jkempcpa yikes","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:40:21+00:00","tweet":"I loved Biden’s answer though. “That'd be a surprise to him”","name":"joseph joe biden","Sentiment":0.7},{"date":"2019-09-12T20:40:03+00:00","tweet":"Bad move. Big turn off","name":"joseph joe biden","Sentiment":-0.35},{"date":"2019-09-12T20:39:53+00:00","tweet":"Sickening attacks not debates.","name":"joseph joe biden","Sentiment":-0.9},{"date":"2019-09-12T20:39:05+00:00","tweet":"Nope, Castro. Nope.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:37:40+00:00","tweet":"That was gross and uncalled for","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:00:37+00:00","tweet":"Go Joe! No matter what happens tonight, we have your back! We know there is no one more qualified to move this country forward and repair the damage than the 46th President of the United States, Joseph Biden!","name":"joseph joe biden","Sentiment":0.3125},{"date":"2019-09-12T17:35:22+00:00","tweet":"On this day in 1987..Ironically.. Reports surfaced that Democratic presidential candidate Joseph Biden had borrowed, without attribution, passages of a speech by British Labour Party leader Neil Kinnock that prompted Joe Biden to drop his White House bid.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-11T21:09:02+00:00","tweet":"Joe Biden ‘inevitable nominee’ perception creates new challenge: HOUSTON — Democratic presidential front-runner Joseph R. Biden has proved remarkably...","name":"joseph joe biden","Sentiment":0.2954545455},{"date":"2019-09-10T22:45:23+00:00","tweet":"This is what makes @JoeBiden Joseph Robinet Biden. Commodities such as Compassion & Empathy, while tough to find, go a helluva long way anymore. #TheResistanceUnited! #TheResistanceRises …","name":"joseph joe biden","Sentiment":-0.150462963},{"date":"2019-09-10T09:07:39+00:00","tweet":"@JoeBiden not even close to a moderate, and don’t let him get “close” to your children. #CreepyUncleJoe IFB all #KAG Patriots 🇺🇸 Thank You Howard @vintperformance","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-08T07:13:57+00:00","tweet":"There are only 2 candidates. Vice President Joseph R “Joe” Biden and Elizabeth Warren. The others are seriously a joke and a distraction. Even though I felt the Burn last time, the passion is not behind any other than Joe and Libby now. Either way USA gets a new Prez in 2020!","name":"joseph joe biden","Sentiment":-0.0146464646},{"date":"2019-09-07T00:56:40+00:00","tweet":"Hell yeah they are scared of Joe Biden, President Joseph R Biden. Biden 2020","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-05T16:22:19+00:00","tweet":"If the opposition disarms, well and good. If it refuses to disarm, we shall disarm it ourselves. Joseph Stalin ————— Stalin wants to take away your guns In 2019 so does: Joe Biden Cory Booker Beto “the fake Mexican” O’Rourke Kamala Harris Elizabeth “LYING INJUN” Warren @POTUS …","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-09-05T03:06:51+00:00","tweet":"Joe Biden could be vomiting up blood and pleading with Kamala Harris to give him a sponge bath and CNN would still be broadcasting a closeup of Bernie’s face with the chyron “when did you stop supporting Joseph Stalin?” …","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-09-01T17:51:02+00:00","tweet":"You're a special kind of stupid. If you want to point fingers at \"draft dodgers\", how about Bill Clinton, Joe Biden, Joseph Kennedy II, and Harry Reid just to name a few. They all received deferments, which seems to be your defining criteria for a draft dodger. Have you served?","name":"joseph joe biden","Sentiment":-0.0107142857},{"date":"2019-08-31T21:49:31+00:00","tweet":"If (when!) @JoeBiden wins the election, do you think @realDonaldTrump will invite then President-Elect Joseph Biden to the White House as previous outgoing presidents have done? Do you think he'll leave a gracious, courteous & optimistic letter for President Biden? Be honest.","name":"joseph joe biden","Sentiment":0.2666666667},{"date":"2019-08-31T14:53:20+00:00","tweet":"Joe Biden, Joe Jackson, Joseph Stalin, Joe Dumars, Joey from Nsync. Its too many God Damn Joes..","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-29T13:56:06+00:00","tweet":"Since when did we start referring to Joe Biden as 'Joseph R. Biden Jr.'??? …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-26T16:07:49+00:00","tweet":"Is Joe #Biden the #Democrats best shot at beating Trump? Joseph Pinion and @DelegateMark weigh in on Biden's recent blunders and his ability to go head-to-head with @realDonaldTrump in #Election2020. @FoxFriendsFirst at 4am with @HeatherChilders …","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-25T16:08:03+00:00","tweet":"I love John McCain. I love Joe Biden. The words he spoke at Senator McCain’s memorial in Phoenix helped thousands of grieving mourners, and still do. God Bless the McCain family. God Bless Joseph R. Biden, Jr. God Bless the United States. 🇺🇸","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-08-24T16:41:59+00:00","tweet":"please do not fight the child joseph","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-22T21:22:36+00:00","tweet":"your team is desperately trying to get you out of the climate change debate. and you’re here pulling your classic “im the only one who cant beat trump” fear mongering CLIMATE CHANGE DEBATE NOW JOSEPH …","name":"joseph joe biden","Sentiment":-0.1444444444},{"date":"2019-08-12T12:38:34+00:00","tweet":"Joe Biden's great-grandfather Joseph J. Biden (1828 - 1880) was a slave-owner and fought for the Confederate States of America. The Biden family remained wealthy even after slavery was abolished, having a great deal of power and privilege even to this day Mr. Biden is corrupt.","name":"joseph joe biden","Sentiment":0.2666666667},{"date":"2019-08-12T11:56:23+00:00","tweet":"Exactly right! Those of us who love Joe Biden and believe in him let these charges regarding foibles just roll off the back. They are meaningless except that they waste everyone's time and take the pressure off Trump.🇺🇸","name":"joseph joe biden","Sentiment":0.0314285714},{"date":"2019-08-12T11:51:59+00:00","tweet":"If you stand in a small circle of people who like you & think the way you do, of course they're going to agree w\/ you & point out what they think are weaknesses regarding Joe Biden. But every time you speak in this way, the rest of us say, \"Integrity makes the man.\" 🇺🇸","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-08-12T11:22:09+00:00","tweet":"Remember all the blood of the school children shot since 1990 rests at the feet of Joe Biden!! (The Gun-Free School Zones Act (GFSZA) is an act of the U.S. Congress prohibiting any ... Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE)","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-12T10:48:37+00:00","tweet":"You are correct, but voters do care. Older voters love Joe Biden, because they know he will defend their right to be selfish. They will actually show up, and vote in the primaries. They will make Biden the Dem candidate, and we will get another 4 years of Trump.","name":"joseph joe biden","Sentiment":0.0904761905},{"date":"2019-08-12T09:53:28+00:00","tweet":"A media created story. Average voters don't care. This will be born out in the Morning Consult tracking poll tonight. Every week the media tries to create a story to knock Biden down, and it doesn't work. Just another week.","name":"joseph joe biden","Sentiment":-0.1351851852},{"date":"2019-08-12T09:50:08+00:00","tweet":"Lol. Jesus people. There are better choices than mentally failing Joe Biden","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-08-11T17:30:37+00:00","tweet":"Accuse the other side of that which you are guilty. Right out of the GOP Joseph Goebbels propaganda handbook.","name":"joseph joe biden","Sentiment":-0.1098214286},{"date":"2019-08-11T06:47:16+00:00","tweet":"the three Joes … Joseph Stalin, Joesph McCarthy and Socialist Joe Biden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-08-11T00:27:01+00:00","tweet":"Hell is following you, Joseph because we here in New Mexico we are having a cooler than usual summer. Careful Joseph Diablo is gaining on you.","name":"joseph joe biden","Sentiment":-0.0534090909},{"date":"2019-11-10T18:27:28+00:00","tweet":"Tomorrow's Handsy Uncle Joseph @JoeBiden townhall on @CNN is sponsored by #CNNSucks, Joe Biden shitty Pac to raised money, Record Players that these Young People that Handsy Uncle Jospeh told him need to listen to.","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-11-09T19:58:34+00:00","tweet":"@dbongino Please Read.. Eric Ciamarella, Joseph Misfuid, Joe Biden, John Kerry & PM Renzi. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-08T00:14:10+00:00","tweet":"4\/ Did I fail to mention JOSEPH (JOE) BIDEN was the sitting VICE PRESIDENT OF THE UNITED STATES ? Did I also neglect to mention that the Steele dossier had many of it's components based out of the DNC contacts in the Ukraine that was attempting to influence the American election.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-07T07:18:15+00:00","tweet":"The Democrats are doing what Nazi leader Joseph Goebbels recommended: \"Whatever you might be guilty of, accuse your opponents of doing the same.\" Joe Biden and Obama used a \"quid pro quo\" to ensure that the Ukraine prosecutor got fired. Crime for Trump, not for Joe and Hussein?","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-11-02T13:10:59+00:00","tweet":"No no no, Joe can't go.. Joe Biden is the only candidate Tough Enough to confront Joseph Stalin. Day 2 of Bidens Presidency, he is going to tear down the Berlin wall with his bare hands.","name":"joseph joe biden","Sentiment":-0.0988888889},{"date":"2019-11-02T11:57:37+00:00","tweet":".@JoeBiden gave Kate and Joseph these “Champ” dogs back when he was VP. They came with the pups in hand for his Des Moines South Side office opening","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-30T18:21:37+00:00","tweet":"I know your hero is Joseph Goebbels but repeating the same stupid s*** will never make it more believable. @joebiden is the one that went to Ukraine and interfered with a foreign investigation involving Joe Biden's son, so your reverse bullshit only works on people who support u.","name":"joseph joe biden","Sentiment":0.0125},{"date":"2019-10-29T20:11:05+00:00","tweet":"Joe Biden reminds me of a salesman at Joseph A Bank trying to talk people into buying 3 cheap suits . Look folks ..","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-10-28T20:42:28+00:00","tweet":"I went to saint Joseph's on the brandywine tuesday for a mass for a friend who passed And I was told later that joe biden goes there for mass but cant receive communion there","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-28T19:08:35+00:00","tweet":"Exactly. It's his name. Jeb Bush was born John Ellis Bush and always went by Jeb. It shouldn't be controversial for people to go by the names they want to be called. I demand we call Joe Biden, Joseph and Bernie, Bernard! Birth certificate names or BUST! …","name":"joseph joe biden","Sentiment":0.5546875},{"date":"2019-10-24T18:11:21+00:00","tweet":"Report: Rudy Giuliani Worked With Fox News Legal Guests -- Conservative Lawyers, Joseph diGenova and Victoria Toensing-- on Secret Project to Dig Up Ukraine Dirt on Joe Biden … via @lawcrimenews","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-10-24T08:45:46+00:00","tweet":"Have you heard of Extortion 17? @JoeBiden “On May 3, 2011 Vice President Joseph R. “Joe” Biden Jr., leaked confidential information to the media that jeopardized the lives of all Navy SEALs and their families”","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-23T20:43:57+00:00","tweet":"The Democratic party has become the party of the worst Republican ever. The party of Joseph McCarthy.","name":"joseph joe biden","Sentiment":-1.0},{"date":"2019-10-22T23:12:26+00:00","tweet":"BREAKING: A large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion and possible criminal activity in Ukraine. Download & start digging! …","name":"joseph joe biden","Sentiment":-0.1026785714},{"date":"2019-10-22T09:10:04+00:00","tweet":"How come you don't refer to Bernie as Bernard or Joe Biden as Joseph? You've written a lot about Ted Cruz and don't refer to him as Rafael. Fake woke feminist who doesn't understand bilingual, bicultural border areas of the United States.","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-10-18T19:51:48+00:00","tweet":"@realDonaldTrump @CNN @MSNBC FACT: Vice President Joseph Biden Jr. is STILL leading in almost EVERY State in the US! Elizabeth Warren CANNOT Beat Donald Trump but Joe Biden CAN!🇺🇸","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-18T10:28:51+00:00","tweet":"Joe Biden is the father of the \"GUN FREE ZONE \" All school shootings belong to him . Gun-Free School Zones Act of 1990 Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE) on October 27, 1990 The blood of our dead school children are dripping from Joe Biden's handS","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-10-16T17:57:59+00:00","tweet":"OH MY, JOSEPH. \"It’s fascinating that the person who has a plan for everything has no plan for the single most consequential issue in this election in the minds of the American people, across the board,\" @JoeBiden said. …","name":"joseph joe biden","Sentiment":0.2821428571},{"date":"2019-10-15T00:28:57+00:00","tweet":"Joe Biden, aka Joseph Robinette Biden Jr., has a stupid middle name. That's all I've got today. #Biden2020 @JoeBiden","name":"joseph joe biden","Sentiment":-0.4},{"date":"2019-10-14T13:31:56+00:00","tweet":"Q: Do you have time to read books? If so, which ones would you recommend? \"My goodness, let’s see. There’s Mr. Putin, by Fiona Hill and Clifford Gaddy. Insightful.\" —Vice President Joseph Biden in Joe Biden: The Rolling Stone Interview.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-08T14:44:11+00:00","tweet":"THEY CONCORD NEW HAMPSHIRE: Joe Biden ... and @The_Almanac cc: @loujacobson @CharlieCookDC @JessicaTaylor @TexasTribAbby @cam_joseph @PotomacPeck @MichaelBarone @DaviSusan @nationaljournal","name":"joseph joe biden","Sentiment":0.1363636364},{"date":"2019-11-07T10:38:50+00:00","tweet":"Lanny Davis on @BrianLehrer right now saying anyone critical of Joe Biden is Joseph McCarthy incarnate, this is amazing","name":"joseph joe biden","Sentiment":0.2952380952},{"date":"2019-11-07T10:05:00+00:00","tweet":"Republicans call any Democrat a socialist. Doesn't matter if you're Joe Biden or Joseph Stalin. You vote blue, you're a socialist.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-05T20:47:06+00:00","tweet":"Joe Biden, Politician, Lawyer, Joseph Robinette Biden Jr. (born November 20, 1942), is an American politician who served as the 47th Vice President of the United States of America …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-05T19:54:47+00:00","tweet":"Therefore, I will support Mrs. Nancy Lang's argument and support Joe Biden, Joseph Robinette Biden Jr President Erdogan.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-04T20:40:00+00:00","tweet":"I want a Joe Squared ticket for 2020: Joe Biden and Joseph Kennedy III. Either one on top the ticket. Biden's warmth, ability to work the aisles and build (rebuild now) bridges with our allies, and empathy would jell so nicely with Kennedy's passion, intellect, mastery of speech!","name":"joseph joe biden","Sentiment":0.625},{"date":"2019-11-03T15:00:05+00:00","tweet":"\"Joe Biden, or as his friends call him, just Former Vice President Joseph R. Biden\"","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-31T00:27:53+00:00","tweet":"Excellent coverage of the Joe Biden situation from Joseph Heschmeyer @ShamelessPopery …","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-10-30T21:59:30+00:00","tweet":"… A large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's","name":"joseph joe biden","Sentiment":0.0446428571},{"date":"2019-10-26T23:00:33+00:00","tweet":"Does Joe #Biden have anything to hide? Ukrainian prosecutor Kostiantyn H. Kulyk compiled a seven-page dossier in English that accused the son of former Vice President Joseph R. Biden Jr. of corruption. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-25T10:19:26+00:00","tweet":"Yeah but that wasn’t joe Biden that was Joseph Biden.... probably Dems","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-25T00:19:40+00:00","tweet":"Here you go: James Comey Andrew McCabe Peter Strzok Lisa Page Bruce Ohr Nellie Ohr Glen Simpson Alexander Downer Stephan Halper Joseph Mifsud John Brennan James Clapper Rod Rosenstein Sally Yates Susan Rice Samantha Power Valarie Jarrett Joe Biden Barack Obama Hillary Clinton","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-24T10:13:40+00:00","tweet":"#LyinBiden Once Again: Joe #Biden denounced as a #LIAR by Victim's Brother on Biden's #SandyHook Family Meeting Claim--\"This is a lie,\" Joseph Theodore 'J.T.' Lewis said on Twitter. \"Obama came to Sandy Hook & met with every family. Joe Biden DID NOT.\" …","name":"joseph joe biden","Sentiment":-0.075},{"date":"2019-10-22T22:40:21+00:00","tweet":"Joe Biden was just waiting for Billy's ok, to lick the balls of Joseph Epstein, That he had stuck up the ass of a runaway 12 year old. Go back and watch his videos, Their are are many. …","name":"joseph joe biden","Sentiment":0.275},{"date":"2019-10-22T08:46:13+00:00","tweet":"2\/2 \"Dmytro Firtash is wanted in the United States on bribery and related charges, and he hired pro-Trump attorneys Joseph DiGenova and Victoria Toensing to help paint his prosecution as part of a global conspiracy involving Joe Biden, reported the Wall Street Journal.\"","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-18T22:10:22+00:00","tweet":"Joe Biden is the father of the\"GUN FREE ZONE \" All school shootings belong to him . Gun-Free School Zones Act of 1990 Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE) on October 27, 1990 The blood of our dead school children are dripping from Joe Biden's hands .","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-10-17T22:34:34+00:00","tweet":"UPDATED Joe Power Rankings 1. Joseph (Jesus’ dad) 2. Joe Symanowski 3. Sloppy Joe ... ... ... 15. GI Joe ... ... ... 97. Average Joe ... ... ... 156. Joe Flacco ... ... ... Last. Joe Biden","name":"joseph joe biden","Sentiment":-0.1888888889},{"date":"2019-10-17T11:08:32+00:00","tweet":"PAID BY Ukraine oligarch Dmytro Firtash. Trump worked with Joseph diGenova & Victoria Toensing to pressure Ukraine for damaging information about Joe Biden, with help from Rudy Giuliani. @TheDemocrats @HouseIntel @HouseJudiciary …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-15T22:03:58+00:00","tweet":"No one: Joe Biden: I’m the only one here to have looked Joseph Stalin in the face. I’ve been there when Robert E. Lee surrendered in Appomattox. I’ve been there when Paul Revere warned us I’m the British were coming. I’m the only one here who has pinned Jesus to the cr-","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-12T18:16:27+00:00","tweet":"UKRAINE: Joe Biden worked with Alexander Chalupa, Victoria Nuland, Cody Shearer, Jonathan Winer, Mary Jacoby, Fusion GPS, Hillary's Lawyers Perkins Coie, and many foreigners like Christopher Steel, Joseph Mifsud & Ukraine to develop Trump Dossier. …","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-10-12T17:49:40+00:00","tweet":"It thus becomes vitally important for the State to use all of its powers to repress dissent, for the truth is the mortal enemy of the lie, and thus by extension, the truth is the greatest enemy of the State.” Joseph Goebbels","name":"joseph joe biden","Sentiment":0.7},{"date":"2019-10-12T15:57:43+00:00","tweet":"Let’s be honest Joseph, the Biden family has dirt on itself and it will inevitably pay the price. I’m more concerned for you and your health. You need to talk to your neurologist about Seroquel, Celexa, Gabapentin, Aricept, & Namenda. Get plenty of exercise & eat healthy.","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-10-12T15:29:34+00:00","tweet":"Who is Joseph Misfud? Who is Alexander Downer? Who lied to the FISA court? Who approved it? When did YOU know?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-12T15:23:59+00:00","tweet":"Please drop out Joe! You are a very weak and a very unelectable candidate I don’t want to see a Hillary Clinton situation all over again that leads to the election of Trump please drop out.","name":"joseph joe biden","Sentiment":-0.14375},{"date":"2019-10-12T15:22:39+00:00","tweet":"Did you believe Americans should decide on 2016? Who is Joseph Misfud? Who is Alexander Downer? Who is Fusion GPS? Who is Christopher Steele? Who is Perkins Coie? Who violated FISA laws?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-12T13:51:45+00:00","tweet":"Joseph, its going to take more, and I mean a shit load more than just a drum to beat this God chosen president.","name":"joseph joe biden","Sentiment":0.121875},{"date":"2019-10-12T12:31:35+00:00","tweet":"Oh hell yes. In fact, I give ole Smoking Joe credit for something here. The Corn Pop reference was pure golden comedy. It’s the laugh that keeps on giving. Nice work there Joseph!","name":"joseph joe biden","Sentiment":0.3910714286},{"date":"2019-10-12T09:42:22+00:00","tweet":"@joeBiden \"You can run on for a long, run on for a long, run on for a long... Sooner or Later Gods' gonna cut you down\" ~J. Cash #JoeBiden My little Roman Catholic BROKE ALL THE 7 Deadly Sins oopsy #AbortionIsMurder oops again #Biden Fear GOD there Joseph Biden Not #Trump","name":"joseph joe biden","Sentiment":-0.0866319444},{"date":"2019-10-12T04:10:16+00:00","tweet":"You do realize blame displacement is a weakness Joseph. You should try being a man and take responsibility for your con... it just didn't work, you got caught...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-12T02:03:06+00:00","tweet":"Yea ok >>> Oh look 2012 advisor to @MittRomney Joseph Cofer Black sits on board of directors of Burisma Holdings, the same Ukraine oil and gas giant that paid at times more than $83,000 per month to Hunter Biden, son to >> @JoeBiden","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-10-12T00:32:02+00:00","tweet":"You might want to sit this one out, Joseph","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-10T22:12:32+00:00","tweet":"After Joe Biden unmercifully, trump calls him a good Vice President, he's coming to his senses, he know Vice President Joe Biden is better than him and also know Joe Biden gonna whip him next year in the General election. President Joseph Robinette Biden Jr. Nov 2020.","name":"joseph joe biden","Sentiment":0.3125},{"date":"2019-10-09T16:43:21+00:00","tweet":"Decode B) We're talking plain text Joe Biden and POTUS calls him out JOSEPH BIDEN! Traitors visiting White House, sounds like Joe Biden as VP! Q then says about Sleepy Joe Biden. > There will be no recusal. > PANIC IN DC. > Q #EndWar #EndWars #QAnon #QArmy #svpol #WWG1WGA","name":"joseph joe biden","Sentiment":-0.1339285714},{"date":"2019-10-05T12:26:22+00:00","tweet":"Explain Joseph, how is Joe Biden “the definition of corruption”?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-02T12:15:06+00:00","tweet":"@JoeBiden They have one JOSEPH BIDEN JR. Joe Biden for President!🇺🇸","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-01T17:24:58+00:00","tweet":"@JoeBiden Accuse the other side of that which you are guilty. Joseph Goebbels, Nazi Propaganda Minister AND Joe Biden, swamp rat.","name":"joseph joe biden","Sentiment":-0.2416666667},{"date":"2019-09-27T12:05:44+00:00","tweet":"John Solomon has archived many documents which have leaked. Many leaked foreign documents implicates Joe Biden, George Soros, Hillary Clinton & Joseph Misfud's collusion and possible criminal activity in Ukraine. #FactsMatter #PatriotsAwakened …","name":"joseph joe biden","Sentiment":0.095},{"date":"2019-09-27T02:58:24+00:00","tweet":"Ukraine CONNECTION! — Cache of CONFIDENTIAL documents purportedly showing COLLUSION and possible CRIMINAL ACTIVITY by Joe Biden, Hillary Clinton, George Soros and Joseph Misfud!...NO SURPRISE!🤔🇺🇸#Q #QAnon #KAG #PatriotsAwakened #FactsMatter #WWG1WGA #TheGreatAwakeningWorldwide …","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-09-26T19:51:17+00:00","tweet":"BREAKING: A large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion and possible criminal activity in Ukraine. Download and start digging! ⬇️ …","name":"joseph joe biden","Sentiment":-0.1026785714},{"date":"2019-09-25T21:13:18+00:00","tweet":"So it wasn't his first time to run for PRESIDENCY! Joe Biden Withdraws 1988 Presidential Campaign. There is one less candidate in the race for the Presidency tonight, Delaware Senator Joseph Biden dropped out. @joebiden … …","name":"joseph joe biden","Sentiment":0.0729166667},{"date":"2019-09-24T22:22:56+00:00","tweet":"The writers of this movie really love irony. Not only are Dems defending America through impeachment, they are doing so under the premise that Joe Biden is the victim. Joe Biden. Joseph Robinette Biden.","name":"joseph joe biden","Sentiment":0.1416666667},{"date":"2019-09-23T17:57:52+00:00","tweet":"Joseph Robinette Biden Jr. aka Joe Biden @JoeBiden is an American politician who served as the 47th vice president of the United States from 2009 to 2017.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-22T12:22:00+00:00","tweet":"Ooppss! Peter Doocy seems to have \"Triggered Former Vice President Joe Biden\"! Oh, THAT just CAN'T be good when a Democrat Former Vice President starts Pointing his Finger At You! You all remember what happened when Joseph Stalin starting pointing HIS Finger at People?!","name":"joseph joe biden","Sentiment":0.175},{"date":"2019-09-22T10:27:48+00:00","tweet":"#QNN We interrupt your tweeting for this Play-by-play showing corrupt Presidential candidate @JoeBiden doing EXACTLY what he has falsely accused @realDonaldTrump of doing. Be seeing you Joseph! #WWG1WGA #JusticeIsComing …","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-09-19T23:31:22+00:00","tweet":"NOTORIOUS, DENTURE-LESS JOE BIDEN AMERICAN PATRIOTS KNOW WHAT YOU’VE BEEN HIDEN YOUR SON JOSEPH BIDEN CORRUPT TO THE CORE WHEN HE’S NOT DOING CRACK IN THE CAR HIS DADDY JOE DONE BUYED HIM! …","name":"joseph joe biden","Sentiment":-0.3125},{"date":"2019-09-16T06:00:21+00:00","tweet":"A piece of shit Joe Biden together with Kosovo Albanian terrorist leader Ramush Haradinaj and Joseph J. DioGuardi founder of the Albanian American Civic League, who has been lobbying Capitol Hill since the 1980s to promote the Greater Albania agenda & Kosovo Albanian terrorists.","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-09-13T00:53:06+00:00","tweet":"America's dad, Bernard \"Bernie\" Sanders, says that Julián \"Julian\" Castro's attack on Joseph \"Joe\" Biden's mental frailty was \"not right.\" Was it wrong of Castro?","name":"joseph joe biden","Sentiment":-0.2476190476},{"date":"2019-09-12T22:25:51+00:00","tweet":"Who said “Make sure you have the record player on at night”? Joseph Gordon-Levitt’s character in 500 Days Of Summer Your barista The band She & Him Urban Outfitters employee c. 2014 Joe Biden at the #DemDebate","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-09-12T21:52:45+00:00","tweet":"Possibly. But maybe this is a case where we NEED “insidery.”","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T21:52:43+00:00","tweet":"This is criticism about the way he spoke and not about what he spoke. Do better.","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-09-12T21:49:24+00:00","tweet":"Maybe to pay for college? No. These princesse college students will never work.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T21:01:00+00:00","tweet":"I’m not going to have a dime left after this election.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:52:15+00:00","tweet":"Did Castro outright say, “you’re getting old”? That would be an outright, “naked attack”. He merely implied Biden was showing his age by forgetting what he had just said. Bernie is older too but he’s not flubbing like Biden has lately.","name":"joseph joe biden","Sentiment":-0.1066666667},{"date":"2019-09-12T20:46:45+00:00","tweet":"It was an idiotic, planned \"attack\" that just made him look unequipped to argue the merits.","name":"joseph joe biden","Sentiment":-0.6666666667},{"date":"2019-09-12T20:46:01+00:00","tweet":"I was proud of the crowd.","name":"joseph joe biden","Sentiment":0.8},{"date":"2019-09-12T20:43:11+00:00","tweet":"His naked attack on Biden’s age was gross. He should apologize","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:41:54+00:00","tweet":"From the guy who had too many Skeltons for Hillary to put him on her ticket as VP - he needs to take a seat","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-09-12T20:41:11+00:00","tweet":"Uncalled for how? Biden literally tried to call out Bernie for not answering the question asked if him. And then said this was a hones debate that they owe the American people! Lol, it’s Okay for Biden to call out BS but no one can call him out?","name":"joseph joe biden","Sentiment":0.4333333333},{"date":"2019-09-12T20:40:34+00:00","tweet":"@jkempcpa yikes","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:40:21+00:00","tweet":"I loved Biden’s answer though. “That'd be a surprise to him”","name":"joseph joe biden","Sentiment":0.7},{"date":"2019-09-12T20:40:03+00:00","tweet":"Bad move. Big turn off","name":"joseph joe biden","Sentiment":-0.35},{"date":"2019-09-12T20:39:53+00:00","tweet":"Sickening attacks not debates.","name":"joseph joe biden","Sentiment":-0.9},{"date":"2019-09-12T20:39:05+00:00","tweet":"Nope, Castro. Nope.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:37:40+00:00","tweet":"That was gross and uncalled for","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-09-12T20:00:37+00:00","tweet":"Go Joe! No matter what happens tonight, we have your back! We know there is no one more qualified to move this country forward and repair the damage than the 46th President of the United States, Joseph Biden!","name":"joseph joe biden","Sentiment":0.3125},{"date":"2019-09-12T17:35:22+00:00","tweet":"On this day in 1987..Ironically.. Reports surfaced that Democratic presidential candidate Joseph Biden had borrowed, without attribution, passages of a speech by British Labour Party leader Neil Kinnock that prompted Joe Biden to drop his White House bid.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-06T08:30:02+00:00","tweet":"… “You stay da smart one, braddah Joseph, so I going flunk ‘um, yah? It no take any brains fo’ know yo’ fewchah stay on da line in skoo’, wen’ ass wot ev’rybody else stay tinking too; TO CHOOSE NOT FO’ MARK ‘UM CORRECK, BUT...” —Not …","name":"joseph joe biden","Sentiment":0.2142857143},{"date":"2019-12-06T06:08:53+00:00","tweet":"We already have that president and he don't let every country walk all over him you Joseph Biden need to see a fucken psychiatrist","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-05T19:16:38+00:00","tweet":"Wow! I'm sure you must think Trump is a wonderful Christian. You don't know who has the strength or will to be a good Catholic. Vice President Biden is in good standing at his parish St. Joseph's of the Brandywine and the church. Your comment was repulsive.","name":"joseph joe biden","Sentiment":0.4321428571},{"date":"2019-12-05T18:04:24+00:00","tweet":"Even though we have our differences, you do deserve the Medal of Honor for investigating that sick freak Joe Biden. God bless you and your family. Joseph Biase","name":"joseph joe biden","Sentiment":-0.7142857143},{"date":"2019-12-05T16:38:37+00:00","tweet":"Joe Biden campaign introduces his Puerto Rico committee @ElNuevoDia","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-05T14:44:47+00:00","tweet":"NEW HAMPTON, Iowa — Former Vice President Joseph R. Biden Jr. on Thursday angrily lashed a voter who questioned his son’s overseas business dealings at a campaign stop here, calling the man a “damn liar” in an unusually heated exchange.The #Biden #BidenJ …","name":"joseph joe biden","Sentiment":-0.0409090909},{"date":"2019-12-05T13:29:13+00:00","tweet":"Don't worry Joseph, he WILL have 4 more years and you won't even be your party's nominee #LegHairs","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-12-05T13:09:24+00:00","tweet":"I’m pretty sure the world is laughing at you sir! Btw Joseph, thank you for all the priceless memes Mr. Quid pro quo","name":"joseph joe biden","Sentiment":0.625},{"date":"2019-12-05T12:36:26+00:00","tweet":"Go sniff somebody, Joseph.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-05T11:37:16+00:00","tweet":"Oh Joseph. I totally don't think you should have run. I support the women in it. CA over here, so I'm still Harris (don't be quitters). If not Harris, then Klobuchar and Warren. But if you get it, I'll vote for ya. Goddammit. Sigh.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-05T07:55:54+00:00","tweet":"@JoeBiden Let the light of truth shine on his entire failing, miserable life. Raise the cost for Trump for coming after you this way. History is tapping you on the shoulder. This is the moment you’ve been waiting for, Joseph Robinette Biden Jr. Embrace it and be joyful.","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-12-05T07:54:22+00:00","tweet":"Former Vice President Joseph R. Biden’s presidential campaign released a digital ad Wednesday evening that includes the now-infamous footage of world leaders appearing to mock President Trump. Read more... #ENMNEWSPOLITICS …","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-12-05T02:18:23+00:00","tweet":"Bro, most of America is laughing at you as well... Handsy Uncle Joseph","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-12-05T00:45:03+00:00","tweet":"Joseph Curl: “When he’s not trying to keep his blindingly white dentures in place, the 77-year-old is saying some absolutely wacky — and oddly disturbing — things.” @josephcurl #washtimesoped …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-04T23:16:36+00:00","tweet":"The only choice people want HANDSY UNCLE JOSEPH is their choice of their doctor. Not the choice of getting ripped off by private health insurance companies and getting denied coverage. Drop out already you disgusting liar.","name":"joseph joe biden","Sentiment":-0.3333333333},{"date":"2019-12-04T16:01:08+00:00","tweet":"Joseph Curl: “What the @#$%^&* is going on with Joe Biden?” @josephcurl #washtimesoped …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-03T19:55:51+00:00","tweet":"The Catholic Church has warned Nancy Pelosi and Joseph(Joe) Biden about there. Passing the laws against the church. Killing. unborn and now birthed babies and allowed to die or killed at birth! The Church will not support them with these policies in. Place.","name":"joseph joe biden","Sentiment":-0.125},{"date":"2019-12-02T02:04:28+00:00","tweet":"@JohnKerry @JoeBiden @neuralink @LPNational @LPOhio @christi04752508 BLACKBERRY anagrams as C KERRY BLAB \"May 31, 2015 · U.S. Secretary of State John Kerry broke his right femur in a cycling accident\" --- Joseph Robinette \"Beau\" Biden III (February 3, 1969 – May 30, 2015)","name":"joseph joe biden","Sentiment":0.2857142857},{"date":"2019-12-01T15:37:18+00:00","tweet":"Who is this Uncle Joe you keep referring to? That was FDR people's name for Joseph Stalin. Is it Joe Biden now? I don't understand, Dr. Benz.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-29T21:50:16+00:00","tweet":"Joe Biden is short for Joseph Bin Laden","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-06T06:03:10+00:00","tweet":"We don't like you in Canada Handsy uncle Joseph. Move along.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-06T00:45:04+00:00","tweet":"Joseph Curl: “A short video resurfaced this week showing Mr. Biden describing how children would rub his leg hair when he was a lifeguard at a Delaware pool.” @josephcurl #washtimesoped …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-05T17:45:39+00:00","tweet":"Same goes to you, handsy uncle Joseph. You babble on about random shit every time a camera is on you. Cornpop is a bad dude and you learned about roaches? Kids touch your leg? You're not a kind old grandpa. Drop out.","name":"joseph joe biden","Sentiment":-0.2666666667},{"date":"2019-12-05T15:00:22+00:00","tweet":"The more they attack Trump, the more he is getting blessed. Joseph was not loved by his brothers, but he turned to be their saviour in the time of need.","name":"joseph joe biden","Sentiment":0.2166666667},{"date":"2019-12-05T04:05:03+00:00","tweet":"Tammy Bruce: “Former Vice President and now 2020 Democratic presidential candidate Joseph R. Biden made the news again over this last weekend for all the wrong reasons.” @heytammybruce @iwv #washtimesoped …","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-12-05T03:19:38+00:00","tweet":"That...is a 3 piece and a soda for Trump! Way to go Joseph!!! Lol","name":"joseph joe biden","Sentiment":0.8},{"date":"2019-12-04T13:05:40+00:00","tweet":"RS Nunes2: The lawyer, Joseph Bondy, said his client, Lev Parnas was told by a former Ukrainian prosecutor about a meeting with Nunes in Vienna last year to discuss efforts to dig up dirt on former Vice President Joe Biden.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-03T12:05:52+00:00","tweet":"Joseph Biden was very unkind to Elizabeth Warren and could be a better candidate if he really wanted. Primaries are a contest and not a fist fight, @JoeBiden! …","name":"joseph joe biden","Sentiment":0.3166666667},{"date":"2019-12-03T08:09:56+00:00","tweet":"Former Vice President Joseph R. Biden on Monday questioned whether Sen. Elizabeth Warren of Massachusetts, one of his top rivals for the 2020 Democratic presidential nomination, is truly generating “enthusiasm” among voters on the campaign trail. #ENMNEW …","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-12-02T02:07:22+00:00","tweet":"Remembering IDIOT VP Joe Biden When he was the Vice President, he did the most STUPID, unthinkable thing for a man in his position. He revealed the names and the unit that killed Bin Laden;\"On May 3 2011, at a national event in Washington , Vice President Joseph R. Biden Jr.","name":"joseph joe biden","Sentiment":-0.27},{"date":"2019-12-01T11:26:15+00:00","tweet":"I don't know if it as much about age as it is... let's call it \"awareness\"? Bernie can still form a thread of thoughts longer than 45 seconds. All due respect, Joseph","name":"joseph joe biden","Sentiment":0.0375},{"date":"2019-12-01T01:13:23+00:00","tweet":"Hitler: Killed 6 million Jews But tell us more about how immoral Joseph Stalin was, @RealCandaceO","name":"joseph joe biden","Sentiment":0.15},{"date":"2019-11-30T23:08:43+00:00","tweet":"this is so fucking stressful, joseph","name":"joseph joe biden","Sentiment":-0.6},{"date":"2019-11-29T20:24:50+00:00","tweet":"@JoeBiden herro Joseph. Daddies coming. Shhh","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-29T11:17:14+00:00","tweet":"the political process rather than guns to settle their differences.\" Vice President Joseph Biden 10 February 2010\/5 Who is a danger to our national security?","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-29T08:36:02+00:00","tweet":"Also, \"Joseph R. Biden Jr.\"? We talking about Diamond Joe Biden here","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-28T12:25:25+00:00","tweet":"Happy Thanksgiving Vice President Joe Biden and Family, I'm so thankful that you're part of the 2020 Presidential selection of President of the United States of America and by this time next next, I'm praying it'll be President elect Joseph R Biden Jr.","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-11-28T08:36:30+00:00","tweet":"\"Biden's Tax filings ALWAYS list him as the broke-ass clown of , just the last 2 weeks…\" — billyd1431","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-27T20:24:50+00:00","tweet":"COLUMBIA, S.C. — Joseph R. Biden’s political fate in South Carolina ultimately could be decided by voters in Iowa and New Hampshire, where the former vice president’s shaky performance on the campaign trail will be put to the test first, setting the #ENM …","name":"joseph joe biden","Sentiment":0.0088383838},{"date":"2019-11-27T09:11:32+00:00","tweet":"Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family via @BreitbartNews","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-12-05T20:23:00+00:00","tweet":"He was in the Senate from the 1970s until he became Veep in 2009. Sponsored loads of stuff. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-05T16:46:26+00:00","tweet":"He shouted out the Joseph R Biden school of public policy and administration in my own turf yesterday :,) reminded me of you!","name":"joseph joe biden","Sentiment":0.375},{"date":"2019-12-05T12:44:13+00:00","tweet":"Former Vice President Joseph R. Biden and his son Hunter could be forced to testify if the Senate ends up holding an impeachment trial of President Trump, say congressional... …","name":"joseph joe biden","Sentiment":-0.15},{"date":"2019-12-04T23:04:05+00:00","tweet":"Propaganda that would make Joseph Goebbels weep. Look at Trump's record, it's great: ️Stocks up 50% means millions of retirement plans are up trillions! ️ Tax cut and booming economy! ️Kept us out of a risky war w NoKo! ️ Controls the Fed & is setting up the Dems, Shh!","name":"joseph joe biden","Sentiment":0.45},{"date":"2019-12-04T08:45:32+00:00","tweet":"… The ‘affirmative task’ before us is to “create a New World Order.” –VP Joe Biden, speech Import Export Bank, April 5, 2013 “How I Learned to Love the New World Order” –article by Sen. Joseph R. Biden, Jr. Wall Street Journal, 92","name":"joseph joe biden","Sentiment":0.3431818182},{"date":"2019-12-03T20:34:16+00:00","tweet":"Joseph Curl: “What the @#$%^&* is going on with Joe Biden?” @josephcurl #washtimesoped …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-02T11:53:59+00:00","tweet":"@JoeBiden drink my cum joseph","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-01T20:01:00+00:00","tweet":"#CreepyJoe This is the original clip of Joe Biden's full speech from the June 26, 2017, Joseph R. Biden Jr. Aquatic Center Dedication …","name":"joseph joe biden","Sentiment":0.2083333333},{"date":"2019-12-01T13:13:04+00:00","tweet":"Ah yes, Joseph Robinette Biden Jr., the candidate best known for never, ever saying anything foolish.","name":"joseph joe biden","Sentiment":1.0},{"date":"2019-11-29T11:15:26+00:00","tweet":", have a unity government in Baghdad that pulls the country together. That will not happen.... It will not happen in the lifetime of anyone here.\" Senator Joseph Biden 19 August 2007\/2","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-29T08:15:34+00:00","tweet":"Joseph Distefano Drops Major Revelation About Corruption Of Joe Biden And How He Enriched His Family; This Is Big … via @Tea Party Pac","name":"joseph joe biden","Sentiment":0.03125},{"date":"2019-11-28T00:44:23+00:00","tweet":"Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-11-27T20:20:08+00:00","tweet":"Says every -- ageist -- ever... #Bullshit. We need -fresh perspective-, Joseph. We need -mutual endearment- between all sects of wisdom -- both experience and fresh perspective.","name":"joseph joe biden","Sentiment":0.3},{"date":"2019-11-27T19:20:51+00:00","tweet":"God imagine a Joe Biden presidency. The grace with which he'll give his inaugural address. The years of amazing and inspirational quotes as he takes our country in the right direction. God bless us all and God bless Joseph Biden","name":"joseph joe biden","Sentiment":0.4619047619},{"date":"2019-11-27T09:11:05+00:00","tweet":"Investigative reporter Joseph DiStefano chronicles the multi-decade trail of slime and graft left behind by Joe Bribem …","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-12-05T15:37:15+00:00","tweet":"One Joseph P Biden is the catalyst for that arrangement. There’s absolutely ZERO reason for them to be interested in Hunter otherwise. Voters see thru this!","name":"joseph joe biden","Sentiment":0.25625},{"date":"2019-12-05T04:44:09+00:00","tweet":"Sounds like malarkey to me Joseph","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-03T17:55:35+00:00","tweet":"She is going to join your failed campaign Handsy Uncle Joseph ️Didn't prosecute Steve Mnuchin ️Separated\/jailed families and laughed about it ️Not for Medicare 4 All ️Blocked evidence that would have freed a man from death row ️Regime change wars …","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-12-03T09:06:52+00:00","tweet":"\"Today, 77-year-old Joseph Robinette Biden Jr. is running for president. And now the question isn't whether he'll die in office. Now the question is: Did he die already? Is Joe Biden one of the walking dead?\" …","name":"joseph joe biden","Sentiment":-0.2},{"date":"2019-12-02T14:34:12+00:00","tweet":"You can't spell Joseph Robinet Biden without MBNA...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-12-01T19:39:58+00:00","tweet":"On June 26, 201 Joe gave a dedication speech for the Joseph R. Biden Jr. Aquatic Center in Wilmington, Delaware. He revealed that his leg hair is blonde and that he loves kids jumping on his lap. The full speech available ⤵️ …","name":"joseph joe biden","Sentiment":0.1625},{"date":"2019-12-01T13:24:42+00:00","tweet":"It is so much better if you listen to @JoeBiden IN context, … but start at 30 minutes. This is sad, bizarre, frightening, and why does his campaign allow this to stay online?","name":"joseph joe biden","Sentiment":-0.025},{"date":"2019-12-01T13:15:48+00:00","tweet":"… \"This is the original clip of Joe Biden's full speech from the June 26, 2017, Joseph R. Biden Jr. Aquatic Center Dedication\"","name":"joseph joe biden","Sentiment":0.2083333333},{"date":"2019-12-01T11:32:25+00:00","tweet":"Full interview of creepy @JoeBiden and his hairy legs. Start at 30 minutes in: it gets worse or better …","name":"joseph joe biden","Sentiment":-0.0125},{"date":"2019-11-30T19:03:43+00:00","tweet":"You are past your use by date Joseph. Better to through your weight behind someone with a pulse.","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-11-29T13:50:37+00:00","tweet":"Couldn’t agree more. In some ways it feels like we’re throwing a lifeline to a deaf man in the water. Screaming at him grab the line I’ll save you. For a long time it was me in the water. Just lucky the life preserver Yang threw me smacked me in the face so I couldn’t miss it","name":"joseph joe biden","Sentiment":0.2611111111},{"date":"2019-11-27T15:32:47+00:00","tweet":"… Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family Joe Biden has been a beneficiary of “legal graft” via the “Delaware Way,” DiStefano said — a term defined as “politicians doing favors for well-connected","name":"joseph joe biden","Sentiment":0.1166666667},{"date":"2019-11-27T08:24:30+00:00","tweet":"Former Vice President Joseph R. Biden has pulled ahead of his 2020 Democratic presidential rivals, according to a poll released on Tuesday that showed Sen. Elizabeth Warren of Massachusetts losing ground in recent weeks. Read more... #ENMNEWSPOLITICS …","name":"joseph joe biden","Sentiment":0.1666666667},{"date":"2019-11-27T08:09:02+00:00","tweet":"Joe Biden holds double-digit lead over nearest 2020 Democratic presidential rival: Poll: Former Vice President Joseph R. Biden holds a double-digit lead over...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-27T08:09:02+00:00","tweet":"Joe Biden retakes lead over 2020 Dem rivals as Elizabeth Warren slips: Poll: Former Vice President Joseph R. Biden has pulled ahead of his...","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-27T08:08:47+00:00","tweet":"Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-12-03T13:21:50+00:00","tweet":"Trump call’s Joe Biden, Creepy Joe. 🤦‍️ Blaming those of what you are Guilty of, is right out of the Joseph Goebbels German Nazi politician and Propaganda Minister playbooks. #Racist #TrumpIsACriminal #TrumpMolester #TrumpRapist #IBelieveThemAll #ImpeachAndRemoveTrumpNOW …","name":"joseph joe biden","Sentiment":-0.1628571429},{"date":"2019-12-02T13:41:30+00:00","tweet":"\"Any other things in Ukraine that were corrupt that he was looking into?\" \"Well, of course! There was Hunter Biden...Joe Biden...the Bidens' dog...Joseph R. Biden Jr....some guy was over there bidin' his time...uh...Hun...terrrr... biiii...dennn...uh...\".","name":"joseph joe biden","Sentiment":-0.375},{"date":"2019-12-01T17:07:12+00:00","tweet":"\"This is the original clip of Joe Biden's full speech from the June 26, 2017, Joseph R. Biden Jr. Aquatic Center Dedication\"","name":"joseph joe biden","Sentiment":0.2083333333},{"date":"2019-12-01T15:38:21+00:00","tweet":"Today disgusted to find Republicans & many \"sock puppets\" trying to smear Joe #Biden with a clip from when he was being honored by his community in Wilmington, DE in June 2017. Full video clip: …","name":"joseph joe biden","Sentiment":-0.05},{"date":"2019-12-01T13:21:10+00:00","tweet":"Very real, see full video of @JoeBiden at the pool with all the kids, …. 30 minutes in is where you see JOE be his best","name":"joseph joe biden","Sentiment":0.5366666667},{"date":"2019-11-30T18:10:43+00:00","tweet":"Spotted this morning Iowa bound north of St Joseph, MO. Is funnier in real life. Read it as Joe Malarkey.","name":"joseph joe biden","Sentiment":0.2},{"date":"2019-11-29T00:48:13+00:00","tweet":"Former Justice Department prosecutor Joseph Moreno on Thursday argued that President Donald Trump's personal attorney Rudy Giuliani did \"exactly\" what he has accused the family of former Vice President Joe Biden of doing. …","name":"joseph joe biden","Sentiment":0.0625},{"date":"2019-11-28T07:54:39+00:00","tweet":"#QUIDPROJOE SINCE 1970s....Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family …","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-11-28T07:24:10+00:00","tweet":"Thread by @JewhadiTM: \"Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family Biden has been a beneficiary of “legal graft” via the “Delaware Way,” DiStefano said — a term define […]\" …","name":"joseph joe biden","Sentiment":0.1166666667},{"date":"2019-11-27T23:27:09+00:00","tweet":"Former Vice President Joseph R. Biden has maintained an edge over his 2020 Democratic presidential rivals in new national polling, but South Bend, Indiana, Mayor Pete Buttigieg is gaining and Sen. Elizabeth Warren is slipping. Read more... #ENMNEWSPOLITI …","name":"joseph joe biden","Sentiment":0.1340909091},{"date":"2019-11-27T07:42:23+00:00","tweet":"“Joe Biden’s Friends and Backers Come Out on Top—at the Expense of the Middle Class.” Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family via @BreitbartNews","name":"joseph joe biden","Sentiment":0.05},{"date":"2019-12-01T13:47:09+00:00","tweet":"All of this!!! Call their asses out. If Kamala is a cop Joseph is the Architect of mass incarceration. Bernard contributed as well. So miss me with that foolishness. Kamala also protected Black Victims too.","name":"joseph joe biden","Sentiment":-0.1666666667},{"date":"2019-12-01T01:39:09+00:00","tweet":"“This is the original clip of Joe Biden's full speech from the June 26, 2017, Joseph R. Biden Jr. Aquatic Center Dedication” (this part at 6:50)","name":"joseph joe biden","Sentiment":0.2083333333},{"date":"2019-12-01T00:15:51+00:00","tweet":"It’s not fake. Here is the *actual* complete clip that a local affiliate posted on YouTube two years ago. Leg hair story starts at 30:48.","name":"joseph joe biden","Sentiment":0.0875},{"date":"2019-11-29T16:27:34+00:00","tweet":"@JoeBiden has spent 30+ years in public office. How many bribes has he done with the people’s tax money that we don’t know about. History will not be kind to Joseph Robinette, and it shouldn’t. #Trump2020Landslide","name":"joseph joe biden","Sentiment":0.25},{"date":"2019-11-28T02:12:31+00:00","tweet":"@BarackObama @JoeBiden @AC360 @ChrisCuomo Chuckles..... that's some propaganda that even Dr Joseph Goebells and Heinrich Himmler would be proud of.","name":"joseph joe biden","Sentiment":0.35},{"date":"2019-11-27T20:12:16+00:00","tweet":"August 17th 2016 Hunter and Joe Biden were together in Sojeve Kosovo. They were at a ceremony to name a National Road after Joseph R Biden \"Beau\" III","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-27T18:57:55+00:00","tweet":"Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Sleepy Joe Biden Used ‘Legal Graft’ to Enrich His Family via @BreitbartNews","name":"joseph joe biden","Sentiment":0.075},{"date":"2019-11-27T20:31:13+00:00","tweet":"The Candace Owens Show: Paul Joseph Watson And 🤥CNN via @YouTube","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-27T08:37:18+00:00","tweet":"Biden's family longstanding pay to play---READ Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family \"transactions involving members of his family and companies that were interested in getting access.”","name":"joseph joe biden","Sentiment":0.1333333333},{"date":"2019-11-27T06:54:22+00:00","tweet":"Because in his mind, if there are no consequences & only rewards, why not? His \"moral high ground\" is the at bottom of a septic tank! Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family via @BreitbartNews","name":"joseph joe biden","Sentiment":0.07},{"date":"2019-11-27T04:24:15+00:00","tweet":"@JoeBiden Career Criminal #TheBestIsYetToCome Joseph DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ to Enrich His Family …","name":"joseph joe biden","Sentiment":-0.0833333333},{"date":"2019-11-27T02:21:14+00:00","tweet":"Investigating Joe Biden’s and Hunter Biden’s business dealings in Ukraine — particularly with respect to energy company Burisma — legitimate endeavor, determined Joseph N. DiStefano DiStefano: Long Before Hunter’s Ukraine Gig, Joe Biden Used ‘Legal Graft’ …","name":"joseph joe biden","Sentiment":0.1055555556},{"date":"2019-11-26T17:51:38+00:00","tweet":", joe biden 2020, Biden.2020, Joseph R. Biden, joe BidenHQ, Joe Biden, Jill and Joe Biden, Team Joe. Guess what? There are too manyof you crowding my Gmail. Vote for the younger Democrat. But trust no Republican. Ie. Stop spamming me.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-25T14:21:19+00:00","tweet":"List of Famous clowns throughout history: Joseph Grimaldi Grock Oleg Popov Krusty the Clown Trump Bozo the Clown Joe Biden Ronald McDonald Pennywise Killer Clowns from Outer Space Mitch McConnell","name":"joseph joe biden","Sentiment":0.5},{"date":"2019-11-24T16:51:24+00:00","tweet":"Dont forget paul pelosi jr Joe Biden Former CIA assett Joseph cofer black All ties to burisma","name":"joseph joe biden","Sentiment":-0.0833333333},{"date":"2019-11-24T09:44:03+00:00","tweet":"Joe Biden: 40 years in office Donald Trump: 3 years in office Joe Biden: \"it's all Trumps fault\" GTFO Joseph!","name":"joseph joe biden","Sentiment":0.625},{"date":"2019-11-23T13:52:26+00:00","tweet":"His middle name is “Joe Biden”? Wierd, I thought it was Joseph. Thanks for the 411 #LiberalismIsAMentalDisorder #DevinNunesGotCaught","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-11-23T07:43:49+00:00","tweet":"BREAKING Jan 2019, Rudy Giuliani conducted a interview with Viktor Shokin,Chief Prosecutor for Ukraine. Testifies it was Joe Biden's request that he was fired & that he investigated Burisma & its owner Mykola Zlochevsky. Joseph Blade from CIA was ALSO made director in 2014.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-21T21:37:58+00:00","tweet":"Q: Do you have time to read books? If so, which ones would you recommend? \"My goodness, let’s see. There’s Mr. Putin, by Fiona Hill and Clifford Gaddy. Insightful.\" —Vice President Joseph Biden in Joe Biden: The Rolling Stone Interview.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-15T14:32:53+00:00","tweet":"Large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion and possible criminal activity in Ukraine. …","name":"joseph joe biden","Sentiment":-0.0776785714},{"date":"2019-11-13T21:34:21+00:00","tweet":"The American people are a little busy viewing \"documents leaked from the Ukrainian General Prosecutor's office implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion, and possible criminal activity in Ukraine\" right now. We DESERVE to know...","name":"joseph joe biden","Sentiment":-0.0216836735},{"date":"2019-11-10T18:27:28+00:00","tweet":"Tomorrow's Handsy Uncle Joseph @JoeBiden townhall on @CNN is sponsored by #CNNSucks, Joe Biden shitty Pac to raised money, Record Players that these Young People that Handsy Uncle Jospeh told him need to listen to.","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-11-09T19:58:34+00:00","tweet":"@dbongino Please Read.. Eric Ciamarella, Joseph Misfuid, Joe Biden, John Kerry & PM Renzi. …","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-08T00:14:10+00:00","tweet":"4\/ Did I fail to mention JOSEPH (JOE) BIDEN was the sitting VICE PRESIDENT OF THE UNITED STATES ? Did I also neglect to mention that the Steele dossier had many of it's components based out of the DNC contacts in the Ukraine that was attempting to influence the American election.","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-11-07T07:18:15+00:00","tweet":"The Democrats are doing what Nazi leader Joseph Goebbels recommended: \"Whatever you might be guilty of, accuse your opponents of doing the same.\" Joe Biden and Obama used a \"quid pro quo\" to ensure that the Ukraine prosecutor got fired. Crime for Trump, not for Joe and Hussein?","name":"joseph joe biden","Sentiment":-0.25},{"date":"2019-11-02T13:10:59+00:00","tweet":"No no no, Joe can't go.. Joe Biden is the only candidate Tough Enough to confront Joseph Stalin. Day 2 of Bidens Presidency, he is going to tear down the Berlin wall with his bare hands.","name":"joseph joe biden","Sentiment":-0.0988888889},{"date":"2019-11-02T11:57:37+00:00","tweet":".@JoeBiden gave Kate and Joseph these “Champ” dogs back when he was VP. They came with the pups in hand for his Des Moines South Side office opening","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-30T18:21:37+00:00","tweet":"I know your hero is Joseph Goebbels but repeating the same stupid s*** will never make it more believable. @joebiden is the one that went to Ukraine and interfered with a foreign investigation involving Joe Biden's son, so your reverse bullshit only works on people who support u.","name":"joseph joe biden","Sentiment":0.0125},{"date":"2019-10-29T20:11:05+00:00","tweet":"Joe Biden reminds me of a salesman at Joseph A Bank trying to talk people into buying 3 cheap suits . Look folks ..","name":"joseph joe biden","Sentiment":0.4},{"date":"2019-10-28T20:42:28+00:00","tweet":"I went to saint Joseph's on the brandywine tuesday for a mass for a friend who passed And I was told later that joe biden goes there for mass but cant receive communion there","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-28T19:08:35+00:00","tweet":"Exactly. It's his name. Jeb Bush was born John Ellis Bush and always went by Jeb. It shouldn't be controversial for people to go by the names they want to be called. I demand we call Joe Biden, Joseph and Bernie, Bernard! Birth certificate names or BUST! …","name":"joseph joe biden","Sentiment":0.5546875},{"date":"2019-10-24T18:11:21+00:00","tweet":"Report: Rudy Giuliani Worked With Fox News Legal Guests -- Conservative Lawyers, Joseph diGenova and Victoria Toensing-- on Secret Project to Dig Up Ukraine Dirt on Joe Biden … via @lawcrimenews","name":"joseph joe biden","Sentiment":-0.1},{"date":"2019-10-24T08:45:46+00:00","tweet":"Have you heard of Extortion 17? @JoeBiden “On May 3, 2011 Vice President Joseph R. “Joe” Biden Jr., leaked confidential information to the media that jeopardized the lives of all Navy SEALs and their families”","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-23T20:43:57+00:00","tweet":"The Democratic party has become the party of the worst Republican ever. The party of Joseph McCarthy.","name":"joseph joe biden","Sentiment":-1.0},{"date":"2019-10-22T23:12:26+00:00","tweet":"BREAKING: A large cache of confidential foreign documents have just been leaked implicating Joe Biden, George Soros, Hillary Clinton and Joseph Misfud's collusion and possible criminal activity in Ukraine. Download & start digging! …","name":"joseph joe biden","Sentiment":-0.1026785714},{"date":"2019-10-22T09:10:04+00:00","tweet":"How come you don't refer to Bernie as Bernard or Joe Biden as Joseph? You've written a lot about Ted Cruz and don't refer to him as Rafael. Fake woke feminist who doesn't understand bilingual, bicultural border areas of the United States.","name":"joseph joe biden","Sentiment":-0.5},{"date":"2019-10-18T19:51:48+00:00","tweet":"@realDonaldTrump @CNN @MSNBC FACT: Vice President Joseph Biden Jr. is STILL leading in almost EVERY State in the US! Elizabeth Warren CANNOT Beat Donald Trump but Joe Biden CAN!🇺🇸","name":"joseph joe biden","Sentiment":0.0},{"date":"2019-10-18T10:28:51+00:00","tweet":"Joe Biden is the father of the \"GUN FREE ZONE \" All school shootings belong to him . Gun-Free School Zones Act of 1990 Introduced in the Senate as S.3266 by Joseph R. Biden Jr. (D-DE) on October 27, 1990 The blood of our dead school children are dripping from Joe Biden's handS","name":"joseph joe biden","Sentiment":0.1},{"date":"2019-10-16T17:57:59+00:00","tweet":"OH MY, JOSEPH. \"It’s fascinating that the person who has a plan for everything has no plan for the single most consequential issue in this election in the minds of the American people, across the board,\" @JoeBiden said. …","name":"joseph joe biden","Sentiment":0.2821428571},{"date":"2019-10-15T00:28:57+00:00","tweet":"Joe Biden, aka Joseph Robinette Biden Jr., has a stupid middle name. That's all I've got today. #Biden2020 @JoeBiden","name":"joseph joe biden","Sentiment":-0.4},{"date":"2019-10-14T13:31:56+00:00","tweet":"Q: Do you have time to read books? If so, which ones would you recommend? \"My goodness, let’s see. There’s Mr. Putin, by Fiona Hill and Clifford Gaddy. Insightful.\" —Vice President Joseph Biden in Joe Biden: The Rolling Stone Interview.","name":"joseph joe biden","Sentiment":0.0}]