{"0":{"date":"2019-12-05 20:01:50","tweet":"I’m frustrated about it too tho because I thought the trial would be where people who haven’t been paying attention would see who she is and then when the voting started Steve Kornacki would be like “wow Harris wins who saw this coming?” And I’d be like ME, ASSHOLE","Sentiment":-0.1},"1":{"date":"2019-12-05 20:01:48","tweet":"@KamalaHarris You are obsessed with your Color! Ignorant Broad! America doesn't want a President that will spread their legs to get what they want! WE WANT CLASSY You should take some pointers from our @FLOTUS","Sentiment":-0.1424479167},"2":{"date":"2019-12-05 20:01:47","tweet":"didn't your dad get you a job or something","Sentiment":0.0},"3":{"date":"2019-12-05 20:01:44","tweet":"So because I'm a man, with an opinion, it become mansplaining?","Sentiment":0.0},"4":{"date":"2019-12-05 20:01:43","tweet":"Castro warns of dwindling diversity in Democratic presidential field without Kamala Harris","Sentiment":0.0},"5":{"date":"2019-12-05 20:01:42","tweet":"Hell, forget the right. The left 🥀 would have drawn and quartered her.","Sentiment":0.1428571429},"6":{"date":"2019-12-05 20:01:36","tweet":"Kamala Harris left at the perfect time for any candidate to add her as VP. I don’t think she made any deals beforehand. Why not just wait for the primary winner to come to her?","Sentiment":0.4666666667},"7":{"date":"2019-12-05 20:01:32","tweet":"The attacks on her and her family would have been relentless.","Sentiment":0.0},"8":{"date":"2019-12-05 20:01:28","tweet":"It fit the context of the discussion because she was pointing out that Harris was being a hypocrite.","Sentiment":0.4},"9":{"date":"2019-12-05 20:01:16","tweet":"Hawaiian ninja who loves rolling with white Nationalist: Tucker, Hannity, Ingrams, and Bretibart. Black folk have nothing for her token end.","Sentiment":-0.0833333333},"10":{"date":"2019-12-05 20:01:03","tweet":"She is one using arse WW. She views Black and Brown women as her mules to get ahead. I can’t stand her fake arse. She will never get a Kamala vote from me.","Sentiment":-0.3333333333},"11":{"date":"2019-12-05 20:01:03","tweet":"Not the least bit. If anything it would have been worse because of her last name.","Sentiment":-0.2333333333},"12":{"date":"2019-12-05 20:00:58","tweet":"Kamala was treated poorly for speaking the truth.. Her exit was heart breaking.","Sentiment":-0.4},"13":{"date":"2019-12-05 20:00:50","tweet":"Hillary Clinton would be President of the United States if they’d all done this when it actually mattered. I will never forgive how she was crucified by the media in 2016. Same thing happened to Kamala this time around. I’m angry.","Sentiment":-0.1666666667},"14":{"date":"2019-12-05 20:00:46","tweet":"Why did the Kamala Harris campaign fail?","Sentiment":-0.5},"15":{"date":"2019-12-05 20:00:32","tweet":"Kamala Harris goes on the veep shortlist — even Biden’s by @AndrewRomano","Sentiment":0.0},"16":{"date":"2019-12-05 20:00:31","tweet":"The ignominious fall of #KamalaHarris: While attempting to strike a middle ground among the Democratic candidates, Harris never successfully convinced working-class voters that she was progressive at al …","Sentiment":-0.1875},"17":{"date":"2019-12-05 20:00:29","tweet":"No, actually, Black LIBERALS didn’t like her!!","Sentiment":0.1302083333},"18":{"date":"2019-12-05 20:00:28","tweet":"On Wednesday Democratic Presidential candidate Joe Biden said that he is considering former candidate Kamala Harris as his possible vice president.","Sentiment":0.0},"19":{"date":"2019-12-05 20:00:25","tweet":"Okay?! What bothers me most is that Gabbard is still on stage. And Bernie’s not even a Democrat. What world am I living in?","Sentiment":0.5625}}