{"0":{"date":"2019-12-05 19:10:45","tweet":"Michael says background checks aren't working, you have to get a permit to buy a gun. How do you get a permit you ask? By going through a background check.","Sentiment":0.0},"1":{"date":"2019-12-05 18:57:44","tweet":"Michael Bloomberg’s awful record on pot - Boulder Weekly #SmartNews What say you ⁦@MikeBloomberg⁩ folks want to know. What say you on ending Prohibition? ⁦@NORML⁩ #BlackTwitter ⁦@CannabisCulture⁩ ⁦@CannabisNews⁩ @jaredkushner⁩ …","Sentiment":-1.0},"2":{"date":"2019-12-05 17:07:58","tweet":"Warren electronic fliers: “Kamala Harris and Kirsten Gillibrand have been forced out of this race, while billionaires Tom Steyer and Michael Bloomberg have been allowed to buy their way in.” Allowed to buy their way in. Mike and Tom, were you aware that you've been allowed in...","Sentiment":-0.025},"3":{"date":"2019-12-05 17:00:59","tweet":"Stupid comment. How many people get fat without spoons? Guess we should ban spoons too because they make us fat. Michael Bloomberg would go for that 🤣.","Sentiment":-0.15},"4":{"date":"2019-12-05 16:31:13","tweet":"Michael Bloomberg is a global leader on Climate Change. Owns 12 houses, one of which is 22,500sf - especially good for environment, like Obama's new 15,000sf house Smaller, sustainable apartments & trains for thee. Mansions & Gulfstream for me …","Sentiment":0.2840909091},"5":{"date":"2019-12-05 16:09:05","tweet":"Mitt Romney Michael Bloomberg (Because they are not who they appear to be) Who doesn't recognize @MittRomney as a RINO? - Will the impeachment vote be defining? As to @MikeBloomberg, the public record reflects: … …","Sentiment":0.0},"6":{"date":"2019-12-05 16:08:42","tweet":"Mitt Romney Michael Bloomberg (Because they are not who they appear to be) Who doesn't recognize @MittRomney as a RINO? - Will the impeachment vote be defining? As to @MikeBloomberg, the public record reflects: …","Sentiment":0.0},"7":{"date":"2019-12-05 16:07:12","tweet":"Mike Bloomberg’s massive network of terminals quietly promoted his campaign website: Photo by Noam Galai\/WireImage Michael Bloomberg temporarily had a tiny but extremely questionable advantage in the 2020… #25thAmendmentNow #ImpeachTrump #TheResistance","Sentiment":-0.125},"8":{"date":"2019-12-05 15:55:51","tweet":"Searches for \"Mike\" on Bloomberg terminals initially displayed Michael Bloomberg's campaign site as first result; spokesman says results now display a bio page (Financial Times) … …","Sentiment":0.0833333333},"9":{"date":"2019-12-05 14:52:43","tweet":"Warren and Sanders aim attacks at Michael Bloomberg … USA FOR ALL...not only for Poor or Rich,Blue or black or Brown,Male or Female so Mike Bloomberg deserve to be a candidate....","Sentiment":-0.1416666667},"10":{"date":"2019-12-05 14:33:10","tweet":"Another group of @MikeBloomberg voters. Michael Bloomberg is irresistible! #MikeBloomberg2020","Sentiment":0.0},"11":{"date":"2019-12-05 13:43:28","tweet":"Be sure to leave them big FAT CHECKS —because, sorry Michael —nobody likes you for “you”","Sentiment":0.0},"12":{"date":"2019-12-05 13:30:07","tweet":"Mentions on CNN Michael Bloomberg - 84 Kamala Harris - 80 (\"Mike Bloomberg\" Or \"Michael Bloomberg\") - 79 Last 14 days","Sentiment":0.0},"13":{"date":"2019-12-05 12:33:16","tweet":"Michael Bloomberg is a COMMUNIST. HE is a TRAITOR TO AMERICA!! He hates America. Hey Mike, Come take my guns.🇺🇸🇦🇷","Sentiment":0.0},"14":{"date":"2019-12-05 12:25:57","tweet":"It looks like the New York Post editors are Mr. Murdoch have removed articles involving Michael Bloomberg for instants John Haggerty 62 emails that Mike Bloomberg refuses to turn over. Bloomberg checks and balances deleted too","Sentiment":0.1363636364},"15":{"date":"2019-12-05 11:54:36","tweet":".@MikeBloomberg aka \"Liddle Michael\" The #Hypocrite Billionaire Believes He Could Buy Your Vote🤣","Sentiment":0.0},"16":{"date":"2019-12-05 09:52:38","tweet":"He's always gone by Michael Bloomberg. Sounds like the billionaire wants us to believe he's like one of us. He's a coward for entering this late & not debating the other Dems. We'll wait for you to ask tough questions. He thinks he can buy the nomination & buy the election.","Sentiment":-0.1534722222},"17":{"date":"2019-12-05 09:36:34","tweet":"Why would Michael Bloomberg be against good families?","Sentiment":0.7},"18":{"date":"2019-12-05 09:29:17","tweet":".@MikeBloomberg aka \"Liddle Michael\" Selling His (Gun Free Zone Island) #Bermuda Mansion, which does not have a single solar panel but When He is there surrounded by armed bodyguards🤑🤑","Sentiment":0.1642857143},"19":{"date":"2019-12-05 09:22:53","tweet":"@MikeBloomberg We hope many people will support the Michael Bloomberg 2020 campaign~^","Sentiment":0.5}}