{"0":{"date":"2019-12-05 18:02:24","tweet":"New Hampshire Representative Marjorie Smith Endorses Michael Bennet for President …","Sentiment":0.1363636364},"1":{"date":"2019-12-04 12:01:16","tweet":"Michael Bennet Calls on MLB Commissioner to Save Minor League Baseball in Colorado, Iowa, and Nationwide …","Sentiment":-0.05},"2":{"date":"2019-12-03 18:10:15","tweet":"Michael Bennet to Launch Five-Day Tour in New Hampshire on December 6-10, 2019 …","Sentiment":0.1363636364},"3":{"date":"2019-12-03 17:20:07","tweet":"New polling shows most Coloradans don’t know who Michael Bennet is.","Sentiment":0.3181818182},"4":{"date":"2019-12-03 16:45:39","tweet":"People I would willingly vote for: Sanders, Harris, Castro People who will only get my vote because of the supreme court nominations up for grabs: Mike Bennet Joe Biden Michael Bloomberg Pete Buttigieg John Delaney Tulsi Gabbard Deval Patrick Tom Steyer and Marianne Williamson","Sentiment":0.125},"5":{"date":"2019-12-03 01:57:50","tweet":"WATCH: Ironclad Mike Braun (R-IN) takes Michael \"Alpha Dog\" Bennet (D-CO) by surprise with this merciless five-star kidney smash","Sentiment":-0.7},"6":{"date":"2019-12-03 00:14:49","tweet":"Hey, I hammered Romanoff for primarying Bennet in 2010 as some kind of lefty when his politics and Bennet’s politics had been more or less identical. I mean, he endorsed Clinton in 2008. What’s real? I don’t know. But Romanoff has basically been running from the left ever since.","Sentiment":0.1368055556},"7":{"date":"2019-12-02 14:13:04","tweet":"Michael Bennet Statement on Steve Bullock and DNC Debate Rules …","Sentiment":0.0},"8":{"date":"2019-12-02 13:54:38","tweet":"Bullock’s case in D primary began with fact he won repeatedly in a deep-red state. It never caught on. It’s similar to ⁦@MichaelBennet⁩’s argument that he’s won twice in a swing state, but Bennet, against all odds, hangs on. #copolitics …","Sentiment":0.2},"9":{"date":"2019-11-29 10:20:09","tweet":"I am urging my 47 followers to give Michael Bennet a look. Sorry Mike it’s the best I got. …","Sentiment":0.25},"10":{"date":"2019-11-28 09:08:50","tweet":"Yang is running on an idea. He's doing well based on where he started. He's raising money. This makes Yang's campaign more legit than: * Michael Bennet * Mike Bloomberg * Cory Booker * Steve Bullock * John Delaney * Kamala Harris * Deval Patrick * Joe Sestak","Sentiment":0.5},"11":{"date":"2019-11-26 17:59:30","tweet":"So - AL - George Wallace AK - Mike Gravel, I guess? AZ - John McCain, Bruce Babbitt, Mo Udall AR - Bill Clinton, Mike Huckabee CA - Kamala Harris, Jerry Brown, Richard Nixon, Ronald Reagan CO - Gary Hart, Michael Bennet, Pat Schroeder CT - Joe Lieberman DE - Joe Biden... …","Sentiment":0.0},"12":{"date":"2019-11-25 13:10:52","tweet":"Is this Michael Bennet or Mike Bloomberg?","Sentiment":0.0},"13":{"date":"2019-11-20 20:54:00","tweet":"Some last minute co-sponsors! McConnell, Mitch [R-KY] Bennet, Michael F. [D-CO] Moran, Jerry [R-KS] Braun, Mike [R-IN] Klobuchar, Amy [D-MN] Boozman, John [R-AR] Grassley, Chuck [R-IA] Schumer, Charles E. [D-NY] Murray, Patty [D-WA] Daines, Steve [R-MT] Brown, Sherrod [D-OH]","Sentiment":0.0},"14":{"date":"2019-11-19 19:31:48","tweet":"List of Republicans currently running for the Democratic nomination: Joe Biden Amy Klobuchar Pete Buttigieg John Delaney Steve Bullock Michael Bennet Mike Bloomberg","Sentiment":0.0},"15":{"date":"2019-11-16 14:18:52","tweet":"Michael Bennet is a prick who stands for literally nothing other than one line phrases like “if you care about children vote for me”. Go fuck yourself Mike, I hope somebody primaries you for your senate seat. …","Sentiment":-0.2625},"16":{"date":"2019-11-14 14:36:27","tweet":"Among the eight that did not vote on Menashi's confirmation are the senators vying for the 2020 Democratic nomination: Sens. Michael Bennet, Cory Booker, Kamala Harris, Amy Klobuchar, Bernie Sanders and Elizabeth Warren. Sens. Doug Jones (D) and Mike Rounds (R) also did not vote …","Sentiment":0.0},"17":{"date":"2019-11-11 23:18:21","tweet":"Mitt Romney Leads Senate RINOs in Bipartisan 'Climate Caucus' to Push for Sweeping Environmental Regulations … via @BigLeaguePol Romney, Lindsey Graham, Lisa Murkowski, Mike Braun, Jeanne Shaheen, Michael Bennet, Angus King","Sentiment":0.0},"18":{"date":"2019-11-10 14:49:44","tweet":"this is the look colorado senator michael bennet gives his wife every time she fucks the next door neighbor oh, i'm sorry i meant when she \"engages in an open relationship\" and good ol' mike just stands there, stoned to the bone ladies and gentlemen: the centennial state","Sentiment":0.05},"19":{"date":"2019-11-10 11:11:08","tweet":"@DavidCornDC Michael Bennet should get a closer look by democrats.","Sentiment":0.0}}