{"0":{"date":"2019-12-05 20:01:45","tweet":"Did you know they’re taggable? @TheChristianLft","Sentiment":0.0},"1":{"date":"2019-12-05 20:01:43","tweet":"People dont need another perspective when it comes to my family history... I own it.","Sentiment":0.6},"2":{"date":"2019-12-05 20:01:43","tweet":"Obama didn't want him to run, that's why.","Sentiment":0.0},"3":{"date":"2019-12-05 20:01:40","tweet":"“We are this close to the point of no return on climate we can’t wait- ⁦@PeteButtigieg⁩ #fitn #ActOnClimate","Sentiment":0.0},"4":{"date":"2019-12-05 20:01:38","tweet":"Yeah, Pete's not qualified to be President. I will support Bernie enthusiastically if he wins but I am worried that he will hire incompetent ideologues to perform important administrative functions, just like Trump did. The presidency is a bureaucratic role","Sentiment":0.1166666667},"5":{"date":"2019-12-05 20:01:36","tweet":"an echo chamber as toxic as the Fox News echo chamber is. It’s a fine argument to say that you might like to have a woman or a person of color in the Presidency, because that person might have more personal experience with specific kinds of issues. But when you throw out tropes","Sentiment":0.2291666667},"6":{"date":"2019-12-05 20:01:35","tweet":"Wow you really are insufferable Pete.","Sentiment":0.15},"7":{"date":"2019-12-05 20:01:34","tweet":"As constructed this is correct but in practice it is not. Overages from MC come from the general fund. This will grow to the entire budget in less than 20 years. It is flawed in its design, and has been for decades.","Sentiment":-0.1541666667},"8":{"date":"2019-12-05 20:01:27","tweet":"Top story: Pete Buttigieg scores endorsements from former Obama officials - CNNPolitics …, see more …","Sentiment":0.3333333333},"9":{"date":"2019-12-05 20:01:22","tweet":"I’m guessing the federal investigation that ruled that the chief had illegally recorded phone calls of the white police officers had nothing to do with it? Mayor Pete isn’t above criticism, but the least journalists can do is use all the facts.","Sentiment":-0.2},"10":{"date":"2019-12-05 20:01:19","tweet":"All Trump supporters are either racist or ignoring racism, Pete Buttigieg says - Hey, is that Petty the fag mouthing off again? Huh?","Sentiment":0.0},"11":{"date":"2019-12-05 20:01:17","tweet":"Top story: Pete Buttigieg scores endorsements from former Obama officials - CNNPolitics …, see more","Sentiment":0.3333333333},"12":{"date":"2019-12-05 20:01:14","tweet":"Explain @PeteButtigieg . Let's hear your explanation of these comments. …","Sentiment":0.0},"13":{"date":"2019-12-05 20:01:11","tweet":"I have huge hell no’s about any candidate who fakes 400 endorsements to try and compensate for a truly horrible 7 year record of enabling racism. #FakedEndorsementsPete","Sentiment":-0.3},"14":{"date":"2019-12-05 20:01:08","tweet":"Actually why don’t you log off... or just delete your account","Sentiment":0.0},"15":{"date":"2019-12-05 20:01:04","tweet":"There are many things I do actually like about Sanders and his polices, but too many of his super fans are just awful.","Sentiment":0.0666666667},"16":{"date":"2019-12-05 20:01:03","tweet":"You didn’t see the invitation?","Sentiment":0.0},"17":{"date":"2019-12-05 20:00:59","tweet":"The protestor interrupted a black woman speaking and suggested she was the wrong black leader because she was well dressed. How is that not racist?","Sentiment":-0.2777777778},"18":{"date":"2019-12-05 20:00:59","tweet":"so you wouldnt tell candice owens shes wrong?","Sentiment":-0.5},"19":{"date":"2019-12-05 20:00:55","tweet":"“Buried the lede” = Pete spoke too much. Me only like headlines.","Sentiment":0.0}}