[{"date":"2019-02-01T14:30:45+00:00","tweet":"Some Montana GOP legislators speculate that Gov. Steve Bullock's POTUS flirtations are just a headfake for a #MTSEN bid. We just don't believe it …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T10:10:05+00:00","tweet":"Montana Gov. Steve Bullock delivers his final state of the state speech with digs at Washington and plaudits from state GOP lawmakers","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-31T16:36:51+00:00","tweet":"\"We all knew that 2020 was a presidential pipe dream for Gov. Steve Bullock (D-MT), but we thought they'd at least give him a chance to eat a corn dog at the Iowa State Fair this year before the wheels came off of his 2020 run.\" - @aaronflint …","name":"steve bullock","Sentiment":0.2},{"date":"2019-01-30T16:54:21+00:00","tweet":"The next US President should be Governor Steve Bullock of Montana. He is honest, fair and can deal with Republican opponents so that everyone wins. He is a family man and knows how to BALANCE A BUDGET. He is the one. Please get the word out!","name":"steve bullock","Sentiment":0.41875},{"date":"2019-01-30T13:27:59+00:00","tweet":"The Democrats' dream 2020 Senate slate starts with Stacey Abrams in GA, Beto O'Rourke in TX, and Steve Bullock in MT. But there are 19 other GOP seats up for election. Who are your dream candidates in each race, no matter how big of a longshot? …","name":"steve bullock","Sentiment":-0.0625},{"date":"2019-01-29T00:16:04+00:00","tweet":"Montana Gov. Steve Bullock doesn't have decades of name recognition like Donald Trump, the money, or the political clout of other Democrats in the field, but he was the only Democratic governor to get re-elected in a state that Trump won. - @NBCLeftField","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-01-27T22:17:29+00:00","tweet":"Steve Bullock for president? @VaughnHillyard reports for @NBCLeftField, first seen @KasieDC …","name":"steve bullock","Sentiment":0.25},{"date":"2019-01-24T11:10:23+00:00","tweet":"MT AG Tim Fox (R) says he’ll run for governor in 2020. Gov. Steve Bullock is term-limited - …","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-22T14:13:12+00:00","tweet":"Governor Steve Bullock, photographed with PPMT Vice President of External Affairs Laura Terrill, stands with Planned Parenthood and the 72% of Americans who support Roe V. Wade. . #ProtectRoe #AbortionIsHealthCare #MontanaWontGoBack #MontanaProtectsRoe #IStandWithPP","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-18T15:33:04+00:00","tweet":"Montana Gov. Steve Bullock says the shutdown is impacting his state in concrete ways, including no new training for firefighters.","name":"steve bullock","Sentiment":0.0409090909},{"date":"2019-01-18T05:51:46+00:00","tweet":"Fri. guest list: Donny Deutsch, Elise Jordan, Mike Barnicle, John Podhoretz, Jonathan Swan, Julia Ainsley, Rep. Ted Deutch, Sam Stein, Bill Kristol, Eugene Robinson, Julian Castro, Rep. Mike Sherrill, Gov. Steve Bullock, Brian Sullivan, Soumaya Keynes, Richard Stengel and more","name":"steve bullock","Sentiment":0.5},{"date":"2019-01-17T05:10:55+00:00","tweet":"\"The remedies are there: the trade and diplomatic and policy experts, easily accessible on Twitter who wearily correct misunderstandings day in, day out: Jean-Claude Piris, Jonathan Faull, Ian Dunt, Steve Bullock and many more.\" writes @jennirsl #Brexit …","name":"steve bullock","Sentiment":0.4583333333},{"date":"2019-01-15T09:04:37+00:00","tweet":"#UTLA #Strike4Ed UPDATE Supports #UTLAStrong w\/Bernie, Kamala & Ojeda: Tulsi Gabbard More silent 2020 prospects: Eric Garcetti Eric Swalwell Bob Casey Chris Murphy John Hickenlooper Steve Bullock John Delaney Pete Buttigieg Andrew Yang Marianne Williamson Terry McAuliffe","name":"steve bullock","Sentiment":0.25},{"date":"2019-01-14T13:43:01+00:00","tweet":"Montana Gov. Steve Bullock is calling the U.S. Supreme Court's decision to leave Montana's campaign contribution limits in place a big deal. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-12T10:36:29+00:00","tweet":"Unlimited corporate spending has “undermined us, because people don’t believe the system is responsive to their actual concerns,” says Steve Bullock. “They don’t think they have a shot at influencing elections, and that affects trust in institutions.” …","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-10T16:37:18+00:00","tweet":"Tell Montana’s Governor Steve Bullock to withdraw from Yellowstone grizzly bear delisting appeal - Sign the Petition! via @ChangeorgLatino","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-09T09:13:01+00:00","tweet":"People who shouldn’t run for President: Joe Biden Bernie Sanders Beto O’Rourke Tulsi Gabbard Tom Steyer Michael Bloomberg Howard Schultz Eric Garcetti Steve Bullock Eric Swalwell Jay Inslee Mitch Landrieu John Hickenlooper Richard Ojeda John Delaney Oprah Mark Cuban The Rock","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-08T13:18:56+00:00","tweet":"To a packed room, MT Gov Steve Bullock espouses the multitude of economic benefits of Medicaid expansion. Good for health, workers and MT’s quality of life. I stand strong for lifting the expansion sunset. #mtleg #mtgov","name":"steve bullock","Sentiment":0.4444444444},{"date":"2019-01-08T13:00:20+00:00","tweet":"Michael Bloomberg, financier and environmental activist Tom Steyer, and Montana Governor Steve Bullock would all be long shots should they run in 2020. But they also each have a case to make","name":"steve bullock","Sentiment":-0.05},{"date":"2019-01-04T19:58:48+00:00","tweet":"1. Kamala Harris. RECORD black turnout if she's nominee. 2. Sherrod Brown.... the best labor magnet dems have. 3. Amy Klobuchar... we need a Midwest dem. 4. Steve Bullock I'm a sucker for governors. 5. Cory booker: we need black turnout at or above 65% to get Trump out. …","name":"steve bullock","Sentiment":0.0733333333},{"date":"2019-02-01T16:55:03+00:00","tweet":"In this hyperpartisan time, this qualifies as high praise from a Republican for Montana's Democratic Gov. Steve Bullock. …","name":"steve bullock","Sentiment":0.16},{"date":"2019-02-01T16:49:49+00:00","tweet":"Governor Steve Bullock of Montana is in his last term which is finished in 2020. He would be a logical choice as President, as he is honest, intelligent, and QUALIFIED. His priorities represent the people and not special interests. He is a good guy, and deserves a chance.","name":"steve bullock","Sentiment":0.3619047619},{"date":"2019-01-30T09:47:50+00:00","tweet":"This story is ostensibly a dink on DeBlasio but it is also a hit to the @DSCC and @SenSchumer, who had to hope that Steve Bullock's presidential aspirations would give way to a challenge to @SteveDaines' re-elect in Montana.","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-28T16:37:08+00:00","tweet":"5\/ Steve Bullock moves into first on Tier 5, followed by Mitch Landrieu, who advances one spot. In a rapid upward move, Joaquin Castro moves from fourth in Tier 6 to third in Tier 5. Bernie Sanders slumps into fourth, his high polling offset by prospects of ugly campaign tactics.","name":"steve bullock","Sentiment":-0.0483333333},{"date":"2019-01-28T05:05:46+00:00","tweet":"Despite bipartisan support for infrastructure, it’s been nearly a decade since a bonding bill has made it past the governor’s desk. Can a new Republican plan to reshape the way the state funds infrastructure survive Gov. Steve Bullock's veto pen? …","name":"steve bullock","Sentiment":-0.0045454545},{"date":"2019-01-23T22:53:11+00:00","tweet":"HELENA - Governor Steve Bullock was joined by public health professionals on Wednesday to announce new tools to help Montana parents. …","name":"steve bullock","Sentiment":0.0681818182},{"date":"2019-01-23T06:41:29+00:00","tweet":"Steve Bullock @guitarmoog w his co-host of the Cakewatch podcast* Chris Kendall @ottocrat * I enjoy Remainiacs* (@iandunt & @pimlicat especially, if I have to choose) but when I have both to listen to I keep the cake until last * … …","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-01-22T21:11:02+00:00","tweet":"Carl Nyberg's analysis of the Dem 2020 field: 1. Bernie 2. EWarren 3. Stacey Abrams 4. Jay Inslee 5. Andrew Yang 6. Richard Ojeda 7. Hillary 8. Oprah 9. Andrew Gillum 10. Tulsi Gabbard 11. Kamala Harris 12. Beto O'Rourke 13. Sherrod Brown 14. Steve Bullock 15. Eric Holder","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-22T09:00:37+00:00","tweet":"Red state governors tout economic success of Medicaid expansion: Montana’s GOP Gov. Steve Bullock presented a report in early January that shows Medicaid expansion has added $270 million to the state’s economy annually since its passage in 2015 …","name":"steve bullock","Sentiment":0.15},{"date":"2019-01-22T00:45:38+00:00","tweet":"Steve Bullock: At what point can revoking Article 50 be called an emergency measure? March 1st? the 28th March? And: it has to be done to avoid a disaster for UK. #Brexit #HouseofCommons …","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-21T20:48:39+00:00","tweet":"One more thing: The fact he was in DC in 1989 won't be a good thing either. Too many votes to be used AGAINST him. Come on guys! Steve Bullock Chris Murphy Sherrod Brown better white choices. …","name":"steve bullock","Sentiment":0.465},{"date":"2019-01-20T17:43:35+00:00","tweet":"5\/ Elizabeth Warren moves to 1st on Tier 5 on momentum from her announcement to run. Kirsten Gillibrand takes the spot behind Warren, but is weighed down by past mixed allegiances. Steve Bullock and Mitch Landrieu complete Tier 5.","name":"steve bullock","Sentiment":-0.1411111111},{"date":"2019-01-17T19:52:00+00:00","tweet":"Governor Steve Bullock is stumping campaign finance reform.","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-17T12:28:02+00:00","tweet":"Montana Governor Steve Bullock faces Ohio Senator Sherrod Brown. Who gets your vote?","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-17T09:14:52+00:00","tweet":"MT Gov. Steve Bullock showing no signs of urgency on WH’2020 bid, not likely to announce until after legislative session ends in April - …","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-15T23:07:16+00:00","tweet":"More Jon tester on MSNBC! He’s the real deal and doing a great job for his constituents. Tester invoked Mansfield - I say tester as senate majority leader in 2020! And #defeatdaines2020. The man is a do-nothing. Let’s urge and elect Steve bullock to run against Daines.","name":"steve bullock","Sentiment":0.65625},{"date":"2019-01-11T18:27:48+00:00","tweet":"Yes! Just because John Hickenlooper, Steve Bullock & Richard Ojeda are mulling quixotic presidential campaigns doesn’t mean Cory Gardner, Steve Daines and Shelley Moore Capito don’t have to worry about them. …","name":"steve bullock","Sentiment":-0.05625},{"date":"2019-01-11T16:55:03+00:00","tweet":"Can this dark-horse Dem from red-state #Montana win the party's nod on a message that dark money is ruining their lives? Two-term Gov. Steve Bullock thinks Americans are fed up enough to give him a chance. @Newsweek pro @ninaburleigh chats him up.","name":"steve bullock","Sentiment":0.2166666667},{"date":"2019-01-11T12:36:13+00:00","tweet":"Steve Bullock will probably damage his Montana brand quite a bit if he runs for president and then drops down. Our best hope is to make him avoid a bid for President all together.","name":"steve bullock","Sentiment":0.4222222222},{"date":"2019-01-04T17:23:21+00:00","tweet":"Steve Bullock, unfortunately Steve Bullock doesn't currently agree. I don't have a second choice, do you?","name":"steve bullock","Sentiment":-0.1666666667},{"date":"2019-01-04T13:06:09+00:00","tweet":"I am watching these people for Presidential announcements: Adam Schiff Amy Klobuchar Bob Casey Jr. Eric Garcetti Eric Holder Eric Swalwell Howard Schultz Jeff Merkley John Hickenlooper Lincoln Chafee Pete Buttigieg Steve Bullock Terry McAuliffe Tim Ryan Tom Steyer Tulsi Gabbard","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-04T13:00:04+00:00","tweet":"Montana Gov. Steve Bullock is proposing to set aside $4.25M in the 2019 budget to expand Great Falls College Montana State University’s dental hygienist program. The funds will cover... …","name":"steve bullock","Sentiment":0.8},{"date":"2019-01-04T12:21:07+00:00","tweet":"Yo, Steve Daines (ND) is vulnerable. Steve Bullock should run against him.","name":"steve bullock","Sentiment":-0.5},{"date":"2019-01-04T06:47:34+00:00","tweet":"Who the hell is Governor Steve Bullock...... Montana.. jeez, they have all kind of names up there to make the field look large. 1 declared candidate to date #MorningJoe","name":"steve bullock","Sentiment":0.4071428571},{"date":"2019-01-04T06:31:11+00:00","tweet":"No, you are being honest. AIC has enormous charm. As does Steve Bullock, the gov of Montana and Jay inslee, the gov of Washington.","name":"steve bullock","Sentiment":0.3},{"date":"2019-01-04T02:32:03+00:00","tweet":"The man who killed Colstrip, is trying to kill the rest of the coal industry, and Governor Steve Bullock buddy wants to be your President. #mtpol #MTVets #MTSen @aaronflint @wwtcorp @RightisRight18 @_IamAnita_D @AbujaPeacemaker @MarianDClough @DainesforMT …","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-03T23:47:45+00:00","tweet":"\"I hope you ask all contenders similar questions?\" What does this even mean? Why would I ask similar questions to someone like Beto O'Rourke, who, unlike Julián Castro, actually had the guts to run for a major elected office in a red state? Or Steve Bullock, who ran and won?","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-01-03T23:30:31+00:00","tweet":"It could be a coup if we could get Steve Bullock to run in that MT-Sen race. His senate term would start at the end of his term-limited governor's term anyway so why not","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-03T13:30:01+00:00","tweet":"Anti-abortion legislation has failed consistently under Gov. Steve Bullock’s tenure, but three bills, and perhaps more, are in the works before the 2019 session begins. …","name":"steve bullock","Sentiment":0.0833333333},{"date":"2019-01-03T13:14:27+00:00","tweet":"Tell Montana’s Governor Steve Bullock to withdraw from Yellowstone grizzly bear delisting appeal - Sign the Petition! via @Change","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-03T11:30:13+00:00","tweet":"#Montana Secretary of State Corey Stapleton plans to run for governor. Stapleton says he’s the right person for the job once Governor Steve Bullock terms out of the office in 2020. #mtnews #mtpol","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-01-03T10:42:46+00:00","tweet":"She would be a terrible candidate. No sense of humor.Tulsi Gabbard, Kirsten Gillibrand, or Sherrad Brown would be better. either of 2 Montana natives - Gov Steve Bullock , Sen Tester - would win big but they won't run","name":"steve bullock","Sentiment":0.075},{"date":"2019-01-03T10:25:34+00:00","tweet":"Made some changes to my 2020 Senate dream team. Kerry Donovan for CO Greg Staton for AZ Jeff Jackosn for NC Sara Gideon for ME Steve Bullock for MT Mandy Powers-Norrell for SC Jason Carter for GA Helena Moreno for LA Liz Mathis for IA Ivy Spohnholz for AK Lizzie Fletcher for TX","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-03T10:16:50+00:00","tweet":"Hickenlooper was Denver mayor, good point. He's behind Steve Bullock in my category of \"arcane Western governors.\"","name":"steve bullock","Sentiment":0.1},{"date":"2019-01-03T08:45:27+00:00","tweet":"Mitch Landreau Steve Bullock Sherrod Brown","name":"steve bullock","Sentiment":0.0},{"date":"2019-01-03T07:31:14+00:00","tweet":"MONTANA. Sec of State Corey Stapleton (R) announced he will run vs Gov Steve Bullock (D) next year. Term-limited Atty Gen Tim Fox (R) also expected to enter the race.","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2019-01-01T10:43:29+00:00","tweet":"So the fifth guy in is Steve Bullock, Governor of Montana. Not someone I’d be voting for in the primary considering I had asked him to make ICE obey the law in Montana & require them to get a judge’s signature on information requests, which he wouldn’t do.","name":"steve bullock","Sentiment":0.4},{"date":"2018-12-31T09:29:51+00:00","tweet":"Meh..... you blew it by the way you behaved In 2016.... and went after Obama in 2017 over speaking fees. Hope Sherrod runs, Steve Bullock Kamala Harris Amy klobuchar and others. …","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-29T18:36:44+00:00","tweet":"I'm riding with Kamala and Sherrod as my top two picks with Amy Klobuchar Steve Bullock if they run... but I'm gonna defend Beto over any berner. …","name":"steve bullock","Sentiment":0.5},{"date":"2018-12-28T16:18:50+00:00","tweet":"Tell Montana’s Governor Steve Bullock to withdraw from Yellowstone grizzly bear delisting appeal Dites au gouverneur du Montana, Bullock, de se retirer de l’appel en radiation de l’ours grizzly - Sign the Petition! via @ChangeFrance","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-14T18:06:02+00:00","tweet":"Six state governors (Montana, New York, New Jersey, Hawaii, Vermont, and Rhode Island), led by Gov. Steve Bullock of Montana, have issued Executive Orders declaring that the state’s government will not do business with ISPs that violate net neutrality. …","name":"steve bullock","Sentiment":0.0909090909},{"date":"2018-12-13T21:20:56+00:00","tweet":"My top 5: -Kamala Harris -Amy Klobachar -Cory Booker -Julian Castro -Sherrod Brown Dark Horse: -Steve Bullock","name":"steve bullock","Sentiment":0.175},{"date":"2018-12-11T17:41:51+00:00","tweet":"While Biden keeps top supporters guessing about his intentions, some of his biggest backers have been meeting — just in case — with others, including Steve Bullock. Some taking a look @ Sherrod Brown and Amy Klobuchar.","name":"steve bullock","Sentiment":0.5},{"date":"2018-12-11T16:30:00+00:00","tweet":"It's the 3rd anniversary of Montana governor Steve Bullock allowing bison to roam outside of the boundaries of Yellowstone National Park. NRDC has long worked with our partners in the region to protect the Yellowstone bison. Learn more:","name":"steve bullock","Sentiment":0.1125},{"date":"2018-12-10T01:42:37+00:00","tweet":"That is because you are a True Leader & Statesman. @SenatorTester PLEASE do not discount a run for the Presidency in 2020, even if Gov. Steve Bullock is contemplating a run. While Gov. Steve Bullock is qualified, You are more qualified & more desirable\/preferable. …","name":"steve bullock","Sentiment":0.45},{"date":"2018-12-08T04:17:28+00:00","tweet":"We are 4 months from falling off a disastrous no-deal cliff and your most recent proposal is irresponsible fantasy drivel as explained at length by Steve Bullock @GuitarMoog in this thread: …","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2018-12-07T02:02:26+00:00","tweet":"Excellent thread from Steve Bullock which demolishes the deeply-dishonest position on #Brexit of @jeremycorbyn As Steve says: \"The country is crying out for a leader to come clean [on Brexit]. People can take it. They're not children who have to be protected from the truth.\" …","name":"steve bullock","Sentiment":0.3888888889},{"date":"2018-12-06T18:58:56+00:00","tweet":"... and Steve Bullock compiled this handy thread of facts for people (especially MPs) to get to grips with... …","name":"steve bullock","Sentiment":0.3},{"date":"2018-12-06T18:00:51+00:00","tweet":"Steve Bullock. Jon Tester. Andrew Gillum. Amy Klobuchar.","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-06T11:34:58+00:00","tweet":"Dear @HackneyAbbott, As you are my MP, at least until my right to vote in the UK ceases in around a year, I’d be very grateful if you could glance at the attached brief thread on the realities of Brexit that face the UK. With many thanks, Steve Bullock …","name":"steve bullock","Sentiment":0.1476190476},{"date":"2018-12-06T06:03:00+00:00","tweet":"Montana Gov. Steve Bullock is fighting dark money in politics — and it’s working","name":"steve bullock","Sentiment":-0.15},{"date":"2018-12-05T10:59:22+00:00","tweet":"This morning: • Sen. Jon Tester asked if thinks Gov. Steve Bullock will run for Senate. Tester says he thinks Bullock is looking at it. • Bullock’s chief of staff, a former DSCC ED, goes on the record to push back. • Tester’s chief of Staff then goes on the record.","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-05T10:59:18+00:00","tweet":"Now Jon Tester's team says he misheard question when he answered that Steve Bullock was running for #MTSEN","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-05T10:23:27+00:00","tweet":"Jon Tester & Steve Bullock would be a fantastic pairing in the Senate.","name":"steve bullock","Sentiment":0.4},{"date":"2018-12-05T09:05:20+00:00","tweet":"Steve Bullock has been publicly mulling a presidential bid for months. And Bullock Chief of Staff Tom Lopach -- who happens to be Tester's former chief and DSCC ED (!) -- goes on record to knock Tester down on Senate bid. \"Bullock is not interested in a Senate run.\"","name":"steve bullock","Sentiment":-0.0561111111},{"date":"2018-12-05T09:03:12+00:00","tweet":"Department of over-skis: Montana Sen. Jon Tester (D) was asked last night if Gov. Steve Bullock (D) will run for SENATE. \"Yeah, he’s running. Yeah he is,\" Tester replied. Not so, says team Bullock. 1\/2 …","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-05T03:05:17+00:00","tweet":"True, without question. Steve Bullock has me curious enough to research a bit more, I'd never heard of him before about 5 hours ago & research so far (very quick, so i could be completely wrong) says he's neither a neoliberal nor a clearcut criminal so him vs Sanders I'd like2see","name":"steve bullock","Sentiment":0.0479166667},{"date":"2018-12-05T03:02:27+00:00","tweet":"Steve Bullock overall of these is the one I'm most curious about- I don't know much about him & so far he neither seems like a clearcut criminal nor a neoliberal so... …","name":"steve bullock","Sentiment":0.05},{"date":"2018-12-05T02:09:18+00:00","tweet":"STEVE BULLOCK FOR SENATE I AM ERECT","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-05T01:20:05+00:00","tweet":"Did you factor in Steve Bullock in MT?? Just wondering. Just saw a video of Tester saying Bullock is running for senate.","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-05T01:08:23+00:00","tweet":"This article is just from a few days ago. It states that Steve Bullock has very little interest in running for Senate. I very much doubt he runs. #MTSEN …","name":"steve bullock","Sentiment":-0.06125},{"date":"2018-12-04T23:57:21+00:00","tweet":"yeah, X out Bernie for sure... but Steve Bullock? BOY HOWDY THAT GUY CAN WIN!","name":"steve bullock","Sentiment":0.75},{"date":"2018-12-04T23:21:23+00:00","tweet":"Be on the lookout for Cheri Bustos and Steve Bullock. If the economy cools, Democrats will be relevant.","name":"steve bullock","Sentiment":0.4},{"date":"2018-12-04T22:48:03+00:00","tweet":"\"Then we exclude every potential candidate from a red state.\" No we wouldn't — Steve Bullock, John Bel Edwards, Doug Jones, and Kyrsten Sinema ran for statewide office and won in traditionally \"red\" states.","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-04T21:49:39+00:00","tweet":"Second term MT Governor Steve Bullock more viable candidate. Beto should challenge Cornyn for Senate seat 20 (does not have adequate exec experience to be Pres (nor did 44 but outlier). Also don't think Beto hunts - only white guy who can win that does not is Biden - besides 45).","name":"steve bullock","Sentiment":0.2722222222},{"date":"2018-12-04T21:39:19+00:00","tweet":"ELIZABETH WARREN KAMALA HARRIS SHERROD BROWN STEVE BULLOCK BETO O’ROURKE JOE BIDEN KRISTEN GILLIBRAND ERIC HOLDER MICHAEL BLOOMBERG","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-04T21:24:46+00:00","tweet":"Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-04T19:33:19+00:00","tweet":"All of these people have hinted at, or are making moves to, run for President in 2020. What a field: 15. Montana Gov. Steve Bullock 14. Oprah Winfrey 13. New Orleans Mayor Mitch Landrieu 12. Former U.S. attorney... …","name":"steve bullock","Sentiment":0.0681818182},{"date":"2018-12-04T18:49:59+00:00","tweet":"G COLLINS-NYT - 11\/29: Feel free 2discuss whether A Cuomo would B a better presidential nominee than Beto O’Rourke. Also, u can throw in Joe Biden, Cory Booker, Jerry Brown, Sherrod Brown, MT Gov. Steve Bullock & former HUD Sec'y Julian Castro. That gets us pretty much through C.","name":"steve bullock","Sentiment":0.2083333333},{"date":"2018-12-04T18:18:32+00:00","tweet":"Who the hell is Steve Bullock? I'd say Holder\/Harris but that would undoubtedly inspire a Second Civil War, so maybe Holder\/Klobuchar or Harris\/Brown.","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-04T18:00:20+00:00","tweet":"Montana Gov. Steve Bullock ordered all flags at public buildings in Montana flown at half-staff from last Saturday through Dec. 30. …","name":"steve bullock","Sentiment":0.0},{"date":"2018-12-04T16:47:46+00:00","tweet":"Thread by (new) Steve Bullock !!!! …","name":"steve bullock","Sentiment":0.3329190341},{"date":"2018-12-04T15:50:04+00:00","tweet":"My party are bonified silver tongue suckers The Michael avenatti flirtation is a perfect example. He talked a good game, seemed sure of himself.... and motherfucker had him selecting cabinet members. Meanwhile Chris Murphy and Steve Bullock get the omalley treatment . …","name":"steve bullock","Sentiment":0.3},{"date":"2018-12-04T14:21:34+00:00","tweet":"There's also Steve Bullock, Hickenlooper, I think Red State Dems are the best shot of cutting Trump or Pence to 1 term alone right now: they've historically done best at ousting incumbent Republican Presidents, just looking at 1976 and 1992 alone, both are Southerners who did it.","name":"steve bullock","Sentiment":0.280952381},{"date":"2018-12-04T11:51:44+00:00","tweet":"Why bullock and Harris stick out to me so much? Steve bullock has never been to DC.... fresh face and a plus. You can't tie one vote of Kamala Harris back to Obama... with the exception of Healthcare. That's a plus. She came in the same time as Trump. Dc Newbie.","name":"steve bullock","Sentiment":0.125},{"date":"2018-12-04T11:05:59+00:00","tweet":"YNP famous wolf 926F was shot by a trophy hunter in Cooke City last week. Contact the following if you oppose the killing of wolves around the Park. Mt FWP Commissioners fwcomm@mt.gov Mt Gov Steve Bullock: Mt FWP fwpgen@mt.gov #mtpol @JimRobbins19","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-03-01T17:02:24+00:00","tweet":"Alongside @chrisgreybrexit and @IanDunt, @GuitarMoog alias Steve Bullock is the Brexit commentator I have most enjoyed and benefited from reading for his humour, his insight and his decency. I hope you will join me in wishing him well and hoping he can bring himself to return.","name":"steve bullock","Sentiment":0.5},{"date":"2019-02-28T10:37:15+00:00","tweet":"A cracking discussion between Chris & Steve Bullock about the reasons for Steve quitting Twitter. A few thoughts follow, since Steve apparently came to believe I was waging a \"vendetta against Remain\". …","name":"steve bullock","Sentiment":-0.075},{"date":"2019-02-28T07:39:54+00:00","tweet":"From 1.05... re why @guitarMoog Steve Bullock shut down his twitter account. A great pity. But understandable points. Good discussion between Steve Bullock and Chris Kendall @ottocrat Call me out if any Blindingly Obvious tweets aren't good. Thanks. …","name":"steve bullock","Sentiment":0.3063492063},{"date":"2019-02-27T05:10:34+00:00","tweet":"Steve Bullock get yourself back on Twitter (when you're ready)! We need you on here more than ever.","name":"steve bullock","Sentiment":0.25},{"date":"2019-02-26T17:35:39+00:00","tweet":"People who met\/talked with Hillary to plan for their 2020 campaigns: Joe Biden Amy Klobuchar Kamala Harris Cory Booker Elizabeth Warren John Hickenlooper Julián Castro Terry McAuliffe *\"Gov. Steve Bullock of Montana is trying to schedule a meeting with her.\" interesting... …","name":"steve bullock","Sentiment":0.5},{"date":"2019-02-19T23:15:04+00:00","tweet":"Montana Gov. Steve Bullock doesn't have decades of name recognition like Donald Trump, the money, or the political clout of other Democrats in the field, but he was the only Democratic governor to get re-elected in a state that Trump won. - @NBCLeftField","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-02-15T18:26:35+00:00","tweet":"In which, Montana Governor Steve Bullock (D) dabs during his fourth and final State of the State address...","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T19:34:13+00:00","tweet":"And Steve Bullock in #MTSen …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T16:19:03+00:00","tweet":"Opinion: Democrats should hope Steve Bullock runs, @JRubinBlogger writes. With the possible exception of Elizabeth Warren, no one in the mix for 2020 talks more about the influence of \"dark money.\"","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-02-13T05:40:02+00:00","tweet":"Montana Gov. Steve Bullock will travel to Iowa at the end of the week as he further explores a run for the Democratic presidential nomination","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-09T12:43:27+00:00","tweet":"Beto should run for senate in TX. Steve Bullock should run for senate in MT. Hickenlooper should run for senate in CO. Sherrod Brown needs to hold his seat in OH. We should pick one of the women already running as our presidential nominee.","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-08T11:25:00+00:00","tweet":"In an increasingly crowded primary, the question for John Hickenlooper, Montana Gov. Steve Bullock and others is whether charged-up Democratic voters will opt for governing over grievances.","name":"steve bullock","Sentiment":0.4},{"date":"2019-02-08T07:06:27+00:00","tweet":"Governors: they get the job done! That’s the pitch, at least, from John Hickenlooper and Steve Bullock as they both test out White House bids. …","name":"steve bullock","Sentiment":-0.15},{"date":"2019-02-06T15:43:58+00:00","tweet":"No training again today due to frigid conditions @EmeraldDowns, and another winter storm is due to hit Friday. Meanwhile, 2018 Horse of the Meeting Sippin Fire is ready to begin his 4-year-old campaign with trainer Steve Bullock.","name":"steve bullock","Sentiment":-0.2375},{"date":"2019-02-06T15:01:13+00:00","tweet":"9. Sherrod Brown would be the conscience of the progressive wing and wins big in Ohio. A long shot for the top slot but already has to be on the shortlist for anyone’s VP pick. 10. Steve Bullock wins in Trump Country, is articulate and likeable. But he needs money and Name ID.","name":"steve bullock","Sentiment":0.21},{"date":"2019-02-03T00:00:12+00:00","tweet":"Gov. Steve Bullock — perhaps the one potential 2020 Democratic presidential candidate with a fan club of elected Republicans back home","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-02T21:00:13+00:00","tweet":"“Four years ago I fell short in my role preventing sexual harassment,” Montana Gov. Steve Bullock wrote in a lengthy Medium post published Saturday morning","name":"steve bullock","Sentiment":0.25},{"date":"2019-02-02T20:24:32+00:00","tweet":"Scoop: Montana Governor Steve Bullock has placed a staffer in Iowa to lay groundwork for a possible 2020 bid #IACaucus …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-02T11:00:03+00:00","tweet":"Montana Gov. Steve Bullock, a potential 2020 presidential candidate, said he was “wrong and naïve” in dealing with sexual harassment allegations against his former top aide","name":"steve bullock","Sentiment":0.1},{"date":"2019-02-01T10:10:05+00:00","tweet":"Montana Gov. Steve Bullock delivers his final state of the state speech with digs at Washington and plaudits from state GOP lawmakers","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-01T21:35:40+00:00","tweet":"Steve Bullock, where ya at? Get In! I'm not anti Hickenlooper to be honest or Bullock. Harris and Brown are my top two. Don't see that moving any time soon.... as much as I whine about Kamala's Progressive leanings. …","name":"steve bullock","Sentiment":0.4333333333},{"date":"2019-02-28T13:48:37+00:00","tweet":"I don't see why we are still badgering Steve Bullock about running for the Senate. He's profoundly uninterested. We should be looking elsewhere and the DSCC should talk to other potential candidates.","name":"steve bullock","Sentiment":-0.0138888889},{"date":"2019-02-28T12:20:52+00:00","tweet":"Democratic Gov. Steve Bullock seems just as uninterested in a #MTSEN run in private as he is in public …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-28T10:37:17+00:00","tweet":"But here's the thing. Steve Bullock has left Twitter because of their behaviour & the fallout from it. One of the best anti-Brexit champions has had enough of the drama and quit Twitter. Slowest handclap ever, fringe zealots.","name":"steve bullock","Sentiment":0.3333333333},{"date":"2019-02-27T12:47:45+00:00","tweet":"Some things we learn from public questions #1 - in last year of @lewishamlabour Mayor Steve Bullock, a grand total of 1 new social rent homes were built. Yes, you read that right. One.","name":"steve bullock","Sentiment":0.1364873222},{"date":"2019-02-26T15:09:33+00:00","tweet":"Anyone know what's going on in Westminster, as I haven't a clue? I only hope politicians there know what they're doing.. it looks a complete mess from where I am standing. I'm not surprised Steve Bullock has left. Anyone else feel like giving up?","name":"steve bullock","Sentiment":-0.025},{"date":"2019-02-24T20:25:17+00:00","tweet":"Montana Gov. Steve Bullock, chair of the Natl Govs Assction & likely DEM presidential contender, gives a toast at the WH as President Trump listens on at convening of nation’s governors, tonight—>","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-22T16:45:41+00:00","tweet":"People who've been included in a 2020 Democratic primary poll so far this year: Stacey Abrams, Michael Avenatti, Joe Biden, Michael Bloomberg, Cory Booker, Sherrod Brown, Steve Bullock, Pete Buttigieg, Julian Castro, Hillary Clinton, Andrew Cuomo (cont.) …","name":"steve bullock","Sentiment":0.25},{"date":"2019-02-21T12:54:26+00:00","tweet":"I'm going to assume the gray shoulder on the right is an amalgam of Jay Inslee, John Hickenlooper, Steve Bullock, Bill De Blasio and John Delaney. And the pink sweater on the left is Marianne Williams, holding the spot for Oprah.","name":"steve bullock","Sentiment":0.0619047619},{"date":"2019-02-19T08:26:23+00:00","tweet":"Where Steve Bullock, the latest Democrat flirting with a White House bid, stands on key issues Montana Gov. Steve Bullock is showing increasing signs he is getting serious about a White House bid as he visited with voters and Democratic Party officials in Iowa on Saturday. …","name":"steve bullock","Sentiment":0.0333333333},{"date":"2019-02-17T11:03:42+00:00","tweet":"Montana Gov. Steve Bullock was in Iowa as part of a potential White House bid. Here's where he stands on key issues","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-15T16:00:38+00:00","tweet":"\"Governor Steve Bullock (D-MT) tried to lecture President Trump about declaring a national emergency over the southern border with Mexico. But he blew it. He actually ended up showing why the president is right.\" - @aaronflint …","name":"steve bullock","Sentiment":0.0952380952},{"date":"2019-02-15T06:01:02+00:00","tweet":"You introduced Steve Bullock as a former EU negotiator @SophyRidgeSky You didn’t point out that he had worked for the EU Commission or that he is a voracious campaigner for Remain and a #peoplesvote. This is just not being truthful to your viewers Atypical of SKY continued bias","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-02-14T11:03:41+00:00","tweet":"Beto O'Rourke, Stacey Abrams, Steve Bullock, and John Hickenlooper should all run for Senate in their respective states, rather than run for President.","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T21:50:02+00:00","tweet":"Whoops, they used Kavanaugh's picture for Steve Bullock – or wait, is that Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T14:09:43+00:00","tweet":"Why Democrats should hope Steve Bullock runs …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T08:34:04+00:00","tweet":"Montana Governor Steve Bullock visiting Iowa amid talk of possible 2020 bid","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-03T10:47:12+00:00","tweet":"ICYMI: Montana Governor Steve Bullock is making some moves in Iowa. He's staffing up here in preparation for a potential 2020 run, though he'll likely focus the next few months on the state legislative session back home #IACaucus …","name":"steve bullock","Sentiment":-0.04},{"date":"2019-02-01T16:55:03+00:00","tweet":"In this hyperpartisan time, this qualifies as high praise from a Republican for Montana's Democratic Gov. Steve Bullock. …","name":"steve bullock","Sentiment":0.16},{"date":"2019-02-01T14:30:45+00:00","tweet":"Some Montana GOP legislators speculate that Gov. Steve Bullock's POTUS flirtations are just a headfake for a #MTSEN bid. We just don't believe it …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T14:18:13+00:00","tweet":"Governor Steve Bullock​ highlights education, health in final State of the State address …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T14:17:43+00:00","tweet":"Lentil Soup in Montana? Where is your beloved Governor Steve Bullock now?!? (These maps are completely made up, by the way)","name":"steve bullock","Sentiment":0.4875},{"date":"2019-02-01T13:57:12+00:00","tweet":"Is #MTGov Steve Bullock the 2020 Dem with bipartisan bona fides? Would that be a good thing in a crowded prez primary? via @politico","name":"steve bullock","Sentiment":0.55},{"date":"2019-02-01T13:44:24+00:00","tweet":"MT Gov Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T13:31:03+00:00","tweet":"Montana Gov. Steve Bullock doesn't have decades of name recognition like President Trump, or the clout of other Dems in the field, but he was the only Democratic governor re-elected in a state that Trump won. - NBC Left Field …","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-02-01T11:33:18+00:00","tweet":"Former Montana Gov. and Democratic Governors Association chairman Steve Bullock Covered Up Sex Assault #MeToo, covers for NYC Mayor DeBlasio …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T10:36:01+00:00","tweet":"#Montana governor Steve Bullock's state of the state address: state-funded preschool, more state funding for the university system to freeze tuition, and $5 million for a new need-based aid program for in-state students. @ktvq …","name":"steve bullock","Sentiment":0.3181818182},{"date":"2019-02-01T10:15:51+00:00","tweet":"Possible Nominees could include (these would be the smartest picks): William McRaven Roy Cooper Amy Klobuchar Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T09:55:11+00:00","tweet":"My top 3: 1) Steve Bullock - MT (D) 2) Amy Klobuchar - MN (D) 3) Joe Biden (D) (from 1988 if I have Plutonium and a delorean, else present)","name":"steve bullock","Sentiment":0.25},{"date":"2019-02-01T09:27:33+00:00","tweet":"*adding Governor Steve Bullock to awaiting decision","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T09:20:09+00:00","tweet":"Governors: Steve Bullock, John Hickenlooper and Jay Inslee.","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-01T03:04:10+00:00","tweet":"Bullock seeks to cement legacy in final State of the State Gov. Steve Bullock sought to cement his legacy in his final State of the State speech Thursday, touting improvements in Montana's economy, educational opportunities and health care coverage since he took office in 20…","name":"steve bullock","Sentiment":0.0833333333},{"date":"2019-02-01T00:07:55+00:00","tweet":"Then you have the governors: Washington Gov. Jay Inslee: Inslee is likely to center his work on environmental issues and the threat of climate change. Montana Gov. Steve Bullock: Bullock is a two-term moderate Democratic governor in a state Trump won by 20 points.","name":"steve bullock","Sentiment":-0.0333333333},{"date":"2019-04-03T19:21:57+00:00","tweet":"“There is nothing #progressive in a @UKLabour that opposes #FreedomOfMovement,” Steve Bullock @GuitarMoog writes. #Brexit #JeremyCorbyn #Labour #EUcitizens #Thread … via @PMPmagToday","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-03T17:01:38+00:00","tweet":"Here I hand over to the brilliant Steve Bullock... …","name":"steve bullock","Sentiment":0.9},{"date":"2019-04-02T09:28:06+00:00","tweet":"Reminder: The following (and possibly more) are still talking\/acting like 50%+ chance of running #2020: Stacey Abrams Michael Bennett Joe Biden Steve Bullock Bill de Blasio Terry McAuliffe Seth Moulton Tim Ryan Eric Swalwell","name":"steve bullock","Sentiment":0.25},{"date":"2019-03-28T08:30:52+00:00","tweet":"Action Alert: Do you live in Montana? Call Governor Steve Bullock and ask him to convene a taskforce to address the growing epidemic of Murdered and Missing Indigenous Women. P. 406-444-3111 …","name":"steve bullock","Sentiment":0.0121212121},{"date":"2019-03-26T12:39:26+00:00","tweet":"North Carolina. Plus somehow get Steve bullock to run for senate in Montana. Somehow.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-25T13:26:26+00:00","tweet":"Candidates for whom I will not vote: Michael Bennet Joe Biden Cory Booker Steve Bullock Pete Buttigeig Kirsten Gillibrand Kamala Harris John Hickenlooper Jay Inslee Amy Klobuchar Beto O'Rourke Eric Swalwell Elizabeth Warren Andrew Yang I will vote for Bernie Sanders, though.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-21T10:30:46+00:00","tweet":"Steve Bullock - That's a false choice as the UK can #RevokeArticle50.. Theresa May thinks she's threatening the #EU with #NoDeal, but she's actually threatening her own population with #NoDeal. #PeoplesVote #FinalSay @GuitarMoog","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-03-14T22:41:23+00:00","tweet":"Beto O'Rourke, Steve Bullock, and Stacey Abrams should all be running for the U.S. Senate rather than the White House. This narrow focus on the Presidency is unhealthy and is hurting Democratic chances of winning back the Senate.","name":"steve bullock","Sentiment":-0.02},{"date":"2019-03-14T13:51:56+00:00","tweet":"MONTANA: Term-limited Gov Steve Bullock (D) - the current NGA Chair and a potential presidential candidate - this week said regardless of what he decides on a presidential run, he has \"ruled out\" running against US Sen Steve Daines (R) because he \"wouldn't enjoy\" the job.","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-03-14T10:12:11+00:00","tweet":"Steve Bullock thus far appears impervious to Chuck Schumer's vaunted power of persuasion...","name":"steve bullock","Sentiment":0.1},{"date":"2019-03-13T15:48:13+00:00","tweet":"Montana Governor Steve Bullock speaks at opening ceremony for Cognizant's ATG Missoula Solution Center. #digital @GovernorBullock","name":"steve bullock","Sentiment":-0.05},{"date":"2019-03-11T13:03:22+00:00","tweet":"This is huge news. The @MTDEQ (which is under Democratic Gov. Steve Bullock) concludes the Black Butte Copper Project will have \"no impact to water quality, air quality or aquatic life.\" … #mtpol #mtnews #mtleg","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-03-11T12:00:41+00:00","tweet":"Here are some new markets launching this week, based on trader recs: @AndrewYangVFA added to the 2020 DNOM market. *Who will win the 2020 NH Democratic primary? *Will they run in 2020? Eric Swalwell, Stacey Abrams, Steve Bullock *Will Trump commute the sentence(s) of Manafort?","name":"steve bullock","Sentiment":0.4454545455},{"date":"2019-03-10T12:42:45+00:00","tweet":"If you’re curious about #PurdonNation favorite ⁦@GovernorBullock⁩, read this piece on what a Dem leader can accomplish in a red state. #Bullock2020 Is Steve Bullock the presidential candidate Democrats want? …","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-03-08T09:48:36+00:00","tweet":"Steve Bullock: DRAFT STEVE BULLOCK for U.S. Senate in 2020 - Sign the Petition! via @Change","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T17:45:04+00:00","tweet":"Montana Gov. Steve Bullock has hired veteran Democratic operative Jenn Ridder to work for his PAC, in the latest sign that the Western Democrat is nearing a presidential run","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-03-07T17:26:04+00:00","tweet":"SCOOP - Montana Gov. Steve Bullock hired Jenn Ridder (fmr Polis CM) as senior adviser for his PAC. With @DanielStrauss4: …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T16:33:52+00:00","tweet":"2020 ALERT: Montana Governor Steve Bullock meets tiny puppy out on the Iowa campaign trail #IACaucus","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T16:31:07+00:00","tweet":"Steve Bullock lending a hand in SD 30 special election - tells students “elections are won by people talking to people.”","name":"steve bullock","Sentiment":0.3571428571},{"date":"2019-04-03T19:23:33+00:00","tweet":"Corbyn’s Labour is neither progressive nor internationalist.: There is nothing progressive in a Labour Party that opposes Freedom of Movement, Steve Bullock writes. … #Opinion #Brexit #Brexiters Now in @PMPmagToday","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-03T18:38:50+00:00","tweet":"Ignoring the strange text sizing issue for Tim Ryan, I believe I now only have 4 potential & declared candidates left to score for this project: Stacey Abrams, Steve Bullock, Wayne Messam, and Marianne Williamson. May not be able to do the last 2.","name":"steve bullock","Sentiment":0.075},{"date":"2019-04-02T23:48:00+00:00","tweet":"Gov. Steve Bullock joined state leaders and business owners in Helena Tuesday to bring attention to the ongoing wage gap between men and women. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-02T12:13:01+00:00","tweet":"Ian Dunt, David Allen Green, Steve Bullock, Naomi Smith and everyone on the Remainiacs podcast, James O'Brien, Faisal Islam, Matthew Parris, Beth Rigby, Sophy Ridge, Robert Peston, Tom Bradby, Tony Connelly, Fintan O'Toole, Matt Frei, Jon Snow & Cathy Newman. Never the BBC.","name":"steve bullock","Sentiment":-0.2},{"date":"2019-04-01T20:00:01+00:00","tweet":"#Montana Gov. Steve Bullock said Monday he can support the Medicaid expansion bill that cleared the state House over the weekend, with the inclusion of work requirements.","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-01T04:34:10+00:00","tweet":"Thanks, I got Steve Bullock to read the slides before I'd written a single word to find out if they worked as a format.","name":"steve bullock","Sentiment":0.0642857143},{"date":"2019-03-30T18:27:02+00:00","tweet":"we're no steve bullock we follow back but nobody cares!!so say the opposite of what steve bullock says!!","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-22T07:54:13+00:00","tweet":"Actually how about this test to see if experts are really valid in the modern age: a guitar battle between Steve Bullock and Boris Johnson? Boris even gets to put the capo wherever he wants.","name":"steve bullock","Sentiment":0.15},{"date":"2019-03-21T14:36:33+00:00","tweet":"I was honored to represent the School Administrators of Montana as we recognized Montana Governor Steve Bullock for receiving CoSN’s national Award for Excellence in Public Service. @MTEDLeadership @GovernorBullock @CoSN","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-21T10:17:13+00:00","tweet":"@adamboultonSKY you need to inform your guest Steve Bullock that the Petition to revoke Art50 is crooked & corrupt like the rest of the remain campaign. …","name":"steve bullock","Sentiment":-0.25},{"date":"2019-03-20T17:18:07+00:00","tweet":"The budget spends $4.26B of general fund $, which is $44.8M less than proposed by Gov. Steve Bullock. ... Much of the debate focused on cutting the equivalent of more than 200 vacant full-time positions from agencies across state government. #MTPol #MTLeg …","name":"steve bullock","Sentiment":-0.0033333333},{"date":"2019-03-20T09:00:00+00:00","tweet":"Montana Gov. Steve Bullock says he wants statewide discussion on grizzly bear management, led by a new council he's establishing with the state now accepting applications. …","name":"steve bullock","Sentiment":0.1681818182},{"date":"2019-03-16T00:09:24+00:00","tweet":"Feel the same rn that I normally feel about the senate. Thank you Steve Bullock for nothing.","name":"steve bullock","Sentiment":0.075},{"date":"2019-03-14T00:46:52+00:00","tweet":"Why Democrats should hope Steve Bullock runs Get to know Governor Steve Bullock and you’ll understand why both Democrats & Republicans vote for him. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-12T13:03:32+00:00","tweet":"Definitely a NO: Bernie Sanders ● Tulsi Gabbard ● Andrew Yang ● Marianne Williamson ● Bill de Blasio ● Tim Ryan ● Seth Moulton ● Michael Bennet ● Steve Bullock ● John Delancy","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-12T12:15:38+00:00","tweet":"Iowa state senate candidate is showered with attention by 2020 Democratic candidates, including having a beer with still-undecided but totally staffing up Montana Gov. Steve Bullock …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T17:30:53+00:00","tweet":"Talented Colorado operative (and the daughter of a former presidential campaign manager) is going with Steve Bullock >> …","name":"steve bullock","Sentiment":0.35},{"date":"2019-03-06T03:32:28+00:00","tweet":"Steve Bullock, chair of Natl GOVs Association, on last week's meeting of governors at WH: \"President Trump came in. He spoke for about an hour—spoke about a whole lot of things like the basketball players in China & how he freed them. And then he left--without one question.\"(1\/2)","name":"steve bullock","Sentiment":0.1},{"date":"2019-03-05T20:17:51+00:00","tweet":"Join Montana Gov Steve Bullock in Cedar Rapids Iowa at Parlor City Pub #FTIN #NetworkofNow …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T16:33:12+00:00","tweet":"Among those yet to announce their decisions: Joe Biden Beto O’Rourke Sherrod Brown Michael Bennet Eric Swalwell Terry McAuliffe John Kerry Seth Moulton Tim Ryan Steve Bullock Bill De Blasio","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T16:17:13+00:00","tweet":"Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T16:12:42+00:00","tweet":"Steve Bullock doing a stop in Cedar Falls today with Eric Giddens, Democrats’ candidate in the SD 30 special election","name":"steve bullock","Sentiment":0.3571428571},{"date":"2019-03-05T14:00:08+00:00","tweet":"Inside Schumer’s plot to win the Senate The New York Democrat laid out his plans to become majority leader in an interview. Steve Bullock is interested in becoming president, not senator. But Chuck Schumer met with him anyway last month in New York...","name":"steve bullock","Sentiment":0.2954545455},{"date":"2019-03-05T13:56:21+00:00","tweet":"@staceyabrams We need you in the Senate! Same to Steve Bullock, @GovernorBullock.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T13:07:00+00:00","tweet":"well, Steve Bullock needs to work on his approval ratings. 50% isnt good enough.","name":"steve bullock","Sentiment":0.35},{"date":"2019-03-05T12:52:23+00:00","tweet":"Indeed. Plus MT Gov. Steve Bullock, also considering a run.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T12:09:32+00:00","tweet":"Jeff Merkley made the right choice in running for Senate instead of President. I just wish Beto O'Rourke and Steve Bullock would have done the same.","name":"steve bullock","Sentiment":0.1428571429},{"date":"2019-03-05T09:50:28+00:00","tweet":"Governors Steve Bullock and Larry Hogan discuss possible 2020 campaigns in Des Moines … via @DMRegister","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T09:40:23+00:00","tweet":"I still say Patty Murray for Senate Majority Leader, but I'm really glad Merkley made the right choice here. I hope Beto and Steve Bullock are listening. Helping to win the Senate is a much more useful path for them than a hopeless presidential run. Hickenlooper should have too.","name":"steve bullock","Sentiment":0.4771428571},{"date":"2019-03-05T09:31:46+00:00","tweet":"What luck, MT Gov. Steve Bullock and MD Gov. Larry Hogan, both considering WH’2020 bids, just happened to be in Iowa for a Nat Govs Association event - …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T09:27:40+00:00","tweet":"Paging John Hickenlooper and Steve Bullock... …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-05T00:32:37+00:00","tweet":"If I were in Steve Bullock's position, I would swallow my pride and run for the Senate.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-01T17:02:24+00:00","tweet":"Alongside @chrisgreybrexit and @IanDunt, @GuitarMoog alias Steve Bullock is the Brexit commentator I have most enjoyed and benefited from reading for his humour, his insight and his decency. I hope you will join me in wishing him well and hoping he can bring himself to return.","name":"steve bullock","Sentiment":0.5},{"date":"2019-02-28T10:37:17+00:00","tweet":"But here's the thing. Steve Bullock has left Twitter because of their behaviour & the fallout from it. One of the best anti-Brexit champions has had enough of the drama and quit Twitter. Slowest handclap ever, fringe zealots.","name":"steve bullock","Sentiment":0.3333333333},{"date":"2019-02-28T10:37:15+00:00","tweet":"A cracking discussion between Chris & Steve Bullock about the reasons for Steve quitting Twitter. A few thoughts follow, since Steve apparently came to believe I was waging a \"vendetta against Remain\". …","name":"steve bullock","Sentiment":-0.075},{"date":"2019-02-28T07:39:54+00:00","tweet":"From 1.05... re why @guitarMoog Steve Bullock shut down his twitter account. A great pity. But understandable points. Good discussion between Steve Bullock and Chris Kendall @ottocrat Call me out if any Blindingly Obvious tweets aren't good. Thanks. …","name":"steve bullock","Sentiment":0.3063492063},{"date":"2019-02-27T05:10:34+00:00","tweet":"Steve Bullock get yourself back on Twitter (when you're ready)! We need you on here more than ever.","name":"steve bullock","Sentiment":0.25},{"date":"2019-02-26T17:35:39+00:00","tweet":"People who met\/talked with Hillary to plan for their 2020 campaigns: Joe Biden Amy Klobuchar Kamala Harris Cory Booker Elizabeth Warren John Hickenlooper Julián Castro Terry McAuliffe *\"Gov. Steve Bullock of Montana is trying to schedule a meeting with her.\" interesting... …","name":"steve bullock","Sentiment":0.5},{"date":"2019-02-19T23:15:04+00:00","tweet":"Montana Gov. Steve Bullock doesn't have decades of name recognition like Donald Trump, the money, or the political clout of other Democrats in the field, but he was the only Democratic governor to get re-elected in a state that Trump won. - @NBCLeftField","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-02-15T18:26:35+00:00","tweet":"In which, Montana Governor Steve Bullock (D) dabs during his fourth and final State of the State address...","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T21:50:02+00:00","tweet":"Whoops, they used Kavanaugh's picture for Steve Bullock – or wait, is that Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T19:34:13+00:00","tweet":"And Steve Bullock in #MTSen …","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-13T16:19:03+00:00","tweet":"Opinion: Democrats should hope Steve Bullock runs, @JRubinBlogger writes. With the possible exception of Elizabeth Warren, no one in the mix for 2020 talks more about the influence of \"dark money.\"","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-02-13T05:40:02+00:00","tweet":"Montana Gov. Steve Bullock will travel to Iowa at the end of the week as he further explores a run for the Democratic presidential nomination","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-09T12:43:27+00:00","tweet":"Beto should run for senate in TX. Steve Bullock should run for senate in MT. Hickenlooper should run for senate in CO. Sherrod Brown needs to hold his seat in OH. We should pick one of the women already running as our presidential nominee.","name":"steve bullock","Sentiment":0.0},{"date":"2019-02-08T11:25:00+00:00","tweet":"In an increasingly crowded primary, the question for John Hickenlooper, Montana Gov. Steve Bullock and others is whether charged-up Democratic voters will opt for governing over grievances.","name":"steve bullock","Sentiment":0.4},{"date":"2019-02-08T07:06:27+00:00","tweet":"Governors: they get the job done! That’s the pitch, at least, from John Hickenlooper and Steve Bullock as they both test out White House bids. …","name":"steve bullock","Sentiment":-0.15},{"date":"2019-02-06T15:43:58+00:00","tweet":"No training again today due to frigid conditions @EmeraldDowns, and another winter storm is due to hit Friday. Meanwhile, 2018 Horse of the Meeting Sippin Fire is ready to begin his 4-year-old campaign with trainer Steve Bullock.","name":"steve bullock","Sentiment":-0.2375},{"date":"2019-02-06T15:01:13+00:00","tweet":"9. Sherrod Brown would be the conscience of the progressive wing and wins big in Ohio. A long shot for the top slot but already has to be on the shortlist for anyone’s VP pick. 10. Steve Bullock wins in Trump Country, is articulate and likeable. But he needs money and Name ID.","name":"steve bullock","Sentiment":0.21},{"date":"2019-02-03T00:00:12+00:00","tweet":"Gov. Steve Bullock — perhaps the one potential 2020 Democratic presidential candidate with a fan club of elected Republicans back home","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-03T16:40:45+00:00","tweet":"Montana is the first state in 2019 to authorize sports betting. Gov. Steve Bullock signed a bill Friday for the Montana State Lottery to oversee wagering on sports through kiosks and mobile devices. …","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-03T14:27:42+00:00","tweet":"So Mayor Bill De Blasio will be number 23. Also expected soon, number 24 Gov. Steve Bullock of Montana. Number 25 could be Stacey Abrams of GA. Any rumors of others? And to think some of you thought I was joking about a Baskin-Robbins 31.","name":"steve bullock","Sentiment":-0.1},{"date":"2019-05-02T19:58:46+00:00","tweet":"Steve Bullock on Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-02T09:03:55+00:00","tweet":"Seriously, who the hell is advising Steve Bullock to run for president instead of Senate in Montana? Who on earth is egging on Michael Bennet to give up his Senate seat in Colorado to run for president? Nobody wants you guys as president! Focus on the Senate, my people.","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-05-01T13:52:05+00:00","tweet":"JUST IN: Montana governor Steve Bullock to announce bid for presidency: report","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-01T09:37:39+00:00","tweet":"And Steve Bullock, who'd probably be the favorite in Montana's Senate race, is probably running a doomed presidential campaign instead! …","name":"steve bullock","Sentiment":0.625},{"date":"2019-04-30T20:26:49+00:00","tweet":"Montana Governor Steve Bullock is preparing to run for President soon so let's look at his reelection win in 2016. Bullock was reelected by 4% against businessman and future amateur wrestler Greg Gianforte. He won 25\/50 Senate districts.","name":"steve bullock","Sentiment":0.1833333333},{"date":"2019-04-30T14:53:45+00:00","tweet":"It's kind remarkable that other Democrats (Steve Bullock) can look at what's happened since Beto chose a WH bid over a less uphill Senate bid and think: \"That's it, that's what I want.\"","name":"steve bullock","Sentiment":0.2645833333},{"date":"2019-04-30T07:54:15+00:00","tweet":"Let’s recap the supposed top-tier recruits who were impervious to Schumer’s “power of persuasion” this cycle: Tom Vilsack in IA John Hickenlooper in CO Steve Bullock in MT Stacey Abrams in GA Beto O’Rourke in TX Josh Stein in NC Crisanta Duran in CO","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-29T11:52:18+00:00","tweet":"As Steve Bullock prepares to a launch a presidential campaign after MT's legislative session ends, he's hired @GaliaSlayen to be communications director. @JeremyCBusch running comms in Iowa, @JamesDakinOwens senior advisor.","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-26T00:34:15+00:00","tweet":"While more than 30 Democrats are expected to campaign against President Trump in 2020, Montana Gov. Steve Bullock is pondering whether he should enter the race as well. - @NBCLeftField","name":"steve bullock","Sentiment":0.2},{"date":"2019-04-25T13:14:27+00:00","tweet":"20 Dem POTUS candidates, and possibly 1-2 more coming (Sen. Michael Bennet of CO? Gov. Steve Bullock of MT?). A record in US history by 3-5. Many of them couldn't get a headline if they paid for it. Not fair but life isn't. #Joe2020","name":"steve bullock","Sentiment":0.1625},{"date":"2019-04-22T07:22:25+00:00","tweet":"This leaves five potential candidates (not including Biden who is announcing this week) Stacey Abrams, Michael Bennet, Steve Bullock, Bill De Blasio, and Joe Sanberg …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-18T07:29:35+00:00","tweet":"*Chuck Schumer glares at Steve Bullock* …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-11T16:36:01+00:00","tweet":"The Bulldogs visited the State Capitol today. A huge thank you to Governor Steve Bullock and all the senators for inviting us to come celebrate our National Championship year!! #GoDawgs","name":"steve bullock","Sentiment":0.625},{"date":"2019-04-11T06:10:00+00:00","tweet":"Steve Bullock, Tanja and a load of other people have corrected him on here on loads of stuff he's said and they did it for free and didn't need to be \"crowdfunded\"","name":"steve bullock","Sentiment":0.1375},{"date":"2019-04-10T06:33:00+00:00","tweet":"Montana Gov. Steve Bullock is fighting dark money in politics — and it’s working","name":"steve bullock","Sentiment":-0.15},{"date":"2019-04-08T10:09:55+00:00","tweet":"Montana Governor Steve Bullock has signed Knife Rights' Montana Switchblade Ban Repeal and Knife Law Preemption bill __","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-05T18:18:09+00:00","tweet":"Random Fact Three of our top Remain tweeters are called Steve .... Steve Analyst @EmporersNewC Steve Bray @snb19692 Steve Bullock @GuitarMoog Bless all three of them 🇪🇺️","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-04T07:41:32+00:00","tweet":"This will make it 23 candidates now. Montana governor Steve Bullock to announce bid for presidency: report …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-03T17:05:51+00:00","tweet":"25 declared candidates.Sabato fail … @LarrySabato So De Blasio will be number 23. expected soon, number 24 Gov. Steve Bullock of Montana. 25 could be Stacey Abrams Any rumors of others? And to think some of you thought I was joking about a Baskin-Robbins 31","name":"steve bullock","Sentiment":-0.3},{"date":"2019-05-02T19:21:35+00:00","tweet":"This is the second incident (after @paulimeth's run-in with Steve Bullock) of authoritarian, thuggish treatment of the press by a Democratic candidate. This is a problem for anyone running as a Democrat. It tells us you're a phony PR candidate with anal-retentive staff. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-02T11:44:08+00:00","tweet":"what a freudian slip: i was doing research on montana governor steve bullock but typed in 'seth bullock' i love you forever, timothy olyphant","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-02T10:16:08+00:00","tweet":"Re-upping this from @HotlineJosh given the news that Steve Bullock is also going to announce for president rather than challenge Steve Daines for his Senate seat. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-02T08:32:31+00:00","tweet":"With Bennet in, Democrats are now only waiting on three additional candidates who are thinking about getting in the race: New York Mayor Bill de Blasio, Montana Gov. Steve Bullock and former Minority Leader of the Georgia House of Representatives Stacey Abrams.","name":"steve bullock","Sentiment":0.0454545455},{"date":"2019-05-01T16:53:54+00:00","tweet":"Montana Governor Steve Bullock just announced that he’s entering the 2020 race. Running for the Democratic nomination is this Summer’s Ice Bucket Challenge.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-01T14:40:12+00:00","tweet":"Montana Governor Steve Bullock is planning to run for President. He won re-election by 4% the same day Trump easily won the state in a landslide. I'd much prefer Bullock make a run for #MTSEN - hopefully he will.","name":"steve bullock","Sentiment":0.2111111111},{"date":"2019-04-30T11:06:06+00:00","tweet":"Allow me to update: Tom Vilsack in IA John Hickenlooper in CO Steve Bullock in MT Stacey Abrams in GA Beto O’Rourke in TX Josh Stein in NC Crisanta Duran in CO *Cindy Axne in IA* …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-30T08:25:43+00:00","tweet":"You do realize the same people saying this about Abrams said the same about Steve Bullock and Beto O'Rourke, right? …","name":"steve bullock","Sentiment":0.0952380952},{"date":"2019-04-30T08:15:01+00:00","tweet":"This isn't like Montana, where Steve Bullock is pretty much the only serious person who could go for Senate and his absence is a real blow. Georgia is a rapidly diversifying state where Democrats have been making inroads and building the bench generally. We have options there.","name":"steve bullock","Sentiment":0.0505952381},{"date":"2019-04-29T23:22:50+00:00","tweet":"This isn't good but doesn't crush us as hard as Steve Bullock does. …","name":"steve bullock","Sentiment":0.2041666667},{"date":"2019-04-19T19:09:02+00:00","tweet":"Is Steve Bullock even gonna run for President? Either way he’s such a disappointment.","name":"steve bullock","Sentiment":-0.3},{"date":"2019-04-18T19:13:28+00:00","tweet":"MONTANA: Montana lawmakers became the first to the finish line today when the Senate approved two sports betting bills, now headed to Gov. Steve Bullock's desk. He's expected to sign at least one, meaning the Big Sky State will be the first to legalize sports betting in 2019.","name":"steve bullock","Sentiment":0.02},{"date":"2019-04-16T10:08:28+00:00","tweet":"I see Mike Gravel is beating Harris, Buttigieg, and Booker. I had to look up Steve Bullock.","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-14T10:50:51+00:00","tweet":"Nobody should be given a carte blanche. You follow me. You probably also follow Steve Bullock, Steve Analyst, and Steve Peers? Seems likely. We, and many, many more experts, were all blocked by Mr Hunter. All I’d like to do is ask you to consider what that says.","name":"steve bullock","Sentiment":0.375},{"date":"2019-04-12T13:13:04+00:00","tweet":"Former Providence Mayor Joe Paolino (RI's Democratic National Committeeman) tells me he likes 3 potential candidates for president: @PeteButtigieg, Montana Gov. Steve Bullock and Terry McAuliffe. (The latter two haven't announced yet.) He said it's still early. Also likes Biden.","name":"steve bullock","Sentiment":0.025},{"date":"2019-04-07T04:20:09+00:00","tweet":".@MorningConsult It's strange that @AndrewYang is not showing up (even as a 0) on your Political Intelligence poll but you are reporting on Inslee, McAuliffe, and Steve Bullock. FWIW, Harvard-Harris, Fox News, Monmouth, and Emerson are picking Yang up at 1-2%. #YangGang","name":"steve bullock","Sentiment":-0.025},{"date":"2019-04-06T22:17:33+00:00","tweet":"Steve Bullock needs to STOP with his hopes of being president. I think he’s great but he doesn’t have a chance and should fulfill his destiny of becoming a Senator and hating his job like Joe Manchin","name":"steve bullock","Sentiment":0.625},{"date":"2019-04-06T19:58:34+00:00","tweet":"Don't underestimate the Democrats in 2020 if they come to their senses and put up a candidate on the center-Left. Ryan, Hickenlooper, Biden, Gabbard, even Klobuchar, further Left, but not to be dismissed (Montana Gov. Steve Bullock and Sen. Bennett of Colorado, if they get in.)","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-06T15:28:47+00:00","tweet":"My updated list of favorite candidates: RUNNING 1. Elizabeth Warren 2. Beto O'Rourke 3. Kirsten Gillibrand 4. Bernie Sanders 5. Tulsi Gabbard 6. Pete Buttigieg 7. Jay Inslee 8. Tim Ryan UNDECLARED 1. Eric Swalwell 2. Steve Bullock","name":"steve bullock","Sentiment":0.5},{"date":"2019-04-05T15:11:21+00:00","tweet":"Everyone has their breaking points. I recall even Steve Bullock thinking of packing it all in a few weeks ago. Keep going. Hopefully we get a good solution, if not, there is work to get us back in again.","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-04-05T14:02:49+00:00","tweet":"I think Steve Bullock would make a great president because of the time he spends here in Montana. He's been to Helena, so you know he understand politics. He's been to Missoula, so you know he understands art. He's been to Butte, so you know he knows how to take a punch.","name":"steve bullock","Sentiment":0.8},{"date":"2019-04-05T10:49:25+00:00","tweet":"So. Many. Candidates. Reps. Swalwell and Tim Ryan just entered. Bloomberg is reconsidering a run. Steve Bullock is expected to enter. 20 people on stage, yikes.","name":"steve bullock","Sentiment":0.2},{"date":"2019-04-05T10:32:52+00:00","tweet":"DT Sadiq Khan: RT Dek Workspace: Ribbon cutting! Mayor of London Sadiq Khan &amp; Mayor of Lewisham Steve Bullock launch our new coworking space!…","name":"steve bullock","Sentiment":-0.3068181818},{"date":"2019-04-05T06:57:35+00:00","tweet":"“There is nothing #progressive in a @UKLabour that opposes #FreedomOfMovement,” Steve Bullock @GuitarMoog writes. #Brexit #JeremyCorbyn #Labour #EUcitizens #Thread … via @PMPmagToday","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-05T06:45:15+00:00","tweet":"One year and were not there - I’ve negotiated with the EU – and I know we can still stop Brexit | Steve Bullock …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-05T04:21:37+00:00","tweet":"@EuropeWeaver This is good and comes recommended by Steve Bullock …","name":"steve bullock","Sentiment":0.7},{"date":"2019-04-03T19:21:57+00:00","tweet":"“There is nothing #progressive in a @UKLabour that opposes #FreedomOfMovement,” Steve Bullock @GuitarMoog writes. #Brexit #JeremyCorbyn #Labour #EUcitizens #Thread … via @PMPmagToday","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-03T17:01:38+00:00","tweet":"Here I hand over to the brilliant Steve Bullock... …","name":"steve bullock","Sentiment":0.9},{"date":"2019-04-02T09:28:06+00:00","tweet":"Reminder: The following (and possibly more) are still talking\/acting like 50%+ chance of running #2020: Stacey Abrams Michael Bennett Joe Biden Steve Bullock Bill de Blasio Terry McAuliffe Seth Moulton Tim Ryan Eric Swalwell","name":"steve bullock","Sentiment":0.25},{"date":"2019-03-28T08:30:52+00:00","tweet":"Action Alert: Do you live in Montana? Call Governor Steve Bullock and ask him to convene a taskforce to address the growing epidemic of Murdered and Missing Indigenous Women. P. 406-444-3111 …","name":"steve bullock","Sentiment":0.0121212121},{"date":"2019-03-26T12:39:26+00:00","tweet":"North Carolina. Plus somehow get Steve bullock to run for senate in Montana. Somehow.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-25T13:26:26+00:00","tweet":"Candidates for whom I will not vote: Michael Bennet Joe Biden Cory Booker Steve Bullock Pete Buttigeig Kirsten Gillibrand Kamala Harris John Hickenlooper Jay Inslee Amy Klobuchar Beto O'Rourke Eric Swalwell Elizabeth Warren Andrew Yang I will vote for Bernie Sanders, though.","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-21T14:36:33+00:00","tweet":"I was honored to represent the School Administrators of Montana as we recognized Montana Governor Steve Bullock for receiving CoSN’s national Award for Excellence in Public Service. @MTEDLeadership @GovernorBullock @CoSN","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-21T10:30:46+00:00","tweet":"Steve Bullock - That's a false choice as the UK can #RevokeArticle50.. Theresa May thinks she's threatening the #EU with #NoDeal, but she's actually threatening her own population with #NoDeal. #PeoplesVote #FinalSay @GuitarMoog","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-03-14T22:41:23+00:00","tweet":"Beto O'Rourke, Steve Bullock, and Stacey Abrams should all be running for the U.S. Senate rather than the White House. This narrow focus on the Presidency is unhealthy and is hurting Democratic chances of winning back the Senate.","name":"steve bullock","Sentiment":-0.02},{"date":"2019-03-14T13:51:56+00:00","tweet":"MONTANA: Term-limited Gov Steve Bullock (D) - the current NGA Chair and a potential presidential candidate - this week said regardless of what he decides on a presidential run, he has \"ruled out\" running against US Sen Steve Daines (R) because he \"wouldn't enjoy\" the job.","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-03-14T10:12:11+00:00","tweet":"Steve Bullock thus far appears impervious to Chuck Schumer's vaunted power of persuasion...","name":"steve bullock","Sentiment":0.1},{"date":"2019-03-14T00:46:52+00:00","tweet":"Why Democrats should hope Steve Bullock runs Get to know Governor Steve Bullock and you’ll understand why both Democrats & Republicans vote for him. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-13T15:48:13+00:00","tweet":"Montana Governor Steve Bullock speaks at opening ceremony for Cognizant's ATG Missoula Solution Center. #digital @GovernorBullock","name":"steve bullock","Sentiment":-0.05},{"date":"2019-03-11T13:03:22+00:00","tweet":"This is huge news. The @MTDEQ (which is under Democratic Gov. Steve Bullock) concludes the Black Butte Copper Project will have \"no impact to water quality, air quality or aquatic life.\" … #mtpol #mtnews #mtleg","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-03-11T12:00:41+00:00","tweet":"Here are some new markets launching this week, based on trader recs: @AndrewYangVFA added to the 2020 DNOM market. *Who will win the 2020 NH Democratic primary? *Will they run in 2020? Eric Swalwell, Stacey Abrams, Steve Bullock *Will Trump commute the sentence(s) of Manafort?","name":"steve bullock","Sentiment":0.4454545455},{"date":"2019-03-10T12:42:45+00:00","tweet":"If you’re curious about #PurdonNation favorite ⁦@GovernorBullock⁩, read this piece on what a Dem leader can accomplish in a red state. #Bullock2020 Is Steve Bullock the presidential candidate Democrats want? …","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-03-08T09:48:36+00:00","tweet":"Steve Bullock: DRAFT STEVE BULLOCK for U.S. Senate in 2020 - Sign the Petition! via @Change","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T17:45:04+00:00","tweet":"Montana Gov. Steve Bullock has hired veteran Democratic operative Jenn Ridder to work for his PAC, in the latest sign that the Western Democrat is nearing a presidential run","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-03-07T17:30:53+00:00","tweet":"Talented Colorado operative (and the daughter of a former presidential campaign manager) is going with Steve Bullock >> …","name":"steve bullock","Sentiment":0.35},{"date":"2019-03-07T17:26:04+00:00","tweet":"SCOOP - Montana Gov. Steve Bullock hired Jenn Ridder (fmr Polis CM) as senior adviser for his PAC. With @DanielStrauss4: …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T15:18:06+00:00","tweet":"With Sherrod Brown and Jeff Merkley out, here is my updated favorite candidates list: RUNNING 1. Bernie Sanders 2. Elizabeth Warren 3. Kirsten Gillibrand 4. Tulsi Gabbard 5. Jay Inslee UNDECLARED 1. Beto O'Rourke 2. Eric Swalwell 3. Steve Bullock 4. John Kerry 5. Joe Biden","name":"steve bullock","Sentiment":0.5},{"date":"2019-03-07T13:44:13+00:00","tweet":"Governors Steve Bullock and Larry Hogan discuss possible 2020 campaigns in Des Moines … via @DMRegister","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T13:05:29+00:00","tweet":"Sherrod Brown not running for President Current holdouts: Joe Biden Beto O’Rourke Terry McAuliffe Steve Bullock Eric Swalwell Seth Moulton Tim Ryan","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T13:02:34+00:00","tweet":"Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-07T12:51:09+00:00","tweet":"Who tries to take over that sweet spot now? My guess? Montana Gov. Steve Bullock. He’s more of a mainstream Democrat when compared to Brown’s populist progressivism, but he can make a similar sell: Liberal enough for the liberals, electable enough for the moderates.","name":"steve bullock","Sentiment":0.125},{"date":"2019-03-07T12:42:11+00:00","tweet":"I hope Stacey Abrams does the right thing and runs for the Senate. I have accepted that Steve Bullock is sadly not doing the right thing and will run for President rather than the Senate.","name":"steve bullock","Sentiment":0.2738095238},{"date":"2019-03-07T11:05:41+00:00","tweet":"Presidential hopefuls who are consistently stuck at 1% or below in the polling: Kirsten Gillibrand, Sherrod Brown, Mayor Pete, Julian Castro, Tulsi Gabbard, Frackenlooper, Terry McAuliffe, Jay Inslee, John Delaney, Steve Bullock...","name":"steve bullock","Sentiment":0.25},{"date":"2019-03-06T13:00:13+00:00","tweet":"Larry Hogan and Steve Bullock sounded like two men doing their level best to walk the line between sounding like a governor and a presidential candidate. That’s a fine line for an out-of-state governor in Iowa the year before a presidential election.","name":"steve bullock","Sentiment":0.7083333333},{"date":"2019-03-06T11:42:34+00:00","tweet":"I have 2 White Men I'd gladly vote for: 1) Sherrod Brown and 2) Steve Bullock Both would be able to run for 2 terms and both would be able to navigate the current situation w\/o offending entire sections of the party. …","name":"steve bullock","Sentiment":0.25},{"date":"2019-03-06T10:49:46+00:00","tweet":"The next match is between Steve Bullock and John Delaney! …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-06T09:40:50+00:00","tweet":"Dear America, When the time comes for your presidential vote, THIS is how most Montanans feel about Governor Steve Bullock. Especially in regards to his betrayal of gun owners. …","name":"steve bullock","Sentiment":0.25},{"date":"2019-03-06T08:56:07+00:00","tweet":"How long until these guys announce: Joe Biden Beto O'Rourke Governor Steve Bullock Senator Sherrod Brown Eric Swalwell Seth Moulton Terry McAuliffe","name":"steve bullock","Sentiment":-0.05},{"date":"2019-03-06T07:44:44+00:00","tweet":"Yet it was Labours mayor for Lewisham Steve Bullock that shut down almost every single community center in the entire bourough.","name":"steve bullock","Sentiment":-0.0817460317},{"date":"2019-03-06T07:02:20+00:00","tweet":"Steve Bullock’s betrayal of gun owning Montana supporters and the 2nd Amendment [Video] | Meanwhile, In Montana …","name":"steve bullock","Sentiment":0.0},{"date":"2019-03-06T03:54:18+00:00","tweet":"Montana Gov. Steve Bullock on the question of whether Vice President Pence is 'a decent guy':","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-03-06T03:52:38+00:00","tweet":"Steve Bullock on Medicare for All: \"I’m not sure that the best way—if you actually want to get it obtained—would be to immediately disrupt 155 million people on employer-sponsored healthcare...if I take this a step further, you know, we’d be rolling out all kinds of things.”","name":"steve bullock","Sentiment":0.1875},{"date":"2019-03-06T03:32:28+00:00","tweet":"Steve Bullock, chair of Natl GOVs Association, on last week's meeting of governors at WH: \"President Trump came in. He spoke for about an hour—spoke about a whole lot of things like the basketball players in China & how he freed them. And then he left--without one question.\"(1\/2)","name":"steve bullock","Sentiment":0.1},{"date":"2019-06-05T12:48:22+00:00","tweet":"Steve Bullock and the legislature saved my life by expanding medicaid. No I wasn't asked to pitch for him, it's the truth. Suffering from an inoperable brain tumor and couldn't work or study. I am now slowly on the mend. Grateful for Steve Bullock in what he and his admin did. …","name":"steve bullock","Sentiment":-0.3},{"date":"2019-06-05T12:38:00+00:00","tweet":"Today a federal judge will hear arguments on the merit of a lawsuit by Montana Gov (& 2020 hopeful) Steve Bullock and the New Jersey Attorney General that aims to force the Trump admin to resume collecting info on donors to #DarkMoney political nonprofits …","name":"steve bullock","Sentiment":0.0621212121},{"date":"2019-06-04T09:12:02+00:00","tweet":"I mean, I write about politics for a living, and I don't even have an opinion about Steve Bullock.","name":"steve bullock","Sentiment":-0.3125},{"date":"2019-06-04T09:10:17+00:00","tweet":"Good example of why primary polls should be treated with the utmost care: The idea that 21 percent of Americans have an opinion about Steve Bullock is preposterous. …","name":"steve bullock","Sentiment":0.55},{"date":"2019-06-03T18:58:23+00:00","tweet":".@SenGillibrand News Flash: You’re losing to some random guy off the street named Steve Bullock.","name":"steve bullock","Sentiment":-0.5},{"date":"2019-05-27T17:25:24+00:00","tweet":"Why do you think these candidates are in the primary race? John Hickenlooper Michael Bennet Eric Swalwell Tim Ryan Seth Moulton Bill De Blasio Steve Bullock John Delaney","name":"steve bullock","Sentiment":0.4},{"date":"2019-05-26T22:33:05+00:00","tweet":"Gov. Steve Bullock: We can't let 'America First' become 'America Alone.'","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-26T11:23:00+00:00","tweet":"Montana Gov. (and presidential candidate) Steve Bullock said, \"You look at today, only half the 30-year-olds are doing better than their parents were at age 30. When I was being raised, it was 90%.\" That's pretty much accurate.","name":"steve bullock","Sentiment":0.1966666667},{"date":"2019-05-20T15:54:20+00:00","tweet":"Harry Reid to @jmartNYT: \"It’s a shame that someone like Steve Bullock would not run for the Senate. It’s a shame that Beto O’Rourke — he came to see me at my home. I just lament he’s not running for the Senate.\" …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-20T14:30:31+00:00","tweet":"Steve Bullock's unique homepage question: \"Who the heck is Steve Bullock?\"","name":"steve bullock","Sentiment":0.375},{"date":"2019-05-19T18:42:43+00:00","tweet":"Democrat Steve Bullock supports unlimited abortion, even until the moment a baby is born! And he just vetoed a bill to stop infanticide. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-19T10:10:35+00:00","tweet":"CNN's Jake Tapper: When do you think life begins? Gov. Steve Bullock: It’s not up to people like me to be making these decisions. I think that’s the greater point. It’s ‘what does an individual woman need to do with her body and with her health care?’ #CNNSOTU","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-19T10:01:59+00:00","tweet":"2020 candidate Gov. Steve Bullock on the economy: “The economy is booming for a whole lot of folks, but for a whole lot of folks they’re not getting a lot better because of the Trump tax cuts and what President Trump has done.” #CNNSOTU","name":"steve bullock","Sentiment":0.3},{"date":"2019-05-18T15:38:33+00:00","tweet":"\"Come to Montana, our glaciers will be gone soon\" -Dem candidate Steve Bullock on endorsing the new green deal #MAGA @realDonaldTrump @DonaldJTrumpJr","name":"steve bullock","Sentiment":-0.0318181818},{"date":"2019-05-18T14:01:10+00:00","tweet":"Asked Steve Bullock about abortion; he said he hoped court would uphold Roe, but if it didn't, wanted federal law matching its protections, and favored end of Hyde Amendment.","name":"steve bullock","Sentiment":0.8},{"date":"2019-05-18T10:29:30+00:00","tweet":"A special guest at Steve Bullock’s event in Maquoketa, IA: Andy McKean, a longtime GOP state legislator who just became a Democrat. Says the hateful letters he’s gotten since then convinced him he was right to do it.","name":"steve bullock","Sentiment":0.3214285714},{"date":"2019-05-18T00:51:00+00:00","tweet":"Gov. Steve Bullock campaigns in Iowa with state AG Tom Miller: \"We gather to make sure that Donald Trump is a one-term president.\" Miller has endorsed Bullock:","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-17T23:45:00+00:00","tweet":"Gov. Steve Bullock campaigns in Iowa: \"We're here to make sure that Donald Trump does not get re-elected.\"","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-16T23:09:07+00:00","tweet":"Get yourself an Iowa official that looks at you the way Tom Miller looks at Steve Bullock. (He endorsed Bullock and picked him up from the airport today ) #iacaucus","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-16T21:14:34+00:00","tweet":"massive boos for more men running for president and bill de blasio. applause for steve bullock (?????)","name":"steve bullock","Sentiment":0.25},{"date":"2019-06-05T19:06:34+00:00","tweet":"Democratic candidate Steve Bullock wants assault weapons banned and background checks for buying guns.","name":"steve bullock","Sentiment":0.2},{"date":"2019-06-05T07:32:52+00:00","tweet":"There are a lot of people fighting to defend our democracy, but Deepak and Matt are right at the top. Great work here, as they represent Steve Bullock fighting the scourge of dark money. A huge case …","name":"steve bullock","Sentiment":0.3671428571},{"date":"2019-06-04T02:06:06+00:00","tweet":"Montana Gov. Steve Bullock, a Democratic presidential candidate, says he has a record of working across the aisle to get meaningful things done","name":"steve bullock","Sentiment":0.5},{"date":"2019-06-03T21:09:22+00:00","tweet":"But Beto's wasting his time running for president instead of trying to unseat Cornyn; and Hickenlooper's wasting his time running for president instead of trying to unseat Gardner; and Steve Bullock's wasting his time running for president instead of trying to unseat Daines; and …","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-01T07:13:10+00:00","tweet":"Steve Peers is a professor of European law. Steve Bullock is a former UKREP & Commission development expert. DAG requires no intro. I am an EU official & have negotiated several EU trade agreements inc w Japan, Canada, Ukraine. What has Jason *actually* done in the real world?","name":"steve bullock","Sentiment":0.04},{"date":"2019-05-31T23:59:00+00:00","tweet":"Montana Gov. Steve Bullock: I can win back the states #DonaldTrump took … via @usatoday | @GovernorBullock joins @amjoyshow this weekend #reiders. Join @JoyAnnReid for their interview, 10 AM ET #SundayMorning on @MSNBC","name":"steve bullock","Sentiment":0.4},{"date":"2019-05-31T17:15:00+00:00","tweet":"Democratic presidential candidate Montana Gov. Steve Bullock says he can win over Trump voters in 2020","name":"steve bullock","Sentiment":0.8},{"date":"2019-05-29T09:38:30+00:00","tweet":"GOP swatting at Gov. Steve Bullock(D-MT) just in case he falls back to run for Senate. Dems not too upset since they want Bullock to give up his long-shot White House bid and run for Senate. Who says bipartisanship is dead? …","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2019-05-28T14:27:51+00:00","tweet":"Steve Bullock on the upside down logic of #Brexit. Less is more... @GuitarMoog #NineteenEightyFour … via @PMPmagToday","name":"steve bullock","Sentiment":0.0592592593},{"date":"2019-05-27T10:57:05+00:00","tweet":"The governor of the U.S. state of Montana, Steve Bullock, signed House Bill 584 into law earlier this month, recognizing utility #tokens and exempting them from being considered as #securities under local rules, with caveats: …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-23T10:50:00+00:00","tweet":"Andrew Yang and Steve Bullock are making their first appearances on the power rankings list. CNN’s Chris Cillizza breaks down how the underdogs are shaking things up","name":"steve bullock","Sentiment":0.0472222222},{"date":"2019-05-21T19:45:02+00:00","tweet":"Is Steve Bullock growing on anybody?","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-21T16:54:50+00:00","tweet":"\"You look at today, only half the 30-year-olds are doing better than their parents were at age 30. When I was being raised, it was 90%.\" Montana Gov. Steve Bullock — a late Dem entry into the race for the 2020 presidential nomination — is basically right: …","name":"steve bullock","Sentiment":0.0638095238},{"date":"2019-05-20T10:02:20+00:00","tweet":"Harry Reid to @jmartNYT: \"I mean, it’s a shame that someone like Steve Bullock would not run for the Senate. It’s a shame that Beto O’Rourke — he came to see me at my home. I just lament he’s not running for the Senate.\"","name":"steve bullock","Sentiment":-0.3125},{"date":"2019-05-20T09:29:18+00:00","tweet":"'Moderate' Steve Bullock Is an Extremist, and a Coward Too | RealClearPolitics …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-20T08:49:52+00:00","tweet":"What’s worse? A RINO or a RAM (Radicals Acting Moderate)? Gov. Steve Bullock of Montana is the latter, but he’s really just another extremist running for president. …","name":"steve bullock","Sentiment":-0.04},{"date":"2019-05-19T11:07:13+00:00","tweet":"Steve Bullock can't list a SINGLE accomplishment from ALL his time as Governor of Montana!! #ampFW","name":"steve bullock","Sentiment":-0.1116071429},{"date":"2019-05-19T08:14:17+00:00","tweet":"Today Meet the Press: Bernie Sanders, NBC, 9 a.m. State of the Union: Mitt Romney, R-Utah; Gov. Steve Bullock, D-Mont.; Rep. Pramila Jayapal, D-Wash. CNN, 9 a.m. & noon. Fox News Sunday: Sen. Amy Klobuchar, D-Minn.; Sen. Pat Toomey, R-Pa. 10 a.m.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-16T07:27:17+00:00","tweet":"Steve Bullock > Joe Biden. Steve Bullock > Beto. Steve Bullock >> Bernie Steve Bullock >> Mayor Pete Steve Bullock >>>>>> Bill de Blasio.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T22:03:10+00:00","tweet":"\"I've been asked to lower the flags by both Presidents Trump and Obama 53 times in total. Over a quarter of those were for mass shootings.\" -Montana Governor Steve Bullock, 2020 presidential candidate","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T21:53:30+00:00","tweet":"Montana Governor Steve Bullock: \"Come to Glacier Park soon because the glaciers will be gone.\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T21:43:16+00:00","tweet":"Steve Bullock is another Dem govnr who actually gets sh*t done. Pro-choice, supports same sex marriage, believes climate change is real and that humans contribute to it, is pro-campaign finance reform, believes in protecting DACA recipients, and supports organized labor. #maddow","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-05-15T20:00:05+00:00","tweet":"Montana Gov. Steve Bullock raised $1 million from voters in all 50 states in the 24 hours after he launched his 2020 presidential bid, his campaign announced","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T09:53:02+00:00","tweet":"Montana Gov. Steve Bullock said President Trump is not a good role model, adding that \"we're expecting more from preschoolers\" than Trump, while on \"CBS This Morning\"","name":"steve bullock","Sentiment":0.075},{"date":"2019-05-14T23:25:14+00:00","tweet":"We NEED These Ppl to run as Senators Steve Bullock in Montana against Steve Daines John Hickenlooper in Colorado against Cory Gardner Beto O’Rourke in Texas against John Coryn Amy McGrath against The Turtle in Kentucky Stacey Abrams in Geogia against David Perdue","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T22:30:23+00:00","tweet":"Programming Note! Montana Governor Steve Bullock, newly declared Democratic candidate for president will join Rachel Maddow live, in-studio Wednesday, 5\/15 at 9pm ET.","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-05-14T21:30:07+00:00","tweet":"Top Democrats really want Montana Gov. Steve Bullock to run for the Senate, not the presidency.","name":"steve bullock","Sentiment":0.35},{"date":"2019-05-14T21:21:01+00:00","tweet":"Montana Gov Steve Bullock announced today he's running for president. Just 5 days ago he vetoed a bill to stop infanticide! If Bullock can't tell the difference between serving Americans and killing Americans he has no business being president.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T20:48:06+00:00","tweet":"Montana Gov. Steve Bullock is the 22nd Dem to announce a run for president. He’s a clone of the first 21. All want to take freedom away from individuals and give it to government. Remember at the end of every law, regulation, and tax there is the barrel of a gun of a govt agent","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-14T20:34:42+00:00","tweet":"The 22nd candidate to run for the Dumbocrap party is Steve Bullock, governor of Montana. WOOOOOOOOOHHHHHH!! Shaking in my Tony Lamas and Justin’s.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T20:29:32+00:00","tweet":"When I interview a person, one question I have always asked is “what is your greatest achievement?” Democrat Montana Governor Steve Bullock just failed my interview. And he’s running for President... SMH Video courtesy of @RealSaavedra","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-14T19:12:52+00:00","tweet":"Steve Bullock making the rounds at a microbrewery. OH: “We don’t see the media like this in Montana.” “Well, not since the Unabomber.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T16:46:39+00:00","tweet":"Democrat Montana Governor Steve Bullock struggles to name a single achievement he is proud of as governor during his 2020 presidential campaign launch","name":"steve bullock","Sentiment":0.3642857143},{"date":"2019-05-14T16:33:47+00:00","tweet":"This is the most painful video you’ll watch all day. Democrat Gov. Steve Bullock struggled to name an achievement he was proud of as governor during his 2020 presidential campaign announcement.","name":"steve bullock","Sentiment":0.2},{"date":"2019-05-14T15:01:14+00:00","tweet":"Schumer doesn't express concerns about seeing Steve Bullock run for president rather than the Montana Senate seat. He says he \"only talked to Steve Bullock once six months ago\" when the Montana governor told him he was running for president.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T14:48:55+00:00","tweet":"Why Run For Senate And Win When You Can Run For President And Lose? By Steve Bullock, Beto O'Rourke, Julian Castro, and Cory Booker Foreword by Stacey Abrams","name":"steve bullock","Sentiment":0.8},{"date":"2019-05-14T14:48:43+00:00","tweet":"Steve Bullock is the Governor of Montana. He has a real chance of winning in a Senate race which would help Democrats regain seats in the Senate. Instead, he’s joining over 20 other people in race to be the Democratic nominee for President. It’s as if no one learned from 2016.","name":"steve bullock","Sentiment":0.1916666667},{"date":"2019-05-14T14:21:15+00:00","tweet":"Democratic Senators are quoted on the record in this story begging Steve Bullock to run for Senate instead. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T13:12:21+00:00","tweet":"Montana Gov. Steve Bullock says he is seeking the 2020 Democratic presidential nomination. #JokeoftheDay …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T12:37:41+00:00","tweet":"stats of Montana Democrat Governor Steve Bullock Who is Running for president 1. 66% approval rating in the Red state of Montana 2. passed major progressive bills In the State 3. expanded medicaid in Montana Trump Won Montana by 20%","name":"steve bullock","Sentiment":0.03125},{"date":"2019-05-14T11:54:03+00:00","tweet":"With the addition of Montana Gov. Steve Bullock, 24 candidates are running for president. Here's an interactive guide on them all: …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T11:46:42+00:00","tweet":"Montana Gov. Steve Bullock (D) announces 2020 candidacy for POTUS, joining a crowded DNC field vying to topple Trump. So let me guess, he hates Trump & thinks the gov. should control your healthcare, education, energy, travel, commerce, etc. Not a winning plan.","name":"steve bullock","Sentiment":-0.25},{"date":"2019-05-14T11:21:12+00:00","tweet":"I understand Steve Bullock is making a sacrifice by running but if we had 99 more Bullocks he could be making a hecatomb","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-14T11:15:40+00:00","tweet":"Montana Gov Steve Bullock announced today he's running for president. Just 5 days ago he vetoed a bill to stop infanticide! If Bullock can't tell the difference between serving Americans and killing Americans he has no business being president.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T11:13:11+00:00","tweet":"I really hope we don't have to wait to long before the Democratic Party begins treating this election like an existential war instead of a new season of America's Got Talent. \"Montana Governor Steve Bullock enters 2020 presidential race\" …","name":"steve bullock","Sentiment":0.0954545455},{"date":"2019-05-14T10:32:25+00:00","tweet":"I suspect Steve Bullock might not win the presidency, given that that I just wrote an entire piece referring to him as Seth Bullock","name":"steve bullock","Sentiment":-0.2},{"date":"2019-05-14T10:18:40+00:00","tweet":"Every week in the 2020 race... Elizabeth Warren: “What this primary needs is more policy!” Some virtually unknown dude like Steve Bullock: “What this primary needs is me!”","name":"steve bullock","Sentiment":0.35625},{"date":"2019-05-14T10:08:24+00:00","tweet":"Steve Bullock entering the race is a good thing. He will only take votes away from Biden. This helps Bernie. …","name":"steve bullock","Sentiment":0.35},{"date":"2019-05-14T10:03:53+00:00","tweet":"\"Never mind the (Steve) Bullock(s)\" meaning \"stop talking rubbish\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T09:50:14+00:00","tweet":"“Steve Bullock” ?? That isn’t even a real person. Made up people are running for President now.","name":"steve bullock","Sentiment":0.2},{"date":"2019-05-14T09:29:40+00:00","tweet":"Hell, why not? The more the merrier 🤣 Montana Gov. Steve Bullock joins crowded 2020 Democratic presidential race …","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-14T09:23:31+00:00","tweet":"Montana Gov. Steve Bullock announces presidential campaign …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T08:56:22+00:00","tweet":"I love Montana. Western Montana in particular is maybe the most geographically gorgeous part of the USA. While the number of candidates running is insane, Steve Bullock has every right to run for president, especially considering the dearth of \"red state\" Democrats in the race","name":"steve bullock","Sentiment":0.128042328},{"date":"2019-05-14T08:34:10+00:00","tweet":"Steve Bullock is the third governor from sagebrush country to enter the race after John Hickenlooper and Jay Inslee. Folks, it’s time to demand a sage-grouse debate.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T08:33:30+00:00","tweet":"Live footage of Steve Bullock tryna squeeze into 2020 Presidential race. *stand clear of the closing doors*","name":"steve bullock","Sentiment":0.1181818182},{"date":"2019-05-14T07:57:31+00:00","tweet":"Welcome Governor Steve Bullock to the #2020 race! In Montana, @GovBullock has been a vocal protector of Title X and has vetoed abortion restrictions that landed on his desk. Montana's know that reproductive freedom is core to actual freedom.","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-14T07:54:36+00:00","tweet":"Montana Gov. Steve Bullock has launched his 2020 run, joining a long list of candidates seeking the Democratic nomination. CBS News political correspondent @edokeefe will sit down with Bullock to talk about his announcement on CBSN at 1pm ET.","name":"steve bullock","Sentiment":-0.0685185185},{"date":"2019-05-14T07:37:48+00:00","tweet":"Steve Bullock will not become President. He won’t come close to winning the Democratic nomination. But he could help Democrats win the Senate. Without the Senate they can hardly get anything done. But Democrats across the country who could win refuse to run. It’s a problem. …","name":"steve bullock","Sentiment":0.4520833333},{"date":"2019-05-14T07:33:57+00:00","tweet":"There are now 22 Democrats running for president. @ForecasterEnten breaks down Montana Gov. Steve Bullock’s chances — and Beto O’Rourke’s steep dive.","name":"steve bullock","Sentiment":-0.1555555556},{"date":"2019-05-14T07:23:48+00:00","tweet":"Montana Gov. Steve Bullock announced that he's running for president, appealing to voters as a Democrat elected twice in a largely Republican state.","name":"steve bullock","Sentiment":0.3571428571},{"date":"2019-05-14T06:54:00+00:00","tweet":"BREAKING: Montana Gov. Steve Bullock announces bid for 2020 Democratic presidential nomination.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T06:40:29+00:00","tweet":"Gov. Steve Bullock (D-MT), number 22 D candidate for POTUS, is a rare bird—elected GOV & AG repeatedly in a deeply Red Trump State. An unlikely D nominee, since positions on issues such as guns that help in MT won’t appeal to Blue State Dems (where the delegate votes are).","name":"steve bullock","Sentiment":-0.04},{"date":"2019-05-14T06:17:21+00:00","tweet":"Montana Gov. Steve Bullock announced he's running for president, becoming the 22nd Democrat to announce a bid","name":"steve bullock","Sentiment":0.45},{"date":"2019-05-14T06:15:02+00:00","tweet":"Montana Gov. Steve Bullock has announced his bid for the Democratic presidential nomination, highlighting the fact that he's the only candidate in the race to have won in a red state.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T06:10:05+00:00","tweet":"Montana Gov. Steve Bullock has announced his presidential candidacy","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T06:08:40+00:00","tweet":"Breaking #FoxNews Alert : Montana Gov. Steve Bullock announces 2020 candidacy for president, joining a crowded Democratic field vying to topple President","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T06:07:01+00:00","tweet":"The number of Democratic presidential candidates hit 22: Gov. Steve Bullock of Montana joined the race, vowing to regulate big money in politics.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-13T23:31:41+00:00","tweet":"Montana’s Democratic governor @GovBullock , Steve Bullock vetoed a bill that would have protected babies who survive abortion, saying it interferes with “deeply personal.. decisions.” Gov. Steve Bullock became the second governor this year to veto such a bill.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-13T14:10:11+00:00","tweet":"2nd Governor Vetoes Bill Protecting Babies Who Survive Abortion Montana’s Gov. Steve Bullock followed his counterpart in North Carolina. Wisconsin’s governor is pledging to veto a similar bill in his state. All 3 are Democrats. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-13T08:42:06+00:00","tweet":"Montana Governor Steve Bullock thinks there’s still room for one more in the crowded Democratic primary field, @isaacdovere reports:","name":"steve bullock","Sentiment":0.45},{"date":"2019-05-11T11:23:07+00:00","tweet":"Trump: I’m going to retweet some white supremacists, send Rudy to pressure a foreign govt to fuck with our elections and make 55,000 American kids homeless. Politico: Do you have a nickname for Steve Bullock yet?","name":"steve bullock","Sentiment":-0.13125},{"date":"2019-05-11T10:20:52+00:00","tweet":"If this tease is any indication, Montana Gov. Steve Bullock will be the 23rd Democrat to enter the presidential race... …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-08T12:22:31+00:00","tweet":"UPDATE: Governor Steve Bullock signed a bill eliminating driver’s license suspensions as a penalty for failure to pay fines and fees. This bill is an excellent way to combat the criminalization of poverty. …","name":"steve bullock","Sentiment":0.3416666667},{"date":"2019-05-08T11:52:51+00:00","tweet":"Montana Gov. Steve Bullock vetoed #HB500, which would have banned abortion at 20 weeks. #TeamLegal …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-08T11:33:37+00:00","tweet":"I predict that Governor Steve Bullock of Montana will be stronger than expected candidate for the 2020 Democratic Party Presidential Nomination. I think he will be a strong dark horse contender for nod.","name":"steve bullock","Sentiment":0.0611111111},{"date":"2019-05-08T10:48:37+00:00","tweet":"Tell Montana Governor Steve Bullock that he should not waste state resources on this appeal, that you want grizzlies to remain on the Endangered Species List until fully recovered. Montana is the Last Best Place with grizzly bears! …","name":"steve bullock","Sentiment":0.3666666667},{"date":"2019-05-08T00:43:04+00:00","tweet":"Montana Legislature sends concealed-carry bill to voters following veto by Governor Steve Bullock (D) …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-08T00:32:33+00:00","tweet":"Montana Gov Steve Bullock #babiesarereal #allbabieslivesmatter #abortionismurder #stopkillingbabies","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-07T21:31:22+00:00","tweet":"I guess Steve Bullock is really running then.","name":"steve bullock","Sentiment":0.2},{"date":"2019-05-07T21:15:00+00:00","tweet":"A bill to change Montana's child sexual abuse laws, including lifting the statute of limitations for prosecuting such crimes, was signed Tuesday by Gov. Steve Bullock. …","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-07T20:00:13+00:00","tweet":"On April 25, Gov. Steve Bullock signed HB 285 declaring one mile of Buffalo Trail Rd. the Pearl Harbor Veterans’ Memorial Highway. The bill was carried by Rep. Vince Ricci, of #LaurelMT, seated to the left of Gov. Bullock. Supporters standing in the back…","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-07T19:18:53+00:00","tweet":"Governor Steve Bullock today signed into law the Montana Economic Industry Advancement (MEDIA) Act, a 20%-35% transferable tax credit for film productions in Montana. We already know Montana is the ultimate location – this will continue to strengthen our growing film industry!","name":"steve bullock","Sentiment":0.1},{"date":"2019-05-07T17:36:03+00:00","tweet":"Gov. Steve Bullock today is signing into law bills for two Havre women, Keeley Wilson and Andrea Melle. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-07T16:38:04+00:00","tweet":"Who WOULD look like a probable winner to you? If Steve Bullock had a big national profile, would he look like a winner to you?","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-07T16:19:35+00:00","tweet":"Too bad Steve Bullock is being selfish and wasting time with a planned presidential campaign that will go nowhere. Otherwise, MT would have been very competitive next year.","name":"steve bullock","Sentiment":-0.25},{"date":"2019-05-07T14:24:39+00:00","tweet":"Montana became the first state to legalize sports betting in 2019 when Gov. Steve Bullock signed HB 725 into law. …","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-07T13:56:25+00:00","tweet":"On Friday, Montana Governor Steve Bullock signed one of two sports betting bills into law The state wants to offer domestic wagering in time for football season this fall Congrats MT!! Read the full story:","name":"steve bullock","Sentiment":0.1833333333},{"date":"2019-05-07T13:31:40+00:00","tweet":"This is one reason why Steve Bullock has all but announced he is running for President and why Larry Hogan is considering to run.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-07T13:04:51+00:00","tweet":"I'm looking into someone like Steve Bullock for this reason. To stop any future Trumps, Cruzes, Ryans or McConnells, Democrats need to win huge and have a large governing majority. Democrats forget how much a disaster a Hillary presidency would have been with a GOP Congress","name":"steve bullock","Sentiment":0.3228571429},{"date":"2019-05-07T10:08:35+00:00","tweet":"Montana voters will decide on concealed carry initiative after Gov. Steve Bullock vetoed a bill passed by GOP legislature - …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-07T04:12:43+00:00","tweet":"A pro-Brexit minister and MPs have accused the Civil Service of pursuing a ‘Remain’ agenda. Steve Bullock, a former civil servant, argues that the consequences of undermining civil servants in this way are potentially disastrous. …","name":"steve bullock","Sentiment":-0.35},{"date":"2019-05-03T16:40:45+00:00","tweet":"Montana is the first state in 2019 to authorize sports betting. Gov. Steve Bullock signed a bill Friday for the Montana State Lottery to oversee wagering on sports through kiosks and mobile devices. …","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-03T14:27:42+00:00","tweet":"So Mayor Bill De Blasio will be number 23. Also expected soon, number 24 Gov. Steve Bullock of Montana. Number 25 could be Stacey Abrams of GA. Any rumors of others? And to think some of you thought I was joking about a Baskin-Robbins 31.","name":"steve bullock","Sentiment":-0.1},{"date":"2019-05-02T19:58:46+00:00","tweet":"Steve Bullock on Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-02T09:03:55+00:00","tweet":"Seriously, who the hell is advising Steve Bullock to run for president instead of Senate in Montana? Who on earth is egging on Michael Bennet to give up his Senate seat in Colorado to run for president? Nobody wants you guys as president! Focus on the Senate, my people.","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-05-01T13:52:05+00:00","tweet":"JUST IN: Montana governor Steve Bullock to announce bid for presidency: report","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-01T09:37:39+00:00","tweet":"And Steve Bullock, who'd probably be the favorite in Montana's Senate race, is probably running a doomed presidential campaign instead! …","name":"steve bullock","Sentiment":0.625},{"date":"2019-04-30T20:26:49+00:00","tweet":"Montana Governor Steve Bullock is preparing to run for President soon so let's look at his reelection win in 2016. Bullock was reelected by 4% against businessman and future amateur wrestler Greg Gianforte. He won 25\/50 Senate districts.","name":"steve bullock","Sentiment":0.1833333333},{"date":"2019-04-30T14:53:45+00:00","tweet":"It's kind remarkable that other Democrats (Steve Bullock) can look at what's happened since Beto chose a WH bid over a less uphill Senate bid and think: \"That's it, that's what I want.\"","name":"steve bullock","Sentiment":0.2645833333},{"date":"2019-04-30T07:54:15+00:00","tweet":"Let’s recap the supposed top-tier recruits who were impervious to Schumer’s “power of persuasion” this cycle: Tom Vilsack in IA John Hickenlooper in CO Steve Bullock in MT Stacey Abrams in GA Beto O’Rourke in TX Josh Stein in NC Crisanta Duran in CO","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-29T11:52:18+00:00","tweet":"As Steve Bullock prepares to a launch a presidential campaign after MT's legislative session ends, he's hired @GaliaSlayen to be communications director. @JeremyCBusch running comms in Iowa, @JamesDakinOwens senior advisor.","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-26T00:34:15+00:00","tweet":"While more than 30 Democrats are expected to campaign against President Trump in 2020, Montana Gov. Steve Bullock is pondering whether he should enter the race as well. - @NBCLeftField","name":"steve bullock","Sentiment":0.2},{"date":"2019-04-25T13:14:27+00:00","tweet":"20 Dem POTUS candidates, and possibly 1-2 more coming (Sen. Michael Bennet of CO? Gov. Steve Bullock of MT?). A record in US history by 3-5. Many of them couldn't get a headline if they paid for it. Not fair but life isn't. #Joe2020","name":"steve bullock","Sentiment":0.1625},{"date":"2019-04-22T07:22:25+00:00","tweet":"This leaves five potential candidates (not including Biden who is announcing this week) Stacey Abrams, Michael Bennet, Steve Bullock, Bill De Blasio, and Joe Sanberg …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-18T07:29:35+00:00","tweet":"*Chuck Schumer glares at Steve Bullock* …","name":"steve bullock","Sentiment":0.0},{"date":"2019-04-11T16:36:01+00:00","tweet":"The Bulldogs visited the State Capitol today. A huge thank you to Governor Steve Bullock and all the senators for inviting us to come celebrate our National Championship year!! #GoDawgs","name":"steve bullock","Sentiment":0.625},{"date":"2019-04-11T06:10:00+00:00","tweet":"Steve Bullock, Tanja and a load of other people have corrected him on here on loads of stuff he's said and they did it for free and didn't need to be \"crowdfunded\"","name":"steve bullock","Sentiment":0.1375},{"date":"2019-04-10T06:33:00+00:00","tweet":"Montana Gov. Steve Bullock is fighting dark money in politics — and it’s working","name":"steve bullock","Sentiment":-0.15},{"date":"2019-04-08T10:09:55+00:00","tweet":"Montana Governor Steve Bullock has signed Knife Rights' Montana Switchblade Ban Repeal and Knife Law Preemption bill __","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-06T11:04:06+00:00","tweet":"If I am not contacted, I hope Ndn country will continue to press this issue with Harris, & tribal sovereignty issues with all the presidential candidates wherever they go. Shout out to Avery Old Coyote who did this with Steve Bullock on Keystone XL. …","name":"steve bullock","Sentiment":0.1},{"date":"2019-07-05T19:08:11+00:00","tweet":"Montana Governor Steve Bullock: \"Come to Glacier Park soon because the glaciers will be gone.\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-05T18:19:14+00:00","tweet":"\"I've been asked to lower the flags by both Trump and President Obama 53 times in total. Over a quarter of those were for mass shootings.\" -Montana Governor Steve Bullock, 2020 presidential candidate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-05T13:34:40+00:00","tweet":"Any room for Marine Corps combat veteran and member of Congress Seth Moulton or two term governor of red state Montana Steve Bullock? …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-04T12:14:16+00:00","tweet":"My daughter and I rode our bikes down to downtown Cedar Rapids today to watch the Fifth Season race and visit with one of the runners, Montana Governor and Presidential candidate, Steve Bullock. I hope Iowans get the chance to meet him and the rest of the candidates. #iacaucus","name":"steve bullock","Sentiment":-0.1555555556},{"date":"2019-07-02T21:46:44+00:00","tweet":"With the update that the DNC will count the figures from Suffolk\/USA Today that are rounded to the nearest whole number, Steve Bullock gains an edge on Eric Swalwell in the tiebreaker for the last spot in the 2nd #DemDebates. …","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-07-02T15:54:04+00:00","tweet":"WATCH: Democrat Steve Bullock says his party often treats blue collar American coal workers as “villains.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-02T14:36:08+00:00","tweet":"People love to dunk on Schumer’s judgment, but “Steve Bullock and Beto O’Rourke have better chances of becoming senators than becoming president” was a strong take …","name":"steve bullock","Sentiment":0.4666666667},{"date":"2019-07-02T01:08:42+00:00","tweet":"Marianne’s listed policies from her website are pro-tribal sovereignty. Steve Bullock and Jay Inslee seem to have pretty good records with tribes.","name":"steve bullock","Sentiment":0.475},{"date":"2019-06-30T10:50:01+00:00","tweet":"Tim Ryan: \"The attack on @KamalaHarris is racist\" Steve Bullock \"The ugly, racist attacks against @KamalaHarris represent the worst of us\" Kirsten Gillibrand: \"We need a president who will take on the biggest fights we face—even if she stands alone.\"","name":"steve bullock","Sentiment":-0.85},{"date":"2019-06-28T00:01:39+00:00","tweet":"The Late Show's All Governor Steve Bullock Debate: No Bull, All Bullock. @GovernorBullock #DemDebate2 #LateShowLIVE","name":"steve bullock","Sentiment":-0.3},{"date":"2019-06-27T22:50:27+00:00","tweet":"I'm Steve Bullock and I still approve this message: #DemDebate2","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-27T21:02:42+00:00","tweet":"Steve Bullock passed on the Montana Senate race to not qualify for the Democratic presidential debates.","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-26T21:21:05+00:00","tweet":"Steve Bullock Leads Pack Of Shut-Out Democratic Candidates To Storm Debate Stage #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-26T12:30:05+00:00","tweet":"Media coverage the next morning: \"Jay Inslee claims he is Steve Bullock. But Steve Bullock also claims he is Steve Bullock. Who is right?\"","name":"steve bullock","Sentiment":0.1428571429},{"date":"2019-06-26T12:16:54+00:00","tweet":"Scoop: Jan Bauer, a major player in Iowa caucus politics, who offered a key early state endorsement to Obama in '08, tells me she's backing Steve Bullock in 2020 primary. …","name":"steve bullock","Sentiment":0.140625},{"date":"2019-06-24T15:22:06+00:00","tweet":"Gov Bullock, are you ready for civil war? Ready to challenge the Constitution? Then shut up & sit down‼️️ Montana Gov. Steve Bullock: Time to View Guns as a ‘Public Health Issue’ via @BreitbartNews","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-06-23T13:24:08+00:00","tweet":"List of candidates who should drop out: 1. Tulsi Gabbard 2. Marianne Williamson 3. Pete Buttigieg 4. Bernie Sanders 5. Andrew Yang 6. Michael Bennett 7. Steve Bullock 8. John Delaney 9. Bill de Blasio 10. John Hickenlooper 11. Jay Inslee 12. Wayne Messam 13. Eric Swalwell","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-21T01:51:45+00:00","tweet":"Still not Steve Bullock. Apparently the NYT has no idea what he looks like?","name":"steve bullock","Sentiment":0.05},{"date":"2019-06-18T11:54:15+00:00","tweet":"NEW: Gov. Steve Bullock, after missing out on June Democratic debate, qualifies for July face-off.","name":"steve bullock","Sentiment":-0.0318181818},{"date":"2019-07-05T17:46:31+00:00","tweet":"Not likely to qualify for the July 30-31 debates: conservatives John Delaney, John Frackenlooper, Tim Ryan, Michael Bennet, Steve Bullock & Eric Swalwell + one progressive who isn't really running, Bill de Blasio","name":"steve bullock","Sentiment":0.1},{"date":"2019-07-05T16:43:06+00:00","tweet":"Montana Gov. Steve Bullock raises $2 million for 2020 bid in second quarter, campaign says","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-05T10:00:09+00:00","tweet":"Who will make the cut? Michael Bennet Steve Bullock Bill de Blasio Eric Swalwell They’ve all got a polling average of at least 1% and have qualified for the July Dem debate, but there are only 3 slots to give them.","name":"steve bullock","Sentiment":-0.15},{"date":"2019-06-28T12:19:36+00:00","tweet":"Governors John Hickenlooper and Steve Bullock: You have Republican Senators (and McConnell ass-kissers) up for reelection in your states (Colorado and Montana) next year. Stop running for president, unseat them and turn the U.S. Senate Democratic. *That’s* where you can help.","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-28T09:31:00+00:00","tweet":"Gov. Steve Bullock: \"We have to do more than just talk about Donald Trump and this election can't be about Donald Trump.\"","name":"steve bullock","Sentiment":0.5},{"date":"2019-06-28T09:01:00+00:00","tweet":"Gov. Steve Bullock: \"We've got to make sure to not only bring out our base but also ensure that we can bring back voters, win back places like Michigan, Wisconsin, Pennsylvania.\"","name":"steve bullock","Sentiment":0.0833333333},{"date":"2019-06-28T00:10:23+00:00","tweet":"Excluded from debate, Steve Bullock tries his luck in New Hampshire and Iowa","name":"steve bullock","Sentiment":0.0181818182},{"date":"2019-06-27T22:30:18+00:00","tweet":"If you're Seth Moulton or Steve Bullock how are you feeling knowing MARIANNE WILLIAMSON qualified for the debate and you couldn't? #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-27T21:30:24+00:00","tweet":"Steve Bullock should be here. It’s ridiculous that he isn’t.","name":"steve bullock","Sentiment":-0.3333333333},{"date":"2019-06-27T21:00:23+00:00","tweet":"Seems fitting that Gov. Steve Bullock is not on stage for the debate -- a rural populist who is moderate on hot button social issues prioritized by wealthy elites in the party, but fairly radical on issues of economic justice & money in politics, he's a dying breed for Dems.","name":"steve bullock","Sentiment":0.2729166667},{"date":"2019-06-26T20:30:10+00:00","tweet":"Steve Bullock, locked out of the Democratic debate, has arranged for town-hall-style events on local television in Iowa and New Hampshire","name":"steve bullock","Sentiment":0.0681818182},{"date":"2019-06-26T17:36:47+00:00","tweet":"Steve Bullock's been very disciplined about staying on message to date. So it's interesting to hear him respond to town hall questions on reparations, student debt and other issues that he can't answer with either a) I won in a Trump state or b) dark money is bad. #mtpol","name":"steve bullock","Sentiment":-0.055},{"date":"2019-06-25T13:55:43+00:00","tweet":"“You’re talking about a state where the number one domestic issue is wolf murder. I don’t know if that translates to a national campaign.” - @cushbomb just demolishing Steve Bullock on this week’s @CHAPOTRAPHOUSE","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-24T11:32:04+00:00","tweet":"The DNC rules created a dynamic in which a traditional political résumé was neither necessary nor sufficient to qualify for the debates. So voters will see Andrew Yang and Marianne Williamson this week, but not Gov. Steve Bullock or Rep. Seth Moulton …","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-23T14:30:00+00:00","tweet":"TONIGHT on @NBCNightlyNews: Steve Bullock pitches his #BigIdea. It's the next installment in \"My Big Idea,\" a series where @HarrySmith interviews the 2020 Democratic candidates about their major policy ideas ahead of the nomination.","name":"steve bullock","Sentiment":0.0208333333},{"date":"2019-06-22T22:51:09+00:00","tweet":"She’s on the debate stage; red-state governor Steve Bullock isn’t. At some point, the RNC\/DNC should just choose who qualifies for the debates based on traditional qualifications. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-22T09:13:00+00:00","tweet":"Montana Governor Steve Bullock is the only Democratic candidate to have won a Trump state. His record of garnering bipartisan support for his initiatives began as Montana attorney general. His bio:","name":"steve bullock","Sentiment":0.025},{"date":"2019-06-20T07:39:40+00:00","tweet":"Good morning and Happy Thursday Team Trump! Here’s a list of Democrats with next to no support who for some reason, STILL are running for President. -Tim Ryan -Eric Swalwell -Steve Bullock -John Delany -John Hickenlooper -Seth Moulton -Wayne Messam","name":"steve bullock","Sentiment":0.5666666667},{"date":"2019-06-20T02:15:32+00:00","tweet":"Marianne Williamson isn’t exactly a nobody: she has qualified for the Democratic debate stage next week, over more establishment candidates like Gov. Steve Bullock of Montana. Hat tip to @JulesJester for catching the remarks tonight: …","name":"steve bullock","Sentiment":0.3375},{"date":"2019-06-18T19:05:05+00:00","tweet":"Montana Gov. Steve Bullock is the only Democratic presidential candidate who won statewide in 2016 where President Trump also won. He spoke to the NPR Politics Podcast about expanding Medicaid in his state, campaign finance reform and climate change.","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-18T13:17:35+00:00","tweet":"Why Democrats defend a nominating system that allows Marianne Williamson on the debate stage and not Steve Bullock is beyond me. Seems like today’s system is pretty close to the one you’d design if your desired output was unqualified and\/or demagogic candidates.","name":"steve bullock","Sentiment":0.25},{"date":"2019-06-18T11:15:05+00:00","tweet":"In an interview with the NPR Politics Podcast, Montana Gov, Steve Bullock talked about the impact of his 11-year-old nephew being killed in a school shooting: \"It impacts the way I think in a lot of ways, in public policy.\" Listen here:","name":"steve bullock","Sentiment":-0.1},{"date":"2019-06-17T14:18:06+00:00","tweet":"Democratic party superdelegates (2016) — Hillary Clinton — Michael Bennet Joe Biden Cory Booker Steve Bullock John Delaney Kirsten Gillibrand Jay Inslee Amy Klobuchar Seth Moulton Beto O'Rourke Tim Ryan Eric Swalwell Elizabeth Warren — Bernie Sanders — Tulsi Gabbard","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-14T08:42:02+00:00","tweet":"Print is best. Gov. Steve Bullock couldn’t qualify for the Democratic debate. So only his boots qualified for the NYT’s photo.","name":"steve bullock","Sentiment":0.5},{"date":"2019-06-13T22:31:34+00:00","tweet":"I’ve said before that Montana Gov. Steve Bullock should be running for Senate, given how critical the Senate is & how he’s the one Democrat who could put that GOP-leaning seat in a play. But excluding him yet including several non-serious Dems in the first TV debate is absurd …","name":"steve bullock","Sentiment":-0.0625},{"date":"2019-06-13T18:22:19+00:00","tweet":"Three Democratic candidates did not make the DNC's cut. • Montana Gov. Steve Bullock • Massachusetts Rep. Seth Moulton • Miramar, Florida, Mayor Wayne Messam","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-13T18:10:50+00:00","tweet":"Steve Bullock outside the first debate","name":"steve bullock","Sentiment":0.125},{"date":"2019-06-13T18:03:03+00:00","tweet":"That Marianne Williamson made the debate and not Steve Bullock, a sitting two-term governor in a red state, says a lot about how strange and unwieldy this primary is.","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-06-13T17:56:27+00:00","tweet":"Quite the high bar. 20 of 23 candidates satisfy reqs to reach the debate stage (including 1\/7 of the Senate Democratic caucus). On the outside looking in? Montana Gov. Steve Bullock, Rep. Seth Moulton of Massachusetts and Wayne Messam, the mayor of Miramar, Fla..... via @latimes …","name":"steve bullock","Sentiment":0.08},{"date":"2019-06-13T17:50:22+00:00","tweet":"The Democratic National Committee just confirmed that Steve Bullock, Seth Moulton and Wayne Messam did not qualify for the first Democratic 2020 debate","name":"steve bullock","Sentiment":0.325},{"date":"2019-06-13T10:00:14+00:00","tweet":"20 Democratic presidential candidates will take the debate stage later this month. According to a New York Times analysis, Steve Bullock, Seth Moulton and Wayne Messam will be left out.","name":"steve bullock","Sentiment":0.0454545455},{"date":"2019-06-13T08:17:07+00:00","tweet":"Steve Bullock, Seth Moulton, Wayne Messam and Mike Gravel all appear to have fallen short of qualifying for the first Dem WH debate. Past WH candidates from both parties who have been excluded from all\/some\/one major primary debates:","name":"steve bullock","Sentiment":0.0925},{"date":"2019-06-12T16:12:01+00:00","tweet":"20 Democrats have qualified for the first debates on June 26-27. Barring any late polls tonight or donor surprises tomorrow, the DNC won't need tiebreakers to sort out who's in and who's out. Bad news is for Steve Bullock, who remains 1 poll short. …","name":"steve bullock","Sentiment":-0.1875},{"date":"2019-06-12T14:33:23+00:00","tweet":"As the DNC prepares to announce who will make the first debates, an Iowa voter asks Steve Bullock: \"Who can tell the DNC to bug out? It is not their job to winnow the field—it’s our job.” …","name":"steve bullock","Sentiment":0.25},{"date":"2019-06-12T13:07:53+00:00","tweet":"Today is the deadline for polls to qualify for the 1st Dem 2020 debate, not looking good for Steve Bullock and Seth Moulton (along with Messam and Gravel), per unofficial tabulation kept by @bkamisar. Bullock trying to turn it into opportunity w\/new video …","name":"steve bullock","Sentiment":0.7},{"date":"2019-06-10T07:57:45+00:00","tweet":"Democrats facing a steep uphill climb to win back the Senate want Beto O'Rourke, John Hickenlooper & Steve Bullock to reconsider their long-shot bids for president and take another look at running for the Senate, where they could pick up 3 critical seats. …","name":"steve bullock","Sentiment":0.2666666667},{"date":"2019-06-09T11:01:24+00:00","tweet":"Montana Sen. Jon Tester endorses Steve Bullock for 2020.","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-07T17:22:53+00:00","tweet":"Man, this is why I'll always love Daily Kos. Steve Bullock just put up a post to complain about getting excluded from the presidential debate ... and tons of people show up in comments to ask him to run for Senate …","name":"steve bullock","Sentiment":0.25},{"date":"2019-06-06T14:23:59+00:00","tweet":"Because Governor Bullock waited to get into the race until he passed Medicaid expansion for nearly 100,000 Montanans, this effectively punishes Governor Steve Bullock for doing his job and finishing out his legislative session.","name":"steve bullock","Sentiment":0.35},{"date":"2019-06-06T11:06:46+00:00","tweet":"Steve Bullock didn't jump in the race until mid-May because he wanted to finish out Montana's legislative session. Fair or not, a successful, popular governor from a red state that voted Trump by 20 points won't really be able to effectively compete because of.. DNC debate rules. …","name":"steve bullock","Sentiment":0.3375},{"date":"2019-06-05T12:38:00+00:00","tweet":"Today a federal judge will hear arguments on the merit of a lawsuit by Montana Gov (& 2020 hopeful) Steve Bullock and the New Jersey Attorney General that aims to force the Trump admin to resume collecting info on donors to #DarkMoney political nonprofits …","name":"steve bullock","Sentiment":0.0621212121},{"date":"2019-06-04T09:12:02+00:00","tweet":"I mean, I write about politics for a living, and I don't even have an opinion about Steve Bullock.","name":"steve bullock","Sentiment":-0.3125},{"date":"2019-06-04T09:10:17+00:00","tweet":"Good example of why primary polls should be treated with the utmost care: The idea that 21 percent of Americans have an opinion about Steve Bullock is preposterous. …","name":"steve bullock","Sentiment":0.55},{"date":"2019-06-03T18:58:23+00:00","tweet":".@SenGillibrand News Flash: You’re losing to some random guy off the street named Steve Bullock.","name":"steve bullock","Sentiment":-0.5},{"date":"2019-05-27T17:25:24+00:00","tweet":"Why do you think these candidates are in the primary race? John Hickenlooper Michael Bennet Eric Swalwell Tim Ryan Seth Moulton Bill De Blasio Steve Bullock John Delaney","name":"steve bullock","Sentiment":0.4},{"date":"2019-05-26T22:33:05+00:00","tweet":"Gov. Steve Bullock: We can't let 'America First' become 'America Alone.'","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-26T11:23:00+00:00","tweet":"Montana Gov. (and presidential candidate) Steve Bullock said, \"You look at today, only half the 30-year-olds are doing better than their parents were at age 30. When I was being raised, it was 90%.\" That's pretty much accurate.","name":"steve bullock","Sentiment":0.1966666667},{"date":"2019-05-20T15:54:20+00:00","tweet":"Harry Reid to @jmartNYT: \"It’s a shame that someone like Steve Bullock would not run for the Senate. It’s a shame that Beto O’Rourke — he came to see me at my home. I just lament he’s not running for the Senate.\" …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-20T14:30:31+00:00","tweet":"Steve Bullock's unique homepage question: \"Who the heck is Steve Bullock?\"","name":"steve bullock","Sentiment":0.375},{"date":"2019-05-19T18:42:43+00:00","tweet":"Democrat Steve Bullock supports unlimited abortion, even until the moment a baby is born! And he just vetoed a bill to stop infanticide. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-19T10:10:35+00:00","tweet":"CNN's Jake Tapper: When do you think life begins? Gov. Steve Bullock: It’s not up to people like me to be making these decisions. I think that’s the greater point. It’s ‘what does an individual woman need to do with her body and with her health care?’ #CNNSOTU","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-19T10:01:59+00:00","tweet":"2020 candidate Gov. Steve Bullock on the economy: “The economy is booming for a whole lot of folks, but for a whole lot of folks they’re not getting a lot better because of the Trump tax cuts and what President Trump has done.” #CNNSOTU","name":"steve bullock","Sentiment":0.3},{"date":"2019-05-18T15:38:33+00:00","tweet":"\"Come to Montana, our glaciers will be gone soon\" -Dem candidate Steve Bullock on endorsing the new green deal #MAGA @realDonaldTrump @DonaldJTrumpJr","name":"steve bullock","Sentiment":-0.0318181818},{"date":"2019-05-18T10:29:30+00:00","tweet":"A special guest at Steve Bullock’s event in Maquoketa, IA: Andy McKean, a longtime GOP state legislator who just became a Democrat. Says the hateful letters he’s gotten since then convinced him he was right to do it.","name":"steve bullock","Sentiment":0.3214285714},{"date":"2019-05-18T00:51:00+00:00","tweet":"Gov. Steve Bullock campaigns in Iowa with state AG Tom Miller: \"We gather to make sure that Donald Trump is a one-term president.\" Miller has endorsed Bullock:","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-17T23:45:00+00:00","tweet":"Gov. Steve Bullock campaigns in Iowa: \"We're here to make sure that Donald Trump does not get re-elected.\"","name":"steve bullock","Sentiment":0.5},{"date":"2019-05-16T23:09:07+00:00","tweet":"Get yourself an Iowa official that looks at you the way Tom Miller looks at Steve Bullock. (He endorsed Bullock and picked him up from the airport today ) #iacaucus","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-16T21:14:34+00:00","tweet":"massive boos for more men running for president and bill de blasio. applause for steve bullock (?????)","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-16T09:42:29+00:00","tweet":"2020 hopeful Steve Bullock, who says he is a hunter, says gun violence needs to be “a public health issue”: “A public health issue would say, ‘How can we actually make sure that everybody can stay safe?' And gun owners and non-gun owners want people to be able to stay safe”","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-05-16T09:32:00+00:00","tweet":"2020 presidential candidate Steve Bullock won the endorsement of Iowa’s attorney general, making Bullock the first candidate to win the support of an Iowa Democrat elected statewide. “I was pleased that he has the trust in me that he thinks that I can get this done”","name":"steve bullock","Sentiment":0.4},{"date":"2019-05-15T22:03:10+00:00","tweet":"\"I've been asked to lower the flags by both Presidents Trump and Obama 53 times in total. Over a quarter of those were for mass shootings.\" -Montana Governor Steve Bullock, 2020 presidential candidate","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T21:53:30+00:00","tweet":"Montana Governor Steve Bullock: \"Come to Glacier Park soon because the glaciers will be gone.\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T21:43:16+00:00","tweet":"Steve Bullock is another Dem govnr who actually gets sh*t done. Pro-choice, supports same sex marriage, believes climate change is real and that humans contribute to it, is pro-campaign finance reform, believes in protecting DACA recipients, and supports organized labor. #maddow","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-05-15T20:00:05+00:00","tweet":"Montana Gov. Steve Bullock raised $1 million from voters in all 50 states in the 24 hours after he launched his 2020 presidential bid, his campaign announced","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-15T17:08:25+00:00","tweet":"News: Montana Gov. Steve Bullock raised $1 million in the first 24 hours of his presidential campaign, his campaign will announce soon. Something that won't be released: His number of donors. That number will be critical to whether Bullock makes the first debate stage.","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-05-15T09:53:02+00:00","tweet":"Montana Gov. Steve Bullock said President Trump is not a good role model, adding that \"we're expecting more from preschoolers\" than Trump, while on \"CBS This Morning\"","name":"steve bullock","Sentiment":0.075},{"date":"2019-05-14T23:25:14+00:00","tweet":"We NEED These Ppl to run as Senators Steve Bullock in Montana against Steve Daines John Hickenlooper in Colorado against Cory Gardner Beto O’Rourke in Texas against John Coryn Amy McGrath against The Turtle in Kentucky Stacey Abrams in Geogia against David Perdue","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T22:30:23+00:00","tweet":"Programming Note! Montana Governor Steve Bullock, newly declared Democratic candidate for president will join Rachel Maddow live, in-studio Wednesday, 5\/15 at 9pm ET.","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-05-14T21:30:07+00:00","tweet":"Top Democrats really want Montana Gov. Steve Bullock to run for the Senate, not the presidency.","name":"steve bullock","Sentiment":0.35},{"date":"2019-05-14T21:21:01+00:00","tweet":"Montana Gov Steve Bullock announced today he's running for president. Just 5 days ago he vetoed a bill to stop infanticide! If Bullock can't tell the difference between serving Americans and killing Americans he has no business being president.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T20:48:06+00:00","tweet":"Montana Gov. Steve Bullock is the 22nd Dem to announce a run for president. He’s a clone of the first 21. All want to take freedom away from individuals and give it to government. Remember at the end of every law, regulation, and tax there is the barrel of a gun of a govt agent","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-14T20:34:42+00:00","tweet":"The 22nd candidate to run for the Dumbocrap party is Steve Bullock, governor of Montana. WOOOOOOOOOHHHHHH!! Shaking in my Tony Lamas and Justin’s.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T20:29:32+00:00","tweet":"When I interview a person, one question I have always asked is “what is your greatest achievement?” Democrat Montana Governor Steve Bullock just failed my interview. And he’s running for President... SMH Video courtesy of @RealSaavedra","name":"steve bullock","Sentiment":0.25},{"date":"2019-05-14T19:12:52+00:00","tweet":"Steve Bullock making the rounds at a microbrewery. OH: “We don’t see the media like this in Montana.” “Well, not since the Unabomber.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T17:07:22+00:00","tweet":"Cringeworthy Watch Democrat Montana Governor Steve Bullock struggle to name a single achievement he is proud of as governor during his 2020 presidential campaign launch","name":"steve bullock","Sentiment":0.3642857143},{"date":"2019-05-14T15:01:14+00:00","tweet":"Schumer doesn't express concerns about seeing Steve Bullock run for president rather than the Montana Senate seat. He says he \"only talked to Steve Bullock once six months ago\" when the Montana governor told him he was running for president.","name":"steve bullock","Sentiment":0.0},{"date":"2019-05-14T14:48:55+00:00","tweet":"Why Run For Senate And Win When You Can Run For President And Lose? By Steve Bullock, Beto O'Rourke, Julian Castro, and Cory Booker Foreword by Stacey Abrams","name":"steve bullock","Sentiment":0.8},{"date":"2019-05-14T14:48:43+00:00","tweet":"Steve Bullock is the Governor of Montana. He has a real chance of winning in a Senate race which would help Democrats regain seats in the Senate. Instead, he’s joining over 20 other people in race to be the Democratic nominee for President. It’s as if no one learned from 2016.","name":"steve bullock","Sentiment":0.1916666667},{"date":"2019-08-07T19:13:00+00:00","tweet":"Presidential candidate Steve Bullock on gun legislation: “I think if we could ever look at this as a public health issue, not as a political issue, we could make a difference.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-07T16:43:11+00:00","tweet":"Steve Bullock: Trump reelection 'more likely with each passing minute' Actually not. This is a bad message for him.","name":"steve bullock","Sentiment":-0.05},{"date":"2019-08-07T12:41:29+00:00","tweet":"Steve Bullock cannot be the Democratic nominee for President for this opinion ALONE. We CANNOT have him picking Supreme Court justices, and this is why the media needs to actually press these candidates on the federal courts. IT'S AN ENTIRE BRANCH OF GOVERNMENT, FOLKS. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-07T10:08:28+00:00","tweet":"Steve Bullock on Trump this morning: The president of the United Stars gives aid and comfort to the enemies of democracy abroad and incites the enemies of decency at home","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-06T22:29:00+00:00","tweet":"max donors to any campaign invite public disclosure and scrutiny. why is a local politician calling these folks out any more dangerous than steve bullock calling out the koch bros? …","name":"steve bullock","Sentiment":-0.025},{"date":"2019-08-06T06:54:08+00:00","tweet":"\"At the time, it was the youngest school yard shooting in our country's history,\" says Steve Bullock, whose 11-year-old nephew was shot dead by a 10-year-old in 1994. \"Now if a 10-year-old shot and killed an 11-year-old, it probably wouldn't even make national news.\"","name":"steve bullock","Sentiment":-0.2},{"date":"2019-08-03T15:52:20+00:00","tweet":"The biggest thing Steve Bullock could do to stop gun violence is drop out of a race he’s polling at 1% and get into the Montana Senate race where he’ll be the immediate front runner and help take back the Senate. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-03T13:10:35+00:00","tweet":"Gov. Steve Bullock notes that he used to be a union lawyer, says Congress should pass card check and we should pursue sectoral bargaining in the U.S. \"There's been a collective attack on the right to organize.\" #AFSCMEForum","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-08-02T14:40:13+00:00","tweet":"Whoa. John Hickenlooper could be making the switch to #COSen for 2020 now that his path to the Democratic Presidential nomination has encountered some major obstacles. Now we just need Steve Bullock to do the same for #MTSen. …","name":"steve bullock","Sentiment":0.0041666667},{"date":"2019-08-01T16:58:19+00:00","tweet":"Presidential candidate Gov. Steve Bullock on Pres. Trump’s China tariff: “It’s a tax that every American family is going to be paying for to the tune of thousands and thousands of dollars. This isn’t the way. You don’t conduct trade policy by tweet.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-01T11:50:56+00:00","tweet":"Big win for Steve Bullock. …","name":"steve bullock","Sentiment":0.4},{"date":"2019-08-01T10:47:06+00:00","tweet":"3 Democrats Running for president Who Could Win a Senate Seat in 2020 Gov. John Hickenlooper Could Beat GOP Sen. Cory Gardner in Colorado Beto O’Rourke Could Beat GOP Sen. John Cornyn in Texas Gov. Steve Bullock Could Beat GOP Sen. Steve Daines In Montana","name":"steve bullock","Sentiment":0.8},{"date":"2019-08-01T02:39:37+00:00","tweet":"Respectfully, this is you Michael Bennet, Beto O'Rourke, and Steve Bullock …","name":"steve bullock","Sentiment":0.5},{"date":"2019-07-31T20:42:11+00:00","tweet":"you cannot convince me that michael bennett and steve bullock are different people","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T16:43:25+00:00","tweet":"Total votes received by candidates from red states in their last elections: Pete Buttigieg - - - - -8,515 (2015) Julián Castro - - - - 29,454 (2013) Tim Ryan - - - - - - 149,271 (2018) Steve Bullock - - - 255,933 (2016) Beto O’Rourke - 4,045,632 (2018) #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T10:33:02+00:00","tweet":"Moments before Tuesday night's Democratic debate in Detroit, Montana Gov. Steve Bullock delivered news about a victory back home: The governor just won a year-long lawsuit against the Trump administration.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T08:57:00+00:00","tweet":"Steve Bullock: \"The biggest problem with immigration is Donald Trump. He's using it to divide, not only to rip apart families but rip apart our country\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T08:41:05+00:00","tweet":"On CNN, Steve Bullock just accused some of the more progressive Democrats at #DemDebate of supporting \"open borders\" Every single Dem running for president talks about importance of securing the border. Dems SHOULD NOT to use GOP's false talking points *against each other*","name":"steve bullock","Sentiment":0.0255952381},{"date":"2019-07-31T08:19:27+00:00","tweet":"\"That Mayor Pete is a handsome lad and Liz Warren reminds me of my boyhood crush, Gary Cooper. I'd like to see Beto in a tight windbreaker or Steve Bullock in bermudas. But tonight I'm waiting for Mr. Joe Biden to put some starch in my boxers - I'm sorry, what was the question?\"","name":"steve bullock","Sentiment":-0.0595238095},{"date":"2019-07-31T08:16:09+00:00","tweet":"There was a presidential debate last night in which Steve Bullock participated. There was, separately and simultaneously, important national politics-and-tax news in which Steve Bullock participated: …","name":"steve bullock","Sentiment":0.2},{"date":"2019-08-07T17:38:16+00:00","tweet":"Gov. Steve Bullock: All of us are sick of pious politicians offering “hopes and prayers”","name":"steve bullock","Sentiment":-0.3571428571},{"date":"2019-08-07T16:33:32+00:00","tweet":"Now, he has evolved - but still will not face his own past and publicly admit he was wrong, as people like Steve Bullock and Kirsten Gillibrand have done. Why? Because as Heintz writes, Bernie's brand is that he was always right. It's also his mindset.","name":"steve bullock","Sentiment":0.0271428571},{"date":"2019-08-07T14:48:05+00:00","tweet":"As Montana Gov. Steve Bullock stood on the debate stage last week and listened to his 2020 rivals bicker and criticize one another, visions of a second term for Trump kept flashing through his mind","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-06T20:13:11+00:00","tweet":"As governor, Steve Bullock opposed the universal background checks he now tells me he supports as a presidential candidate. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-06T12:45:00+00:00","tweet":"Gov. Steve Bullock discusses losing an 11-year-old nephew in a school shooting.","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-02T14:36:46+00:00","tweet":"Montana Gov. Steve Bullock on the other hand, would undoubtedly be doing his party & country a solid by dropping his presidential bid & running for Senate against GOP Sen. Steve Daines #MTsen","name":"steve bullock","Sentiment":-0.0625},{"date":"2019-08-02T12:46:25+00:00","tweet":"Would you rather see @GovernorBullock Steve Bullock run for:","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-01T02:00:07+00:00","tweet":"Some Democratic presidential candidates want to decriminalize border crossings. “You are playing into Donald Trump’s hands,” Gov. Steve Bullock of Montana said during Tuesday’s debate.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T20:16:34+00:00","tweet":"Steve Bullock snuck back onto the stage. Is CNN just going to let him debate again? That's pretty unfair. #DemDebate","name":"steve bullock","Sentiment":-0.0833333333},{"date":"2019-07-31T18:44:39+00:00","tweet":"I don't think Steve Bullock is right, but I respect him enough to believe that he might be. Also, what he suggests is consistent with my certain knowledge that some loony Tories have always wanted no deal. I really can't call it. Can anyone? …","name":"steve bullock","Sentiment":0.19},{"date":"2019-07-31T17:17:52+00:00","tweet":"i’ve had to look up steve bullock’s name five different times today","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T17:03:05+00:00","tweet":"🤪 Total votes received by candidates from red states in their last elections: Pete Buttigieg - - - - -8,515 (2015) Julián Castro - - - - 29,454 (2013) Tim Ryan - - - - - - 149,271 (2018) Steve Bullock - - - 255,933 (2016) Beto O’Rourke - 4,045,632 (2018)","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T15:30:14+00:00","tweet":"The most searched for Democratic candidate in Montana during last night’s debate was Steve Bullock Apparently, a lot of people in Montana don’t know who their own Governor is","name":"steve bullock","Sentiment":0.2875},{"date":"2019-07-31T13:53:15+00:00","tweet":"Elizabeth Warren and Steve Bullock got into a brief and very superficial debate over “first use” of nuclear weapons. Here’s what’s really at stake.","name":"steve bullock","Sentiment":0.1625},{"date":"2019-07-31T12:43:07+00:00","tweet":"Politicians like Steve Bullock might want to leave climate change to scientists, but dealing with it is an inherently political task, writes @yayitsrob:","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T11:21:41+00:00","tweet":"Steve Bullock Victorious* * = in court today …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T08:57:00+00:00","tweet":"Johnson has said he will not even discuss Brexit with EU27 leaders unless they agree in advance to abandoning the Backstop \/\/Steve Bullock …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T08:08:07+00:00","tweet":"Gov. Steve Bullock: \"Under the Trump administration, what they did with dark money, literally a Russian could give to the NRA ... nobody in this country would even know where that money came from, so I filed suit, and we just heard today that we won\"","name":"steve bullock","Sentiment":-0.075},{"date":"2019-07-31T07:24:04+00:00","tweet":"NPR's Asma Khalid and Domenico Montanaro checked in from Detroit after last night's debate with some key takeaways: ️Bernie Sanders and Elizabeth Warren had each others' backs ️Moderate candidates like Steve Bullock came out swinging More","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-07-30T23:58:06+00:00","tweet":"Steve Bullock to Bernie Sanders on combating climate change: \"Let's not just talk about plans that are written for press releases that will go nowhere else if we can't even get a Republican to acknowledge that the climate is changing.\" #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T23:52:33+00:00","tweet":"steve bullock is onstage talking about “as the governor of montana” while people in montana are at home firing up the google search engine like “nah, that can’t be right”","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-07-30T23:30:59+00:00","tweet":"Moments before Montana Gov. Steve Bullock joined the debate, his team delivered news about a victory back home: The governor just won a year-long lawsuit against the Trump administration.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T23:27:16+00:00","tweet":"Gov. Steve Bullock: \"Under the Trump administration, what they did with dark money, literally a Russian could give to the NRA ... nobody in this country would even know where that money came from, so I filed suit, and we just heard today that we won\"","name":"steve bullock","Sentiment":-0.075},{"date":"2019-07-30T23:03:41+00:00","tweet":"\"I won in Montana!\" - Montana Governor Steve Bullock The people of Montana - Who is Steve Bullock? …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:56:43+00:00","tweet":"lol at steve bullock getting the most hits from the state where he is literally the sitting governor \"huh, he mentioned montana, who's this bullock dude\"","name":"steve bullock","Sentiment":0.65},{"date":"2019-07-30T22:50:38+00:00","tweet":"The big winner: Bernie Sanders Second winner: Elizabeth Warren Big surprise: Marianne Williamson Did alright: Pete Buttigieg, Beto O'Rourke Losers: Emy Klobuchar, Steve Bullock, Tim Ryan Big ass losers: John Delaney, John Hickenlooper #DemDebate #DemocraticDebate","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2019-07-30T22:43:06+00:00","tweet":"#DemocraticDebate Night 1 Rankings (based on my perception of their performance, not policy): 1. Bernie Sanders 2. Elizabeth Warren 3. Pete Buttigieg 4. Marianne Williamson 5. Beto O’Rourke 6. Steve Bullock 7. Amy Klobuchar 8. John Hickenlooper 9. John Delaney 10. Tim Ryan","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:41:04+00:00","tweet":"CNN did the country a disservice by giving so much time to John Delaney and Steve Bullock tonight. They are barely cracking 0% but were treated like the moderate challengers to Bernie Sanders and Elizabeth Warren. #DemDebate","name":"steve bullock","Sentiment":0.0833333333},{"date":"2019-07-30T22:32:23+00:00","tweet":"Steve Bullock is running for President like a try-hard stepfather who got caught drinking again","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:30:10+00:00","tweet":"is Steve Bullock related to the historical Seth Bullock? could be possible. literally the only notable thing about him besides how he drank mouthwash to calm his nerves before he came out tonight","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-07-30T22:29:57+00:00","tweet":"Replay of Steve Bullock going against Elizabeth Warren discussing the use of nuclear weapons.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:27:41+00:00","tweet":"Steve Bullock trying to make a splash","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:27:04+00:00","tweet":"Pete Buttigieg and Steve Bullock spoke in stark terms about how the epidemic of gun violence had affected their own lives during the #DemDebate","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-30T22:26:31+00:00","tweet":"Does Steve Bullock realize just how insane the idea of retaining first-strike capability is? How much of a joke that is among foreign policy experts? There's a difference between \"strength\" and being illiterate on foreign policy. Bullock is an absolute tool.","name":"steve bullock","Sentiment":-0.17},{"date":"2019-07-30T22:25:41+00:00","tweet":"Steve Bullock speaks about nuclear weapons with the conviction of a man who regularly beats off to Red Dawn","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:23:53+00:00","tweet":"Did Jake Tapper take issue with Elizabeth Warren saying she'd never use a nuclear weapon unless another country used it first? Did we ... hear that correctly? Yes, yes we did. And Steve Bullock does not agree with her, GO THE FUCK AWAY, STEVE BULLOCK. Montana is THAT-A-WAY.","name":"steve bullock","Sentiment":-0.075},{"date":"2019-07-30T22:23:23+00:00","tweet":"Um Steve Bullock, if you’re still saying “nucular,” you shouldn’t be using anything “nuclear.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:03:14+00:00","tweet":"FACT-CHECK: At Tuesday's #DemDebate Montana Governor Steve Bullock said free health care for illegal aliens would create additional incentives for people to cross the border illegally. VERDICT: True.","name":"steve bullock","Sentiment":-0.05},{"date":"2019-07-30T21:33:58+00:00","tweet":"Bernie looks at Steve Bullock like a person looks at their dog after they just shit on the carpet. #DemDebate","name":"steve bullock","Sentiment":-0.2},{"date":"2019-07-30T21:33:45+00:00","tweet":"What ... what is going on with Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T21:33:23+00:00","tweet":"Steve Bullock wants to know what it's going to take to get you in a car today.","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-30T21:29:07+00:00","tweet":"Tim Ryan, John Delaney, Amy Klobuchar, Beto O'Rourke, Steve Bullock, John Hickenlooper should drop out after this debate. Their participation is appreciated but they are simply not aligned with the current political moment #DemDebate","name":"steve bullock","Sentiment":0.05},{"date":"2019-07-30T21:19:43+00:00","tweet":"Steve Bullock is helping Trump and Mitch McConnell by wasting his time on a doomed presidential bid instead of running for the winnable Senate seat in Montana.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T21:17:13+00:00","tweet":"\"Wish list economics\" is a weird way for Steve Bullock to describe equitable access to health care, education, and a better future for everyone. #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T21:16:26+00:00","tweet":"“Gosh you people up here are all really crazy!” - Steve Bullock","name":"steve bullock","Sentiment":-0.75},{"date":"2019-07-30T21:09:03+00:00","tweet":"Steve Bullock is not my real dad can he stop talking like that","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-30T21:08:55+00:00","tweet":"Marianne Williamson just proposed federally funding elections Pete Buttigieg called for an amendment to overturn Citizens United Steve Bullock called out #DarkMoney the money-in-politics talk is real in the #DemDebate","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-30T21:08:51+00:00","tweet":"So far Bernie is absolutely dominating, but the centrists polling at 0% are getting too much damn time. They shouldn't be calling on Steve Bullock more than they're calling on Elizabeth Warren. #DemDebate2","name":"steve bullock","Sentiment":0.25},{"date":"2019-07-30T21:07:24+00:00","tweet":"Gov. Steve Bullock: \"The biggest problem we have right now is Donald Trump.\" #DemDebate #DemocraticDebate","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-07-30T21:07:24+00:00","tweet":"Steve Bullock wasn’t on the stage last time. This is his shot. An unusual voice. Is he impressing people out there? Will the headlines tomorrow show any life for him?","name":"steve bullock","Sentiment":0.1},{"date":"2019-07-30T21:02:56+00:00","tweet":"John Delaney is using Republican talking points. Steve Bullock sounds extremely condescending. Tim Ryan seems angry at immigrants. Marianne Williamson is floating in a bubble. Let’s cancel these please. Thanks.","name":"steve bullock","Sentiment":-0.1416666667},{"date":"2019-07-30T21:02:22+00:00","tweet":"\"I'm a gun owner. I hunt. [And I'm not going to win the Democratic nomination for president.]\" —Steve Bullock #DemDebate #DemocraticDebate","name":"steve bullock","Sentiment":0.8},{"date":"2019-07-30T20:58:45+00:00","tweet":"Steve Bullock: “Great debate tonight Elizabeth! See you next time!” Elizabeth Warren:","name":"steve bullock","Sentiment":0.5},{"date":"2019-07-30T20:57:08+00:00","tweet":"People like Tim Ryan and Steve Bullock and John Hickenlooper - centrist white dude Democrats - have spent their careers saying “no” to people fighting for justice and human rights. And now they have ridiculous amounts of airtime to try and tell us why people must suffer.","name":"steve bullock","Sentiment":-0.1083333333},{"date":"2019-07-30T20:56:26+00:00","tweet":"Steve Bullock’s vibe is extremely “has the second-best performing Chevy dealership in the state”","name":"steve bullock","Sentiment":-0.125},{"date":"2019-07-30T20:55:48+00:00","tweet":"Steve Bullock has big “mom’s asshole boyfriend in the kids’ movie” energy","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:55:17+00:00","tweet":"\"We need to fix the crisis at the border\" Elizabeth Warren says and then blames Donald Trump for creating the crisis. Steve Bullock says that she is wrong, she is playing into Trumps hands, and then blames Trump again for immigration issues lol. None of this makes any sense","name":"steve bullock","Sentiment":0.15},{"date":"2019-07-30T20:55:05+00:00","tweet":"Steve Bullock is giving me real Jed vibes","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-30T20:54:10+00:00","tweet":"Steve bullock does not spark joy in me. That’s the tweet. #DemocraticDebate","name":"steve bullock","Sentiment":0.8},{"date":"2019-07-30T20:53:58+00:00","tweet":"Steve Bullock just called out the people on the debate stage wanting to decriminalize illegal immigration which made a lot of sense but then he blamed Donald Trump for causing the immigration crisis and completely destroyed whatever point he tried to make lol.","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-07-30T20:53:17+00:00","tweet":"Steve Bullock doesn't think undocumented people should have healthcare? So they bleed out and die if they're in an accident? This is a grotesque, morally reprehensible position to take. #DemDebate2","name":"steve bullock","Sentiment":-0.275},{"date":"2019-07-30T20:52:59+00:00","tweet":"Perhaps Steve Bullock should run as a Republican.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:52:55+00:00","tweet":"Steve Bullock having a very strong debut debate.","name":"steve bullock","Sentiment":0.5633333333},{"date":"2019-07-30T20:52:45+00:00","tweet":"I cannot stress this enough, who the fuck is Steve Bullock","name":"steve bullock","Sentiment":-0.2},{"date":"2019-07-30T20:48:59+00:00","tweet":"I like how Steve Bullock gave an anecdote about how his son survived a heart attack because he had \"good insurance\" and accidentally made an argument for Medicare for All","name":"steve bullock","Sentiment":0.7},{"date":"2019-07-30T20:35:14+00:00","tweet":"Why are we wasting time listening to Beto and Steve Bullock? The people want Marianne! #DemDebate #DemocraticDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:34:15+00:00","tweet":"Steve Bullock looks like a greedy real estate developer trying to tear down the local community center in an Air Bud movie #DemDebate","name":"steve bullock","Sentiment":-0.0138888889},{"date":"2019-07-30T20:33:41+00:00","tweet":"Steve Bullock... y'all are just making up people","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:33:20+00:00","tweet":"Steve Bullock literally just said \"my 12 year old son had a heart attack but because we have good insurance he lived\" as an argument against Medicare for all. Literally admitting on stage that he thinks poor kids should just die.","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-07-30T20:32:09+00:00","tweet":"Steve Bullock and John Delaney are just handing Donald Trump his 2020 talking points. Polls say no one wants them up there. Get them off the stage. #DemDebate","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-30T20:31:44+00:00","tweet":"congrats on being rich so your kid didn't die like poor people do, steve bullock","name":"steve bullock","Sentiment":-0.0125},{"date":"2019-07-30T20:26:44+00:00","tweet":"Steve Bullock, tim ryan, the other guy, and the other Steve Bullock should all switch places right now that would be funny","name":"steve bullock","Sentiment":0.0714285714},{"date":"2019-07-30T20:18:59+00:00","tweet":"\"Am I not Steve Bullock? I thought I was Steve Bullock.\" - Tim Ryan","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:17:39+00:00","tweet":"It is 2019 and we are all fully inside the orb because Marianne Williamson just gave a smoother and less wooden opening statement than Montana Gov. Steve Bullock.","name":"steve bullock","Sentiment":-0.0833333333},{"date":"2019-07-30T20:17:03+00:00","tweet":"Steve Bullock and Marianne Williamson are two of the most convincing androids I’ve ever seen. Go science!","name":"steve bullock","Sentiment":0.5625},{"date":"2019-07-30T20:16:24+00:00","tweet":"Who the fuck is Steve Bullock and why wasn't Mike Gravel allowed in his place? I've never heard of Steve Bullock! #DemDebate","name":"steve bullock","Sentiment":-0.5},{"date":"2019-07-30T20:16:22+00:00","tweet":"1 I refuse to remember who Steve Bullock is or ever tweet about him again. 2 Awesome opening statement from my #2 Marianne!","name":"steve bullock","Sentiment":1.0},{"date":"2019-07-30T20:16:10+00:00","tweet":"I’m Steve Bullock. I’m a pro-choice, pro-union, populist Democrat who’s won three elections in a red state. I didn’t do it by compromising our values. I did it by getting stuff done. #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:15:37+00:00","tweet":"I'm pretty sure Steve Bullock is only here to convince you of the amazing absorbency of ShamWow!","name":"steve bullock","Sentiment":0.375},{"date":"2019-07-30T20:15:14+00:00","tweet":"Steve Bullock should of opened up with \"if your going to call on me, call me either Stephen A or Mr. Smith\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:15:06+00:00","tweet":"Finally Steve Bullock answers the question on every American's mind to night: Who the hell is Steve Bullock? #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:14:57+00:00","tweet":"#DemDebate Meet abortion extremist Steve Bullock! …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:14:52+00:00","tweet":"Steve Bullock: I am a moderate. Look at my moderate tie. My moderate jacket. My moderate hair. My moderate tone. My moderate opening statement. Moderates like me. I love moderation so much that I don't even love this statement. I only like it...moderately. #DemDebate","name":"steve bullock","Sentiment":0.12},{"date":"2019-07-30T20:14:44+00:00","tweet":"We would tweet a Jacobin article about Steve Bullock right now but there is none, because who is Steve Bullock????","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-07-30T20:14:33+00:00","tweet":"Steve Bullock’s question of the night: who the hell is Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:14:32+00:00","tweet":"What’s a Steve Bullock?","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T20:12:13+00:00","tweet":"NEW: Moments before Montana Gov. Steve Bullock joined the debate, his team delivered news about a victory back home: The governor just won a year-long lawsuit against the Trump administration.","name":"steve bullock","Sentiment":0.0681818182},{"date":"2019-07-30T20:07:24+00:00","tweet":"Good luck to Steve Bullock! #DemDebate","name":"steve bullock","Sentiment":0.875},{"date":"2019-07-30T20:06:46+00:00","tweet":"I think Steve Bullock would be an EXCELLENT candidate to help fire Mitch McConnell as Senate Majority Leader by flipping the Montana Senate seat up next year in a red state Dems carried in 2018.","name":"steve bullock","Sentiment":0.3333333333},{"date":"2019-07-30T20:04:16+00:00","tweet":"if steve bullock is allowed to debate i don’t see why i shouldn’t be allowed to debate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T19:45:57+00:00","tweet":"I’m thinking a lot of folks will go through this tonight at the #DemDebate 1. “Who is Steve Bullock?” 2. “I like what he has to say.” 3. {Googles} Steve Bullock 4. “Wow, a progressive in a red state.” 5. “Actually gets things done.” 6. “I love Steve Bullock.” 7. {Donates}","name":"steve bullock","Sentiment":0.15},{"date":"2019-07-30T15:05:08+00:00","tweet":"Here's who'll be onstage at tonight's Democratic debate: Marianne Williamson Tim Ryan Amy Klobuchar Pete Buttigieg Bernie Sanders Elizabeth Warren Beto O'Rourke John Hickenlooper John Delaney Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T12:29:34+00:00","tweet":"Steve Bullock's fun fact: he was a cast member of \"Newsies\"","name":"steve bullock","Sentiment":0.3},{"date":"2019-07-29T11:24:06+00:00","tweet":"Democrats on Capitol Hill have a message for presidential hopefuls John Hickenlooper, the former governor of Colorado, and Steve Bullock, the current governor of Montana: You'd make great senators","name":"steve bullock","Sentiment":0.2666666667},{"date":"2019-07-28T17:17:57+00:00","tweet":"If only there was some way Steve Bullock could use this ability rather than wasting it on a hopeless vanity campaign for president","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-26T18:28:22+00:00","tweet":"Four Dem Candidates Accept Campaign Donations from Foreign Lobbyists. Gov. Steve Bullock of Montana, former Colorado governor John Hickenlooper, former representative John Delaney of Maryland, and Gov. Jay Inslee of Washington. #Democrats2020 #Inslee2020 …","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-07-20T22:02:05+00:00","tweet":"(whispers) \"I heard that if you stare into a mirror in a candle-lit room and say 'Steve Bullock' three times, Steve Bullock appears and still polls at less than 1%.\"","name":"steve bullock","Sentiment":-0.1666666667},{"date":"2019-07-08T17:34:24+00:00","tweet":"Steve Bullock Joe Sestak Wayne Messam Mike Gravel Seth Moulton Tim Ryan Michael Bennet Andrew Yang John Hickenlooper Jay Inslee IN CASE YOU WERE KEEPING SCORE here's a list of Democrat candidates running for President in 2020 that outlasted Rep. Eric Swalwell","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-08T12:46:23+00:00","tweet":"Steve Bullock, who opposes #MedicareForAll but supports a public option, is doing a fundraiser with a Forbes Tate lobbyist who works for @P4AHCF, a dark money group created to kill momentum for Medicare for All or even a public option …","name":"steve bullock","Sentiment":-0.05},{"date":"2019-07-08T11:15:05+00:00","tweet":"Steve Bullock hates \"dark money,\" but a dark money lobbyist is helping his presidential campaign","name":"steve bullock","Sentiment":-0.15},{"date":"2019-07-07T17:29:02+00:00","tweet":"Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-06T11:04:06+00:00","tweet":"If I am not contacted, I hope Ndn country will continue to press this issue with Harris, & tribal sovereignty issues with all the presidential candidates wherever they go. Shout out to Avery Old Coyote who did this with Steve Bullock on Keystone XL. …","name":"steve bullock","Sentiment":0.1},{"date":"2019-07-05T19:08:11+00:00","tweet":"Montana Governor Steve Bullock: \"Come to Glacier Park soon because the glaciers will be gone.\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-05T13:34:40+00:00","tweet":"Any room for Marine Corps combat veteran and member of Congress Seth Moulton or two term governor of red state Montana Steve Bullock? …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-02T21:46:44+00:00","tweet":"With the update that the DNC will count the figures from Suffolk\/USA Today that are rounded to the nearest whole number, Steve Bullock gains an edge on Eric Swalwell in the tiebreaker for the last spot in the 2nd #DemDebates. …","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-07-02T15:54:04+00:00","tweet":"WATCH: Democrat Steve Bullock says his party often treats blue collar American coal workers as “villains.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-02T14:36:08+00:00","tweet":"People love to dunk on Schumer’s judgment, but “Steve Bullock and Beto O’Rourke have better chances of becoming senators than becoming president” was a strong take …","name":"steve bullock","Sentiment":0.4666666667},{"date":"2019-07-02T01:08:42+00:00","tweet":"Marianne’s listed policies from her website are pro-tribal sovereignty. Steve Bullock and Jay Inslee seem to have pretty good records with tribes.","name":"steve bullock","Sentiment":0.475},{"date":"2019-06-30T10:50:01+00:00","tweet":"Tim Ryan: \"The attack on @KamalaHarris is racist\" Steve Bullock \"The ugly, racist attacks against @KamalaHarris represent the worst of us\" Kirsten Gillibrand: \"We need a president who will take on the biggest fights we face—even if she stands alone.\"","name":"steve bullock","Sentiment":-0.85},{"date":"2019-06-28T00:01:39+00:00","tweet":"The Late Show's All Governor Steve Bullock Debate: No Bull, All Bullock. @GovernorBullock #DemDebate2 #LateShowLIVE","name":"steve bullock","Sentiment":-0.3},{"date":"2019-06-27T22:50:27+00:00","tweet":"I'm Steve Bullock and I still approve this message: #DemDebate2","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-27T21:02:42+00:00","tweet":"Steve Bullock passed on the Montana Senate race to not qualify for the Democratic presidential debates.","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-26T21:21:05+00:00","tweet":"Steve Bullock Leads Pack Of Shut-Out Democratic Candidates To Storm Debate Stage #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-26T12:30:05+00:00","tweet":"Media coverage the next morning: \"Jay Inslee claims he is Steve Bullock. But Steve Bullock also claims he is Steve Bullock. Who is right?\"","name":"steve bullock","Sentiment":0.1428571429},{"date":"2019-06-24T15:22:06+00:00","tweet":"Gov Bullock, are you ready for civil war? Ready to challenge the Constitution? Then shut up & sit down‼️️ Montana Gov. Steve Bullock: Time to View Guns as a ‘Public Health Issue’ via @BreitbartNews","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-06-23T13:24:08+00:00","tweet":"List of candidates who should drop out: 1. Tulsi Gabbard 2. Marianne Williamson 3. Pete Buttigieg 4. Bernie Sanders 5. Andrew Yang 6. Michael Bennett 7. Steve Bullock 8. John Delaney 9. Bill de Blasio 10. John Hickenlooper 11. Jay Inslee 12. Wayne Messam 13. Eric Swalwell","name":"steve bullock","Sentiment":0.0},{"date":"2019-06-21T01:51:45+00:00","tweet":"Still not Steve Bullock. Apparently the NYT has no idea what he looks like?","name":"steve bullock","Sentiment":0.05},{"date":"2019-09-05T10:17:22+00:00","tweet":"To pass climate legislation, Dems need to win the Senate. To win the Senate, Dems need 3 more seats. Steve Bullock is the only Dem who can beat Montana’s incumbent Republican senator. Therefore, Steve Bullock is the most important person on the planet. …","name":"steve bullock","Sentiment":0.5},{"date":"2019-09-02T05:00:08+00:00","tweet":"Do Stacey Abrams and Steve Bullock want to make Mitch McConnell president?","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-01T18:26:59+00:00","tweet":"Isn’t it a vanity play for Beto O’Rourke and Steve Bullock to keep running for President when if they ran for Senate in Texas and Montana and won, Dems would take the Senate. That would be true service to the country.","name":"steve bullock","Sentiment":0.35},{"date":"2019-08-31T14:17:46+00:00","tweet":"Stacey Abrams, Steve Bullock, Beto O’Rourke: Stand up and be counted. Run for the Senate. This is an all-hands-on-deck moment for American democracy - by ⁦@Milbank⁩ - The Washington Post …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-31T08:28:50+00:00","tweet":"Why are the following still in the Democratic race for president? Tulsi Gabbard Marianne Williamson John DeLaney Tim Ryan Michael Bennett Tom Steyer Steve Bullock Bill DeBlasio Michael Bennett Drop out. #DemPresidentialCandidates","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-31T00:34:38+00:00","tweet":"Opinion: Stacy Abrams, Steve Bullock and Beto O’Rourke — you’re needed in the Senate","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-30T19:32:22+00:00","tweet":"The stakes are really high here, and...Stacey Abrams, Steve Bullock, Beto O’Rourke — the three could make all the difference in the Democrats’ uphill quest to take the Senate next year, Dana @Milbank writes. Via @PostOpinions","name":"steve bullock","Sentiment":0.08},{"date":"2019-08-29T15:43:14+00:00","tweet":"Tulsi Gabbard, Michael Bennet, Steve Bullock and some of their supporters (especially Tulsi's) complain that Democratic debate qualifications are somehow unfair. But it's not a conspiracy. Voters have had a look--they're just not that into them. My latest …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-28T10:21:16+00:00","tweet":"Not on the debate stage due to lack of support. Exit gracefully and asap. Tom Steyer Tulsi Gabbard Marianne Williamson Kirsten Gillibrand Michael Bennet Steve Bullock Bill de Blasio John Delaney Tim Ryan Joe Sestak","name":"steve bullock","Sentiment":-0.125},{"date":"2019-08-27T13:01:00+00:00","tweet":"Gov. Steve Bullock: \"Recognize that the greatest stride that we made since Medicaid and Medicare was Obamacare. I want to build on that, not start all over. And I think you could do that with a public option.\"","name":"steve bullock","Sentiment":0.5},{"date":"2019-08-26T09:00:24+00:00","tweet":"2 Democrats Running for president Who Could Win a Senate Seat in 2020 Beto O’Rourke Could Beat GOP Sen. John Cornyn in Texas Gov. Steve Bullock Could Beat GOP Sen. Steve Daines In Montana","name":"steve bullock","Sentiment":0.8},{"date":"2019-08-25T19:15:00+00:00","tweet":"“That is an absolute no.” Montana Gov. Steve Bullock says he won’t run for Senate if he doesn’t win the Democratic nomination for president. #CNNTownHall","name":"steve bullock","Sentiment":0.5},{"date":"2019-08-25T19:10:25+00:00","tweet":"\"I'm a single issue voter this time. And that's making sure that Donald Trump is not re-elected...\" - Montana Gov. Steve Bullock on whether electability is more important than policy positions in choosing a presidential candidate #CNNTownHall","name":"steve bullock","Sentiment":0.3321428571},{"date":"2019-08-25T18:51:04+00:00","tweet":"Steve Bullock: We can be carbon neutral “by 2040 or even earlier”","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-25T18:39:54+00:00","tweet":"“The scientists say we have to be net zero, carbon neutral effectively, as a world, by 2050. I think we can do it by 2040 or even earlier,” says presidential candidate Steve Bullock on how he would take on the climate crisis. #CNNTownHall","name":"steve bullock","Sentiment":0.2},{"date":"2019-08-25T18:33:00+00:00","tweet":"“When I was growing up, the NRA used to be just a gun safety and hunting organization,\" says Montana Gov. Steve Bullock. \"Now it’s a dark money field, political organization, that does nothing more than drive us apart.” #CNNTownHall","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-08-25T18:26:03+00:00","tweet":"Steve Bullock blames the NRA for the lack of action on guns #CNNTownHall","name":"steve bullock","Sentiment":0.1},{"date":"2019-08-22T01:15:07+00:00","tweet":"Wilmot Collins is a nice guy but he's not Steve Bullock. Bullock would have what, a 30% chance of winning against Daines? Sometimes a 30% chance happens. Steve Bullock is more interested in stroking than helping this country.","name":"steve bullock","Sentiment":0.4625},{"date":"2019-09-07T15:09:41+00:00","tweet":"Governor Steve Bullock just referenced how this current generation has less chance to be better economically than the last. I believe Yang mentions all the time. #TrumpFearsYang @AndrewYang #YangGang","name":"steve bullock","Sentiment":0.1266666667},{"date":"2019-09-06T19:53:03+00:00","tweet":"Live now on @MSNBC: 2020 candidate Gov. Steve Bullock on his plan to revitalize rural America","name":"steve bullock","Sentiment":0.0681818182},{"date":"2019-09-06T18:05:04+00:00","tweet":"from Redoubt News -> RedoubtNews -=>> Lawsuit Filed Against Montana Governor Steve Bullock: Lawsuit Filed Against Montana Governor Steve Bullock By Tim Ravndal In 2018, Montana Governor Steve Bullock used his… #Constitution #Featured ~RedoubtNews","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-06T08:39:27+00:00","tweet":"Steve Bullock’s campaign would like you to know that he did a swear too.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-04T09:33:31+00:00","tweet":"\"Life isn't easy these days for bottom-tier Democratic presidential candidates. Not many people know who they are. Fewer come to their events\" \"On Saturday, an Iowa Democrat approached a WSJ reporter and asked if he was Gov. Steve Bullock of Montana\" …","name":"steve bullock","Sentiment":0.0916666667},{"date":"2019-09-02T16:01:18+00:00","tweet":"BREAKING: Democratic Presidential Candidate Steve Bullock takes photos with every single campaign supporter. Total time less than 3 minutes. …","name":"steve bullock","Sentiment":-0.0793650794},{"date":"2019-08-29T12:16:38+00:00","tweet":"I am hosting two public climate conversations this weekend: 1. Steve Bullock, Saturday, August 31, 3 pm, Red Oak Pavilion, Bever Park, SE Cedar Rapids. 2. Amy Klobuchar, Sunday, September 1, 5:30 pm, Ramada by Wyndham, 525 33rd Ave. SW, Cedar Rapids. #iacaucus","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-28T12:09:50+00:00","tweet":"Never trust a “moderate Democrat.” They are the moral equivalent of a “freedom-loving Communist.” Gov. Steve Bullock is just one more RAM “Radical Acting Moderate,” but a new lawsuit is challenging his attack on free speech in Montana. …","name":"steve bullock","Sentiment":0.1920454545},{"date":"2019-08-28T11:29:09+00:00","tweet":"Tom Steyer Tulsi Gabbard Marianne Williamson Kirsten Gillibrand Michael Bennet Steve Bullock Bill de Blasio John Delaney Tim Ryan Joe Sestak None have qualified for the next debate. It's time for them to exit quietly and keep a little self-respect.","name":"steve bullock","Sentiment":-0.0625},{"date":"2019-08-28T08:47:48+00:00","tweet":".@JohnAvlon analyzes whether the 2020 candidates are as popular in their home states as they are in the national headlines. In recent in-state polls, \"only Amy Klobuchar, Steve Bullock and Cory Booker are at or above 50% among their home state voters.\" #RealityCheck","name":"steve bullock","Sentiment":0.15},{"date":"2019-08-26T16:57:11+00:00","tweet":"\"Overall, the combined town hall events (Steve Bullock at 6 p.m., followed by Bill de Blasio at 7 p.m.) dragged CNN's ratings down 25% from the network's average Sunday night rating.\" Bill De Blasio's CNN Town Hall Draws Just 376,000 Viewers Sunday Night …","name":"steve bullock","Sentiment":-0.1018518519},{"date":"2019-08-25T18:28:25+00:00","tweet":"Montana Gov. Steve Bullock explains his support for the death penalty in “very, very limited” cases, a view that is out of step with many of his 2020 Democratic opponents","name":"steve bullock","Sentiment":0.2035714286},{"date":"2019-08-25T18:21:02+00:00","tweet":"Here's where Democrat presidential candidate Steve Bullock stands on key issues","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-25T17:50:06+00:00","tweet":"Democratic presidential hopefuls Steve Bullock and Bill de Blasio take questions from voters in New York City in back to back CNN town halls. Follow along for live updates","name":"steve bullock","Sentiment":0.0681818182},{"date":"2019-08-23T15:15:31+00:00","tweet":"Noteworthy: Beto O’Rourke, Julian Castro, Tom Steyer and Steve Bullock are among the candidates who hired women campaign managers this cycle.","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-23T11:20:11+00:00","tweet":"On the bright side, Steve Bullock is still running","name":"steve bullock","Sentiment":0.7},{"date":"2019-08-23T08:57:37+00:00","tweet":"David Koch is a BIG reason for the point 2020 Democratic presidential candidate Steve Bullock made on my @SXMProgress show last night: “The Republican party is literally the only political party in the world that doesn’t acknowledge that climate change is real.” …","name":"steve bullock","Sentiment":0.04},{"date":"2019-08-22T16:01:29+00:00","tweet":"me: I like Steve Bullock because he’s a rural Democrat who won in 2016 & said on the debate stage that he’s “pro-choice and pro-union” Democrat Y’all: I agree w Danika, Steve Bullock is a hot midwestern Dad isn’t he","name":"steve bullock","Sentiment":0.125},{"date":"2019-08-22T01:08:21+00:00","tweet":"Steve Bullock is not going to be President. Can I guarantee that he would beat Daines? No, but Bullock would be a serious candidate. He alone can that race into contention.","name":"steve bullock","Sentiment":-0.3333333333},{"date":"2019-08-20T09:02:06+00:00","tweet":"Met a random guy in New Jersey yesterday wearing a Steve Bullock t-shirt. Very likely the only guy in New Jersey with a Steve Bullock t-shirt. In that sense, I was impressed","name":"steve bullock","Sentiment":0.1287878788},{"date":"2019-08-18T20:52:18+00:00","tweet":"Real change after 2020 depends on who controls the U.S. Senate. Why decisions by John Hickenlooper and Steve Bullock matter. My column …","name":"steve bullock","Sentiment":0.2},{"date":"2019-08-18T19:43:08+00:00","tweet":"Dear Americans - have you seen this - Is this true? @DanaPerino ask Steve Bullock what he thinks - ask all the Progressive candidates- ask the Squad","name":"steve bullock","Sentiment":0.35},{"date":"2019-08-18T11:09:57+00:00","tweet":"Bernie Sanders, Elizabeth Warren, Amy Klobuchar, Marianne Williamson, Gov. Steve Bullock, John Delaney, Bill de Blasio, Mark Charles & Julián Castro will all participate. These candidates seem to be taking working with Native communities seriously. The others? I don’t know.","name":"steve bullock","Sentiment":-0.3333333333},{"date":"2019-08-18T10:53:33+00:00","tweet":"Salute to Bernie Sanders, Elizabeth Warren, Amy Klobuchar, Marianne Williamson, Gov. Steve Bullock, John Delaney, Bill de Blasio, Mark Charles & Julián Castro who will all participate in the Frank LaMere Native American Presidential Forum on August 19-20 in Sioux City Iowa.","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-18T09:53:50+00:00","tweet":"Gov Steve Bullock (D-MT) @GovernorBullock talks to Dana about immigration \"I served with Ken Cuccinelli when he was Attorney General, Putting him in charge of immigration would be like putting Putin in charge of election security\"","name":"steve bullock","Sentiment":0.05},{"date":"2019-08-17T13:03:00+00:00","tweet":"Twitter, meet Steve Bullock from Alabama! He’s a big fan of the Steve Bullock from Montana. Want your own Bullock 2020 gear? Check out what we’ve got in the store:","name":"steve bullock","Sentiment":0.3},{"date":"2019-08-16T19:25:41+00:00","tweet":"Sure, beating GOP Sen. Steve Daines in a state Trump won by 20% would be hard even for a great Democratic candidate like Steve Bullock. But Montana just re-elected its Democratic senator last year, & there's always a chance things could fall into place for a Dem upset win in 2020","name":"steve bullock","Sentiment":0.3616666667},{"date":"2019-08-16T19:20:18+00:00","tweet":"I get it: Montana would be tough to win even with Gov. Steve Bullock in the race. But he has zero shot at the presidential or VP nomination, & no other Dem could even make #MTsen competitive. Senate Dems need their best possible candidates in every race …","name":"steve bullock","Sentiment":0.2947222222},{"date":"2019-08-16T17:56:35+00:00","tweet":"Should some Democratic candidates start thinking about leaving the race? @adrienneelrod says: \"At some point you've got to winnow the field ... If Steve Bullock does not make that third debate stage in a couple of weeks\" he should consider running for Senate #MTPDaily","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-16T12:00:07+00:00","tweet":"Steve Bullock's campaign has bought the website . This is the page that comes up:","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-16T10:01:22+00:00","tweet":"CNN will host town halls with Democratic presidential candidates Montana Gov. Steve Bullock and New York Mayor Bill de Blasio on August 25.","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-08-15T17:38:53+00:00","tweet":"1\/ @JRubinBlogger then flags two other current candidates she says should become candidates for the U.S. Senate: Julian Castro (TX) Steve Bullock (MT) And she notes a candidate who's dropped out who looks likely to also run—in her view wisely—for Senate: John Hickenlooper (CO)","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-08-14T22:20:31+00:00","tweet":"Democratic presidential candidate Steve Bullock on changing his position on universal background checks: \"I started looking at it as a public health issue\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-13T18:01:49+00:00","tweet":"And Steve Bullock can you please run for senate too? …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-13T12:11:08+00:00","tweet":"Steve Bullock is the first Dem I see smacking Steyer today: \"We’re kidding ourselves if we’re calling a $10 million purchase of 130,000 donors a demonstration of grassroots support.”","name":"steve bullock","Sentiment":0.25},{"date":"2019-08-13T12:00:21+00:00","tweet":"Steve Bullock responds to Tom Steyer making the debate stage","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-12T14:56:40+00:00","tweet":"Steve Bullock, father of three, looks at a grill loaded with meat and has to ask, “How do you know when they’re done?” If we can’t trust him to work a grill, how are we supposed to trust him to be president?","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-08T17:15:00+00:00","tweet":"Gov. Steve Bullock speaks at Iowa State Fair: \"For the sake of the country we're going to pass on to that next generation, we gather to make sure Donald Trump is a one-term president.\"","name":"steve bullock","Sentiment":0.4},{"date":"2019-08-08T16:50:10+00:00","tweet":"2020 Democrat: The Party Is Well On Our Way To Blowing This Election Dem candidate Steve Bullock (who?) 🤷‍️ said: “The fact is, we are well on our way to losing this election long before it ever really even is started.” Knock yourselves out morons‼️ …","name":"steve bullock","Sentiment":0.075},{"date":"2019-08-08T08:23:56+00:00","tweet":"Democrat presidential candidate Steve Bullock said what everyone already knows: “As I stood on that debate stage last week and then listened to that next night, I saw [Trump’s] reelection becoming more likely with each passing minute,” he said.","name":"steve bullock","Sentiment":0.19},{"date":"2019-08-07T19:13:00+00:00","tweet":"Presidential candidate Steve Bullock on gun legislation: “I think if we could ever look at this as a public health issue, not as a political issue, we could make a difference.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-07T16:43:11+00:00","tweet":"Steve Bullock: Trump reelection 'more likely with each passing minute' Actually not. This is a bad message for him.","name":"steve bullock","Sentiment":-0.05},{"date":"2019-08-07T12:41:29+00:00","tweet":"Steve Bullock cannot be the Democratic nominee for President for this opinion ALONE. We CANNOT have him picking Supreme Court justices, and this is why the media needs to actually press these candidates on the federal courts. IT'S AN ENTIRE BRANCH OF GOVERNMENT, FOLKS. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-07T10:08:28+00:00","tweet":"Steve Bullock on Trump this morning: The president of the United Stars gives aid and comfort to the enemies of democracy abroad and incites the enemies of decency at home","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-06T22:29:00+00:00","tweet":"max donors to any campaign invite public disclosure and scrutiny. why is a local politician calling these folks out any more dangerous than steve bullock calling out the koch bros? …","name":"steve bullock","Sentiment":-0.025},{"date":"2019-08-06T06:54:08+00:00","tweet":"\"At the time, it was the youngest school yard shooting in our country's history,\" says Steve Bullock, whose 11-year-old nephew was shot dead by a 10-year-old in 1994. \"Now if a 10-year-old shot and killed an 11-year-old, it probably wouldn't even make national news.\"","name":"steve bullock","Sentiment":-0.2},{"date":"2019-08-03T13:10:35+00:00","tweet":"Gov. Steve Bullock notes that he used to be a union lawyer, says Congress should pass card check and we should pursue sectoral bargaining in the U.S. \"There's been a collective attack on the right to organize.\" #AFSCMEForum","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-08-02T14:40:13+00:00","tweet":"Whoa. John Hickenlooper could be making the switch to #COSen for 2020 now that his path to the Democratic Presidential nomination has encountered some major obstacles. Now we just need Steve Bullock to do the same for #MTSen. …","name":"steve bullock","Sentiment":0.0041666667},{"date":"2019-08-02T14:36:46+00:00","tweet":"Montana Gov. Steve Bullock on the other hand, would undoubtedly be doing his party & country a solid by dropping his presidential bid & running for Senate against GOP Sen. Steve Daines #MTsen","name":"steve bullock","Sentiment":-0.0625},{"date":"2019-08-01T16:58:19+00:00","tweet":"Presidential candidate Gov. Steve Bullock on Pres. Trump’s China tariff: “It’s a tax that every American family is going to be paying for to the tune of thousands and thousands of dollars. This isn’t the way. You don’t conduct trade policy by tweet.”","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-01T11:50:56+00:00","tweet":"Big win for Steve Bullock. …","name":"steve bullock","Sentiment":0.4},{"date":"2019-08-01T02:39:37+00:00","tweet":"Respectfully, this is you Michael Bennet, Beto O'Rourke, and Steve Bullock …","name":"steve bullock","Sentiment":0.5},{"date":"2019-07-31T20:42:11+00:00","tweet":"you cannot convince me that michael bennett and steve bullock are different people","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T16:43:25+00:00","tweet":"Total votes received by candidates from red states in their last elections: Pete Buttigieg - - - - -8,515 (2015) Julián Castro - - - - 29,454 (2013) Tim Ryan - - - - - - 149,271 (2018) Steve Bullock - - - 255,933 (2016) Beto O’Rourke - 4,045,632 (2018) #DemDebate","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T10:33:02+00:00","tweet":"Moments before Tuesday night's Democratic debate in Detroit, Montana Gov. Steve Bullock delivered news about a victory back home: The governor just won a year-long lawsuit against the Trump administration.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-31T08:16:09+00:00","tweet":"There was a presidential debate last night in which Steve Bullock participated. There was, separately and simultaneously, important national politics-and-tax news in which Steve Bullock participated: …","name":"steve bullock","Sentiment":0.2},{"date":"2019-07-31T07:24:04+00:00","tweet":"NPR's Asma Khalid and Domenico Montanaro checked in from Detroit after last night's debate with some key takeaways: ️Bernie Sanders and Elizabeth Warren had each others' backs ️Moderate candidates like Steve Bullock came out swinging More","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-07-31T01:26:36+00:00","tweet":"Here are winners from the first night of CNN's #DemDebate | Analysis by @CillizzaCNN - Bernie Sanders - Steve Bullock - Pete Buttigieg - John Delaney - Elizabeth Warren","name":"steve bullock","Sentiment":0.25},{"date":"2019-07-31T00:42:38+00:00","tweet":"Elizabeth Warren and Bernie Sanders dominated. John Delaney and Steve Bullock emerged from obscurity. And Beto O'Rourke and Pete Buttigieg got lost in the scrum. Here's how debate night went:","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T23:52:33+00:00","tweet":"steve bullock is onstage talking about “as the governor of montana” while people in montana are at home firing up the google search engine like “nah, that can’t be right”","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-07-30T23:30:59+00:00","tweet":"Moments before Montana Gov. Steve Bullock joined the debate, his team delivered news about a victory back home: The governor just won a year-long lawsuit against the Trump administration.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T23:27:16+00:00","tweet":"Gov. Steve Bullock: \"Under the Trump administration, what they did with dark money, literally a Russian could give to the NRA ... nobody in this country would even know where that money came from, so I filed suit, and we just heard today that we won\"","name":"steve bullock","Sentiment":-0.075},{"date":"2019-07-30T23:03:41+00:00","tweet":"\"I won in Montana!\" - Montana Governor Steve Bullock The people of Montana - Who is Steve Bullock? …","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:56:43+00:00","tweet":"lol at steve bullock getting the most hits from the state where he is literally the sitting governor \"huh, he mentioned montana, who's this bullock dude\"","name":"steve bullock","Sentiment":0.65},{"date":"2019-07-30T22:53:34+00:00","tweet":"lmao yes John Delaney, who will go down in as being one of the most hilariously pathetic punching bags in debate history, had a \"pretty good night\". About the same as Sanders. But the real star? Steve Bullock. …","name":"steve bullock","Sentiment":0.1368055556},{"date":"2019-07-30T22:50:38+00:00","tweet":"The big winner: Bernie Sanders Second winner: Elizabeth Warren Big surprise: Marianne Williamson Did alright: Pete Buttigieg, Beto O'Rourke Losers: Emy Klobuchar, Steve Bullock, Tim Ryan Big ass losers: John Delaney, John Hickenlooper #DemDebate #DemocraticDebate","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2019-07-30T22:43:06+00:00","tweet":"#DemocraticDebate Night 1 Rankings (based on my perception of their performance, not policy): 1. Bernie Sanders 2. Elizabeth Warren 3. Pete Buttigieg 4. Marianne Williamson 5. Beto O’Rourke 6. Steve Bullock 7. Amy Klobuchar 8. John Hickenlooper 9. John Delaney 10. Tim Ryan","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:41:04+00:00","tweet":"CNN did the country a disservice by giving so much time to John Delaney and Steve Bullock tonight. They are barely cracking 0% but were treated like the moderate challengers to Bernie Sanders and Elizabeth Warren. #DemDebate","name":"steve bullock","Sentiment":0.0833333333},{"date":"2019-07-30T22:32:23+00:00","tweet":"Steve Bullock is running for President like a try-hard stepfather who got caught drinking again","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:29:57+00:00","tweet":"Replay of Steve Bullock going against Elizabeth Warren discussing the use of nuclear weapons.","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:26:31+00:00","tweet":"Does Steve Bullock realize just how insane the idea of retaining first-strike capability is? How much of a joke that is among foreign policy experts? There's a difference between \"strength\" and being illiterate on foreign policy. Bullock is an absolute tool.","name":"steve bullock","Sentiment":-0.17},{"date":"2019-07-30T22:25:41+00:00","tweet":"Steve Bullock speaks about nuclear weapons with the conviction of a man who regularly beats off to Red Dawn","name":"steve bullock","Sentiment":0.0},{"date":"2019-07-30T22:23:53+00:00","tweet":"Did Jake Tapper take issue with Elizabeth Warren saying she'd never use a nuclear weapon unless another country used it first? Did we ... hear that correctly? Yes, yes we did. And Steve Bullock does not agree with her, GO THE FUCK AWAY, STEVE BULLOCK. Montana is THAT-A-WAY.","name":"steve bullock","Sentiment":-0.075},{"date":"2019-07-30T22:23:51+00:00","tweet":"Steve Bullock literally can't grapple with what Elizabeth Warren just explained beautifully. He doesn't get it, and it shows how dense he is. #DemDebate2","name":"steve bullock","Sentiment":0.85},{"date":"2019-07-30T22:03:14+00:00","tweet":"FACT-CHECK: At Tuesday's #DemDebate Montana Governor Steve Bullock said free health care for illegal aliens would create additional incentives for people to cross the border illegally. VERDICT: True.","name":"steve bullock","Sentiment":-0.05},{"date":"2019-10-08T22:30:00+00:00","tweet":"“Democratic presidential candidate Steve Bullock, the governor of Montana, is proposing a rule that federal elected officials must spend half of their terms actually governing.” …","name":"steve bullock","Sentiment":-0.0833333333},{"date":"2019-10-08T20:00:34+00:00","tweet":"What if there were some other federal office Steve Bullock could run for? …","name":"steve bullock","Sentiment":-0.125},{"date":"2019-10-08T13:22:05+00:00","tweet":"NEW POLL: Trump trails Steve Bullock in Montana","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-10-06T01:21:00+00:00","tweet":"Steve Bullock: \"When spoke to the president of Ukraine, he said I want you to talk to my personal lawyer and the Attorney General.\"","name":"steve bullock","Sentiment":0.025},{"date":"2019-10-04T17:01:00+00:00","tweet":"Gov. Steve Bullock: \"The attorney general is not the president's lawyer, it's the people's lawyer.\"","name":"steve bullock","Sentiment":0.05},{"date":"2019-10-04T16:00:00+00:00","tweet":"2020 Democrats 3rd Quarter Fundraising (so far) Bernie Sanders $25M Elizabeth Warren $24.6M Pete Buttigieg $19M Joe Biden $15.2M Kamala Harris $11.6M Andrew Yang $10M Cory Booker $6M Marianne Williamson $3M Steve Bullock $2.3M Michael Bennet $2.1M","name":"steve bullock","Sentiment":0.05},{"date":"2019-10-03T17:18:12+00:00","tweet":"Michael Bennet - lawyer Joe Biden - lawyer Cory Booker - lawyer Steve Bullock - lawyer John Delaney - lawyer Kirsten Gillibrand - lawyer Kamala Harris - lawyer Amy Klobuchar - lawyer Tim Ryan - lawyer Bernie Sanders - not a lawyer Elizabeth Warren - lawyer Andrew Yang - lawyer","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-30T09:26:00+00:00","tweet":"Montana Gov. Steve Bullock declared a \"winter storm emergency\" on Sunday after the state was struck by more than 3 feet of heavy, wet snow; storm watches and warnings were posted across the region","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-09-29T17:14:40+00:00","tweet":"Montana Gov. Steve Bullock declares an emergency after a wintry storm dumped record amounts of wind-driven snow.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-27T14:49:07+00:00","tweet":"JUST IN: Steve Bullock unveils plan to protect public lands","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-27T12:24:00+00:00","tweet":"On the impeachment inquiry, 2020 hopeful Steve Bullock says President Trump needs to be held accountable. “The norms of this representative democracy are severely under siege right now”","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-09-27T11:45:17+00:00","tweet":"Steve Bullock says he doesn’t want to make the campaign about Trump. Fine. Go home now.","name":"steve bullock","Sentiment":0.4166666667},{"date":"2019-09-24T17:51:25+00:00","tweet":"Your list plus Femi Oluwole @Femi_Sorry Steve Bray @snb19692 Fionna O'Leary @fascinatorfun Carol Hedges @carolJhedges Gina Miller @thatginamiller Carole Cadwalladr @carolecadwalla Nicola Sturgeon @NicolaSturgeon Steve Bullock @GuitarMoog Led by Donkeys @ByDonkeys Jo Swinson","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-24T10:53:24+00:00","tweet":"Even red-state Governor Steve Bullock is now on board with impeachment of Trump over Ukraine …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-24T10:25:03+00:00","tweet":"Gov. Steve Bullock: \"Congress must swiftly investigate these allegations and demand the whistleblower report and any relevant transcripts of the President's interactions with Ukrainian officials. If they don't get it, I see no other option than starting impeachment proceedings.\"","name":"steve bullock","Sentiment":0.1541666667},{"date":"2019-09-22T20:12:00+00:00","tweet":"“The man who is best suited to the position of President out of the slate of candidates is our own Governor Steve Bullock. He has served well and effectively as chief executive in state government, with the Senate and House stacked against him heavily.\" …","name":"steve bullock","Sentiment":0.5},{"date":"2019-09-20T10:20:02+00:00","tweet":"How radical is Steve Bullock's climate plan? He has pledged to put a moratorium on new nuclear power plants—America’s leading clean energy source.","name":"steve bullock","Sentiment":0.2515151515},{"date":"2019-09-13T17:44:13+00:00","tweet":"“Of all the Presidential hopefuls who have promised to oust Donald Trump in 2020, Steve Bullock, the governor of Montana, has perhaps the most compelling electoral record.” …","name":"steve bullock","Sentiment":0.4},{"date":"2019-10-08T22:14:21+00:00","tweet":"Yup. Very interesting. Related take: Steve Bullock, for the love of all things, run for the freaking Senate, please. …","name":"steve bullock","Sentiment":0.3833333333},{"date":"2019-10-08T20:05:49+00:00","tweet":"Steve Bullock has made 18 executive orders this year including today’s e-cigarette flavor ban. You don’t seem to care much about “checks and balances” in Montana Governor. #VapeBan …","name":"steve bullock","Sentiment":0.2},{"date":"2019-10-08T17:25:05+00:00","tweet":"Poll: Trump trails Steve Bullock in Montana","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-08T13:07:39+00:00","tweet":"folks, if dems want to win montana with its 3 juicy electoral votes and lose every other state, the answer is clear: nominate steve bullock …","name":"steve bullock","Sentiment":0.2583333333},{"date":"2019-10-05T20:33:00+00:00","tweet":"Gov. Steve Bullock: \"The attorney general is not the president's lawyer, it's the people's lawyer.\"","name":"steve bullock","Sentiment":0.05},{"date":"2019-10-05T10:23:54+00:00","tweet":"Hello from a cloudy North Charleston, SC where the democrats’ Blue Jamboree is getting underway Today we’ll see: 10:40a Gov. Steve Bullock 12:10p Sen. Michael Bennet 12:35p Tom Steyer 1:00p Sen. Kamala Harris 1:25p Rep. Tulsi Gabbard 4:20p Fmr Rep. John Delaney 4:45p Andrew Yang","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-04T19:15:00+00:00","tweet":"Sick and tired of the year-around political campaigning? Democratic presidential candidate Steve Bullock's new plan would delay post-election fundraising by federal candidates, Kathie Obradovich writes. #iacaucus …","name":"steve bullock","Sentiment":-0.2444805195},{"date":"2019-10-04T17:41:04+00:00","tweet":"Montana Gov. Steve Bullock raised nearly $2.3 million for his 2020 presidential bid in the third fundraising quarter of this year, his campaign announced","name":"steve bullock","Sentiment":0.05},{"date":"2019-09-30T08:45:00+00:00","tweet":"Montana Gov. Steve Bullock declared an emergency in his state. #WinterStorm #Winteriscoming …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-28T08:49:25+00:00","tweet":"Senator Steve Bullock is what's wrong with America. He thinks an impeachment inquiry is going to tear the country apart more than white supremacy already has.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-26T11:55:47+00:00","tweet":"Video: Governor Steve Bullock calls for broader Native representation across government … via @IndianCountry","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-25T19:52:43+00:00","tweet":"Governor Steve Bullock (@GovernorBullock) sits down with Indian Country Today for a one-on-one interview. This is the first time in history a presidential candidate has visited a Native newsroom. #NativeVote20 – at Walter Cronkite School of Journalism & Mass Communication","name":"steve bullock","Sentiment":0.0472222222},{"date":"2019-09-24T19:08:53+00:00","tweet":"Governor Steve Bullock (@GovernorBullock) will visit the @IndianCountry newsroom tomorrow. He will be the first presidential candidate in history to visit a native newsroom. My latest: …","name":"steve bullock","Sentiment":0.375},{"date":"2019-09-22T10:33:00+00:00","tweet":"\"We gather for the sake of our nation!\" Steve Bullock spoke at the Polk County Democrats' Steak Fry in Des Moines, IA.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-21T11:04:34+00:00","tweet":"Steve Bullock’s volunteers are rocking out to Cascada’s “Everytime We Touch” at today’s Polk County Steak Fry.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-16T14:58:04+00:00","tweet":"WATCH: Jeff Bridges calls for donations to get his \"good buddy\" Steve Bullock \"up on that debate stage\"","name":"steve bullock","Sentiment":0.7},{"date":"2019-09-15T19:28:22+00:00","tweet":"I like Steve Bullock and he’s a legit champion on campaign finance reform but this critique is unfair. After Citizens United, every current Dem Senator voted for a constitutional amendment to overturn it, something he could not do on his first day as president. …","name":"steve bullock","Sentiment":-0.0833333333},{"date":"2019-09-12T23:25:33+00:00","tweet":"Steve Bullock and Michael Bennet could totally become my new heroes by dropping out and donating their entire remaining war-chests to Virginia legislative candidates","name":"steve bullock","Sentiment":0.0454545455},{"date":"2019-09-11T22:52:21+00:00","tweet":"Aaaaand the Steak Fry lineup is: Beto O’Rourke Kamala Harris Cory Booker Elizabeth Warren Bernie Sanders Andrew Yang Joe Biden Pete Buttigieg Bill de Blasio Amy Klobuchar Michael Bennet Julian Castro Tulsi Gabbard Tom Steyer Joe Sestak Marianne Williamson Steve Bullock Tim Ryan","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-11T00:14:43+00:00","tweet":"I just spent the past 4 days canvassing in rural NC — forgive me when I tell Steve Bullock to shut the hell up with this “show up in rural areas” crap. I did. Why doesn’t he show up in rural Montana and run for the damn senate?","name":"steve bullock","Sentiment":-0.1916666667},{"date":"2019-09-10T21:01:43+00:00","tweet":"#Bullock #Biden2020 Hey all you Bidden Voters. Or just Anti-Trump Voters. Here is a reason to vote for Steve Bullock when Biden Drops out. Which will be soon. #Bullock2020 …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T20:51:28+00:00","tweet":"And Steve Bullock should run for the U.S. Senate against Daines.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T18:24:01+00:00","tweet":"@SteveBullockUSA I support Gov. Steve Bullock for President!! Exec experience, 2 term Gov, common sense positions.","name":"steve bullock","Sentiment":-0.3},{"date":"2019-09-10T17:45:00+00:00","tweet":"Gov. Steve Bullock has ordered flags flown at half-staff throughout Montana Wednesday in honor of the 18th anniversary of the Sept. 11, 2001, terrorist attacks and those who died and in observance of Patriot Day and National Day of Service. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T16:37:39+00:00","tweet":"In an election where beating Trump is all that matters, nominate the Democrat who has the best chance to beat him: Steve Bullock. …","name":"steve bullock","Sentiment":1.0},{"date":"2019-09-10T15:31:41+00:00","tweet":"By popular acclaim! next ⭐️⭐️⭐️⭐️⭐️award is for @GuitarMoog! Steve Bullock is a total #Remain legend! who's kept many of us sane, with his amazing EU\/general insights from off the island, for which he cares SO much! Steve's put heart soul mind body into THIS! Thanks from US ALL!","name":"steve bullock","Sentiment":0.3446428571},{"date":"2019-09-10T15:08:34+00:00","tweet":"Literally every Democratic candidate raises their hand and Steve Bullock says, “Put your hand down, Delaney.” Then Gabbard, Williamson, and Yang walk on stage, wondering what’s going on and why no one told them about it. …","name":"steve bullock","Sentiment":-0.1555555556},{"date":"2019-09-10T14:46:41+00:00","tweet":"Steve Bullock will be in Iowa on September 12th and September 13th. On the 12th he is doing two stops with Christie Vilsack. 1 in Des Moines and 1 in Clive. Makes sure you go out and show your support. #TeamBullock #IACaucus #Bullock2020","name":"steve bullock","Sentiment":0.25},{"date":"2019-09-10T12:58:45+00:00","tweet":"Love this ad, too! But why not include the voices of all current primary candidates, especially Steve Bullock @GovernorBullock …","name":"steve bullock","Sentiment":0.25625},{"date":"2019-09-10T12:34:23+00:00","tweet":"15 dad jokes as told by Steve Bullock will make your Tuesday a little better. … via @buzzfeed","name":"steve bullock","Sentiment":0.15625},{"date":"2019-09-10T12:33:19+00:00","tweet":"Steve Bullock byline on this BuzzFeed dad joke listicle --> …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T12:32:01+00:00","tweet":"Inbox: Buzzfeed Contributor Steve Bullock: Why Do Cows Have Hooves?","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T11:19:47+00:00","tweet":"Tulsi, Marianne, and Steve Bullock all made important points during the debates, and they should continue to be heard. It's disappointing that they are locked out of the debate conversation by the process. It you watch their interviews they're still making those points.","name":"steve bullock","Sentiment":-0.1},{"date":"2019-09-10T11:16:35+00:00","tweet":"Cory Booker: “Democracy cannot operate without a free press” Steve Bullock: “I support the important role of a free press investigating the actions of government and uncovering wrongdoing.” Tim Ryan: “Are these charges constitutional? No.”","name":"steve bullock","Sentiment":0.4},{"date":"2019-09-10T09:41:31+00:00","tweet":"Steve Bullock to Campaign with Christie Vilsack in Iowa on September 12-13, 2019 …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T08:28:03+00:00","tweet":"Steve Bullock campaign seeks to reassure donors, suggests Joe Biden can't beat President Trump","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-10T06:58:36+00:00","tweet":"Will be done, Andrew! Steve Bullock @GuitarMoog is in no doubt, whatsoever, as to the high esteem in which he is held, by those of us still on this Island.","name":"steve bullock","Sentiment":0.16},{"date":"2019-09-10T00:11:25+00:00","tweet":"Steve Bullock on appealing to rural voters: We have to show up Keep at it @GovernorBullock! The road is long, have fun, always find reasons to smile along the way. Hold your head high and push that message. Really appreciate a voice with such broad appeal! …","name":"steve bullock","Sentiment":0.1653472222},{"date":"2019-09-05T10:17:22+00:00","tweet":"To pass climate legislation, Dems need to win the Senate. To win the Senate, Dems need 3 more seats. Steve Bullock is the only Dem who can beat Montana’s incumbent Republican senator. Therefore, Steve Bullock is the most important person on the planet. …","name":"steve bullock","Sentiment":0.5},{"date":"2019-09-02T05:00:08+00:00","tweet":"Do Stacey Abrams and Steve Bullock want to make Mitch McConnell president?","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-01T18:26:59+00:00","tweet":"Isn’t it a vanity play for Beto O’Rourke and Steve Bullock to keep running for President when if they ran for Senate in Texas and Montana and won, Dems would take the Senate. That would be true service to the country.","name":"steve bullock","Sentiment":0.35},{"date":"2019-08-31T14:17:46+00:00","tweet":"Stacey Abrams, Steve Bullock, Beto O’Rourke: Stand up and be counted. Run for the Senate. This is an all-hands-on-deck moment for American democracy - by ⁦@Milbank⁩ - The Washington Post …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-31T08:28:50+00:00","tweet":"Why are the following still in the Democratic race for president? Tulsi Gabbard Marianne Williamson John DeLaney Tim Ryan Michael Bennett Tom Steyer Steve Bullock Bill DeBlasio Michael Bennett Drop out. #DemPresidentialCandidates","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-31T00:34:38+00:00","tweet":"Opinion: Stacy Abrams, Steve Bullock and Beto O’Rourke — you’re needed in the Senate","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-30T19:32:22+00:00","tweet":"The stakes are really high here, and...Stacey Abrams, Steve Bullock, Beto O’Rourke — the three could make all the difference in the Democrats’ uphill quest to take the Senate next year, Dana @Milbank writes. Via @PostOpinions","name":"steve bullock","Sentiment":0.08},{"date":"2019-08-29T15:43:14+00:00","tweet":"Tulsi Gabbard, Michael Bennet, Steve Bullock and some of their supporters (especially Tulsi's) complain that Democratic debate qualifications are somehow unfair. But it's not a conspiracy. Voters have had a look--they're just not that into them. My latest …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-28T10:21:16+00:00","tweet":"Not on the debate stage due to lack of support. Exit gracefully and asap. Tom Steyer Tulsi Gabbard Marianne Williamson Kirsten Gillibrand Michael Bennet Steve Bullock Bill de Blasio John Delaney Tim Ryan Joe Sestak","name":"steve bullock","Sentiment":-0.125},{"date":"2019-08-27T13:01:00+00:00","tweet":"Gov. Steve Bullock: \"Recognize that the greatest stride that we made since Medicaid and Medicare was Obamacare. I want to build on that, not start all over. And I think you could do that with a public option.\"","name":"steve bullock","Sentiment":0.5},{"date":"2019-08-26T09:00:24+00:00","tweet":"2 Democrats Running for president Who Could Win a Senate Seat in 2020 Beto O’Rourke Could Beat GOP Sen. John Cornyn in Texas Gov. Steve Bullock Could Beat GOP Sen. Steve Daines In Montana","name":"steve bullock","Sentiment":0.8},{"date":"2019-08-25T19:15:00+00:00","tweet":"“That is an absolute no.” Montana Gov. Steve Bullock says he won’t run for Senate if he doesn’t win the Democratic nomination for president. #CNNTownHall","name":"steve bullock","Sentiment":0.5},{"date":"2019-08-25T19:10:25+00:00","tweet":"\"I'm a single issue voter this time. And that's making sure that Donald Trump is not re-elected...\" - Montana Gov. Steve Bullock on whether electability is more important than policy positions in choosing a presidential candidate #CNNTownHall","name":"steve bullock","Sentiment":0.3321428571},{"date":"2019-08-25T18:51:04+00:00","tweet":"Steve Bullock: We can be carbon neutral “by 2040 or even earlier”","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-25T18:39:54+00:00","tweet":"“The scientists say we have to be net zero, carbon neutral effectively, as a world, by 2050. I think we can do it by 2040 or even earlier,” says presidential candidate Steve Bullock on how he would take on the climate crisis. #CNNTownHall","name":"steve bullock","Sentiment":0.2},{"date":"2019-08-25T18:33:00+00:00","tweet":"“When I was growing up, the NRA used to be just a gun safety and hunting organization,\" says Montana Gov. Steve Bullock. \"Now it’s a dark money field, political organization, that does nothing more than drive us apart.” #CNNTownHall","name":"steve bullock","Sentiment":0.1166666667},{"date":"2019-08-25T18:26:03+00:00","tweet":"Steve Bullock blames the NRA for the lack of action on guns #CNNTownHall","name":"steve bullock","Sentiment":0.1},{"date":"2019-08-22T01:15:07+00:00","tweet":"Wilmot Collins is a nice guy but he's not Steve Bullock. Bullock would have what, a 30% chance of winning against Daines? Sometimes a 30% chance happens. Steve Bullock is more interested in stroking than helping this country.","name":"steve bullock","Sentiment":0.4625},{"date":"2019-08-20T09:02:06+00:00","tweet":"Met a random guy in New Jersey yesterday wearing a Steve Bullock t-shirt. Very likely the only guy in New Jersey with a Steve Bullock t-shirt. In that sense, I was impressed","name":"steve bullock","Sentiment":0.1287878788},{"date":"2019-08-18T20:52:18+00:00","tweet":"Real change after 2020 depends on who controls the U.S. Senate. Why decisions by John Hickenlooper and Steve Bullock matter. My column …","name":"steve bullock","Sentiment":0.2},{"date":"2019-08-18T19:43:08+00:00","tweet":"Dear Americans - have you seen this - Is this true? @DanaPerino ask Steve Bullock what he thinks - ask all the Progressive candidates- ask the Squad","name":"steve bullock","Sentiment":0.35},{"date":"2019-08-18T11:09:57+00:00","tweet":"Bernie Sanders, Elizabeth Warren, Amy Klobuchar, Marianne Williamson, Gov. Steve Bullock, John Delaney, Bill de Blasio, Mark Charles & Julián Castro will all participate. These candidates seem to be taking working with Native communities seriously. The others? I don’t know.","name":"steve bullock","Sentiment":-0.3333333333},{"date":"2019-08-18T10:53:33+00:00","tweet":"Salute to Bernie Sanders, Elizabeth Warren, Amy Klobuchar, Marianne Williamson, Gov. Steve Bullock, John Delaney, Bill de Blasio, Mark Charles & Julián Castro who will all participate in the Frank LaMere Native American Presidential Forum on August 19-20 in Sioux City Iowa.","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-18T09:53:50+00:00","tweet":"Gov Steve Bullock (D-MT) @GovernorBullock talks to Dana about immigration \"I served with Ken Cuccinelli when he was Attorney General, Putting him in charge of immigration would be like putting Putin in charge of election security\"","name":"steve bullock","Sentiment":0.05},{"date":"2019-08-17T13:03:00+00:00","tweet":"Twitter, meet Steve Bullock from Alabama! He’s a big fan of the Steve Bullock from Montana. Want your own Bullock 2020 gear? Check out what we’ve got in the store:","name":"steve bullock","Sentiment":0.3},{"date":"2019-08-16T19:25:41+00:00","tweet":"Sure, beating GOP Sen. Steve Daines in a state Trump won by 20% would be hard even for a great Democratic candidate like Steve Bullock. But Montana just re-elected its Democratic senator last year, & there's always a chance things could fall into place for a Dem upset win in 2020","name":"steve bullock","Sentiment":0.3616666667},{"date":"2019-08-16T19:20:18+00:00","tweet":"I get it: Montana would be tough to win even with Gov. Steve Bullock in the race. But he has zero shot at the presidential or VP nomination, & no other Dem could even make #MTsen competitive. Senate Dems need their best possible candidates in every race …","name":"steve bullock","Sentiment":0.2947222222},{"date":"2019-08-16T17:56:35+00:00","tweet":"Should some Democratic candidates start thinking about leaving the race? @adrienneelrod says: \"At some point you've got to winnow the field ... If Steve Bullock does not make that third debate stage in a couple of weeks\" he should consider running for Senate #MTPDaily","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-16T12:00:07+00:00","tweet":"Steve Bullock's campaign has bought the website . This is the page that comes up:","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-16T10:01:22+00:00","tweet":"CNN will host town halls with Democratic presidential candidates Montana Gov. Steve Bullock and New York Mayor Bill de Blasio on August 25.","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-08-15T17:38:53+00:00","tweet":"1\/ @JRubinBlogger then flags two other current candidates she says should become candidates for the U.S. Senate: Julian Castro (TX) Steve Bullock (MT) And she notes a candidate who's dropped out who looks likely to also run—in her view wisely—for Senate: John Hickenlooper (CO)","name":"steve bullock","Sentiment":-0.0416666667},{"date":"2019-08-14T22:20:31+00:00","tweet":"Democratic presidential candidate Steve Bullock on changing his position on universal background checks: \"I started looking at it as a public health issue\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-13T18:01:49+00:00","tweet":"And Steve Bullock can you please run for senate too? …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-13T12:11:08+00:00","tweet":"Steve Bullock is the first Dem I see smacking Steyer today: \"We’re kidding ourselves if we’re calling a $10 million purchase of 130,000 donors a demonstration of grassroots support.”","name":"steve bullock","Sentiment":0.25},{"date":"2019-08-13T12:00:21+00:00","tweet":"Steve Bullock responds to Tom Steyer making the debate stage","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-12T14:56:40+00:00","tweet":"Steve Bullock, father of three, looks at a grill loaded with meat and has to ask, “How do you know when they’re done?” If we can’t trust him to work a grill, how are we supposed to trust him to be president?","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T18:37:32+00:00","tweet":"2020 Candidate Steve Bullock Declares Democrats Are \"Well on Our Way To Losing\" 2020 to Trump … #Trump2020Landslide #FourMoreYears","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T16:49:03+00:00","tweet":"Steve Bullock! They are all essentially the same person though","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T16:03:22+00:00","tweet":"Montana’s Steve Bullock warns Democrats they’re at risk of losing to Trump … via @RollCall","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T15:22:16+00:00","tweet":"Steve Bullock: Matt; Don't forget about that Prison in Shelby I Built that's not in use. Matthew Paul: That's what I Was talking about Governor; Don't you owe me money?","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T14:05:49+00:00","tweet":"My top 10 Presidential preferences list: 1. Harris 2. Warren 3. Castro 4. Gillibrand 5. Buttigieg 6. Booker 7. Sanders 8. Tim Ryan 9. Amy Klobuchar 10. Steve Bullock\/John Hickenlooper (not tied, I just have trouble telling them apart and they both sound ok-ish)","name":"steve bullock","Sentiment":0.2333333333},{"date":"2019-08-11T13:54:55+00:00","tweet":"Governor of Montana Steve Bullock: when workers and unions continue to fight, they can win | UAW. #SteveBullock2020 …","name":"steve bullock","Sentiment":0.8},{"date":"2019-08-11T13:02:44+00:00","tweet":"Steve Bullock lands endorsements from Iowa Democratic leaders | Political News | . #SteveBullock2020 …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T12:34:02+00:00","tweet":"Yin looks like Steve Bullock. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-08-11T12:18:05+00:00","tweet":"If DEMS really want a working majority in the Senate, then Steve Bullock will be on the top of the ticket for President! He would give candidates like Amy Mcgrath in KY a fighting chance! #MoscowMitch and #ComardeDon will be history! Goal: 400 Electoral Votes & a Supermajority!","name":"steve bullock","Sentiment":0.6},{"date":"2019-08-11T12:03:44+00:00","tweet":"Governor Steve Bullock: 40% of Americans don’t have $400 for an unexpected emergency. Trump’s economy was never working for them. It works for the wealthy and corporations — and it’s by design. …","name":"steve bullock","Sentiment":0.3},{"date":"2019-08-11T11:23:51+00:00","tweet":"Montana Gov. Steve Bullock (@GovernorBullock) was in his last day of law school in 1994 when he got some horrific news: His 11-year-old nephew Jeremy was dead.","name":"steve bullock","Sentiment":-0.4},{"date":"2019-08-11T11:02:23+00:00","tweet":"Steve Bullock's nephew was killed in a school shooting in 1994 - @cam_joseph … via @vicenews","name":"steve bullock","Sentiment":-0.2},{"date":"2019-08-11T04:07:20+00:00","tweet":"Sen. Bernie Sanders (I-VT) replied “I do” to a question of whether he agreed Trump is a white supremacist. “Based on his words and actions, yes, he is a white supremacist,” Andrew Yang said. There are white supremacists that think Donald Trump has their back,” Gov. Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-09T17:15:23+00:00","tweet":"Steve Bullock (D, MT) \/ Steve Bullock (D, MT)","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-08T09:51:02+00:00","tweet":"Steve Bullock TikToks are exactly what you’d expect.","name":"steve bullock","Sentiment":0.25},{"date":"2019-11-07T12:45:00+00:00","tweet":"\"If Democrats want to win they should nominate Montana Governor Steve Bullock\" - Larry Sabato. …","name":"steve bullock","Sentiment":0.8},{"date":"2019-11-05T11:59:21+00:00","tweet":"The DNC is an all-powerful election rigging cabal that also can’t convince Steve Bullock that being a senator would be more fun than polling at 0.5% in iowa.","name":"steve bullock","Sentiment":0.4},{"date":"2019-11-04T08:30:21+00:00","tweet":"Steve Bullock won three statewide elections in Montana, appears to be at full cognitive capacity, no children involved in sleazy Ukraine dealings, looks straight out of central casting... and his candidacy has still essentially been negated. Must wake up daily and be like, WTF","name":"steve bullock","Sentiment":0.0083333333},{"date":"2019-11-02T22:12:59+00:00","tweet":"I'm not seeing Steve Bullock as a president I'm sorry …","name":"steve bullock","Sentiment":-0.5},{"date":"2019-11-02T11:24:28+00:00","tweet":"Gov. Steve Bullock speaks in Des Moines, Iowa: \"When we take on Rudy Giuliani, Lindsey Graham, Joni Ernst, and all that corruption in Washington, DC, we're going to give Trump the boot.\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-02T00:25:10+00:00","tweet":"Does Steve Bullock know there's a competitive Senate seat that we need in Montana in 2020? Asking for an everyone. #LJ19","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-01T23:15:09+00:00","tweet":"My November Tiers S: Andrew Yang A: Bernie Sanders B: Tulsi Gabbard Elizabeth Warren Cory Booker Marianne Williamson Julian Castro C: Tom Steyer Michael Bennet Pete Buttigieg Amy Klobuchar Joe Sestak Kamala Harris Joe Biden Wayne Messam Steve Bullock D: John Delaney F: None","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-31T11:34:09+00:00","tweet":"Steve Bullock calls for putting Giuliani \"behind bars\"","name":"steve bullock","Sentiment":-0.4},{"date":"2019-10-31T09:02:25+00:00","tweet":"Steve Bullock tricked Anthony Scaramucci into sorta endorsing him because 2019 …","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-28T15:20:32+00:00","tweet":"In 2019, Montana Governor Steve Bullock signed Hanna's Act. The law requires the Department of Justice to investigate missing & murdered indigenous people, oversee data collection, liaise with families & work with other state & federal agencies","name":"steve bullock","Sentiment":-0.1625},{"date":"2019-10-27T16:29:47+00:00","tweet":"“Our Democratic Party needs a candidate at the top who brings a proven track record and the exceptional qualities to unite our country. That candidate is Montana Gov. Steve Bullock.” — Dave Muhlbauer, Crawford County Supervisor.","name":"steve bullock","Sentiment":0.5833333333},{"date":"2019-10-25T22:10:37+00:00","tweet":"Wow. Steve Bullock is really pissed off about what happened with Jay Inslee. …","name":"steve bullock","Sentiment":0.15},{"date":"2019-10-25T09:00:12+00:00","tweet":"I spent some time in Montana and Iowa with Steve Bullock, the 2-term governor who won in a Trump landslide state and passed Medicaid expansion through a Republican legislature. His stillborn presidential campaign tells us a lot about the Democrats in 2019. …","name":"steve bullock","Sentiment":-0.1},{"date":"2019-10-25T07:00:10+00:00","tweet":"Steve Bullock was supposed to be the key to unlocking Trump voters. Here’s why he thinks he still has a chance.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-18T16:33:14+00:00","tweet":"Memo to Tom Perez: Don't you feel proud that you made room on the debate stage for Tulsi Gabbard who just called the 2016 nominee, \"the queen of warmongers, embodiment of corruption\"? But your rigid, cockamamie debate rules exiled Steve Bullock and Michael Bennet. Great going.","name":"steve bullock","Sentiment":0.8},{"date":"2019-10-17T22:42:49+00:00","tweet":"Gov. Steve Bullock at 4%—ahead of Booker, Steyer, Harris, Klobuchar, etc.—with no access to recent debates or a big ad campaign is stunning. …","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-10-17T12:05:49+00:00","tweet":"2020 candidate Gov. Steve Bullock now says that President Trump should be removed from office. “Whether he's removed at the ballot box or through an impeachment proceeding, we’ve got to recognize the next person that comes in has to be able to deal with those great divides.”","name":"steve bullock","Sentiment":0.4333333333},{"date":"2019-10-15T20:50:25+00:00","tweet":"Tom Steyer is no Steve Bullock. I know Steve Bullock. Steve should be on this stage. Not Tom.","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-10T16:03:39+00:00","tweet":"Here's how it works: Steve Bullock runs for Senate ️ Democrats take control of the Senate ️ we can end the filibuster. We need you to run for Senate — not waste your talents on a presidential vanity project. …","name":"steve bullock","Sentiment":0.1},{"date":"2019-11-09T13:53:15+00:00","tweet":"#BREAKING: Noted progressive activist, Bill Maher hosted a panel of radical socialists including Steve Schmitt, Rahm Emmanuel, and Steve Bullock on last night’s “Real Time” Has Bill lost touch with middle America and moved too far left?","name":"steve bullock","Sentiment":0.06},{"date":"2019-11-07T20:00:08+00:00","tweet":"When no Democrat has enough delegates at the Convention and Bernie & Warren team up ... @MikeBloomberg & @TomSteyer will be the cause Amy Klobuchar, Julian Castro, Steve Bullock, Kamala Harris - each has proven results and none are fringe left White old men with money & ego","name":"steve bullock","Sentiment":0.025},{"date":"2019-11-02T00:22:49+00:00","tweet":"The folks who are still around are having a lot of fun with this Steve Bullock speech that’s closing out the night #LJ19","name":"steve bullock","Sentiment":0.3},{"date":"2019-11-02T00:03:29+00:00","tweet":"The fact that John Delaney and Steve Bullock are the last two speakers at the end of a 5 hour program is all the evidence I need that the gods are cruel.","name":"steve bullock","Sentiment":-0.5},{"date":"2019-11-01T23:58:07+00:00","tweet":"John Delaney just walked on stage for his speech at tonight's Liberty & Justice Celebration with a massive picture of Steve Bullock behind him. So, how is your night going?","name":"steve bullock","Sentiment":-0.2},{"date":"2019-10-31T20:48:03+00:00","tweet":"Montana Gov. Steve Bullock got former White House communications director Anthony Scaramucci to record a video saying he is \"100%\" behind \"Steve B\" by paying $100 through a video-sharing website","name":"steve bullock","Sentiment":-0.1333333333},{"date":"2019-10-31T16:29:05+00:00","tweet":"Steve Bullock gets Anthony Scaramucci to unknowingly tape an endorsement for $100","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-31T09:39:07+00:00","tweet":"How Embarrassing For Scaramucci, Better Known As The “MOOCH”! ‘Lifelong conservative Republican’ Anthony Scaramucci accidentally films 2020 ad for Gov. Steve Bullock …","name":"steve bullock","Sentiment":0.2625},{"date":"2019-10-29T19:43:00+00:00","tweet":"I am so pissed at the @DNC for propping you loser candidates & diminishing ones that can beat trump like @BetoORourke & Steve Bullock. Trying to appease the die hard progressives during the primary is turning off moderates like me. If one of the people who I do not think can","name":"steve bullock","Sentiment":0.0541666667},{"date":"2019-10-29T17:33:01+00:00","tweet":"Montana Gov. Steve Bullock is the only one that can swing enough voters to #winOverAny designated #GOP Presidential candidate. Montana Gov. Steve Bullock. Is that age in American politics created by movies, spy books and talk radio.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-26T15:34:16+00:00","tweet":"I met a Steve Bullock superfan at the #UBIMarchNYC! Lmao @radiogurt it's good to meet you IRL","name":"steve bullock","Sentiment":0.65},{"date":"2019-10-25T18:05:52+00:00","tweet":"It’s been an honor (and a blast) serving alongside our Governor, and my friend, Steve Bullock as Lt. Governor these past few years. Now that I’m running to fill his shoes...I’m sure grateful he’s got my back! #mtpol #mtgov","name":"steve bullock","Sentiment":0.0125},{"date":"2019-10-25T04:31:00+00:00","tweet":"Steve Bullock: \"Our stature has been greatly reduced\" by President Trump's actions.","name":"steve bullock","Sentiment":0.8},{"date":"2019-10-24T18:47:35+00:00","tweet":"“Our Democratic Party needs a nominee who can fix Washington and get it back to work. That candidate is Montana Governor Steve Bullock.” - Don Ruby, Former Warren County Democratic Party Chair …","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-24T16:31:00+00:00","tweet":"Gov. Steve Bullock: \"Knowing that we have to win back places like Michigan, Wisconsin, and Pennsylvania, it's not going to be some donors in New York City that decide the best way to actually do that.\"","name":"steve bullock","Sentiment":0.3872727273},{"date":"2019-10-20T00:09:29+00:00","tweet":"Our third party name?? @BernieSanders @AndrewYang @BetoORourke @TulsiGabbard @marwilliamson & I'd like to see @TimRyan too.. Steve Bullock too, but he has no Twitter?? Strange.","name":"steve bullock","Sentiment":-0.025},{"date":"2019-10-16T00:17:53+00:00","tweet":"It has been striking to see Pete Buttigieg run the campaign that John Hickenlooper and Steve Bullock wanted to run.","name":"steve bullock","Sentiment":0.5},{"date":"2019-10-15T20:20:54+00:00","tweet":"exclusive photo of steve bullock watching tonight's debate","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-15T18:22:51+00:00","tweet":"… \"Three prominent Iowa Democrats said ... that Montana Gov. Steve Bullock should remain focused on campaigning in the state and winning the caucus in February.\" \"Nagle has yet to endorse any candidate, but said he was impressed by Bullock.\" #TeamBullock","name":"steve bullock","Sentiment":0.6666666667},{"date":"2019-10-15T18:15:04+00:00","tweet":"Montana knows startups. @classpass CEO, Fritz Lanman, shares his story with Steve Bullock of why he chose Montana and how we can continue to cultivate more great firms like his. #InnovateMontana #MTBiz","name":"steve bullock","Sentiment":0.65},{"date":"2019-10-15T16:30:00+00:00","tweet":"The Jonathan M. Tisch College of Civic Life welcomed presidential candidate and Montana Governor Steve Bullock (@GovernorBullock) for a town hall on Friday.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-15T15:30:56+00:00","tweet":"Campaign Conversations: Montana gov. Steve Bullock (D) Presidential Candidate – KLEW …","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-15T14:25:00+00:00","tweet":"Even long-shot candidates like Montana Governor Steve Bullock and Colorado Senator Michael Bennet can’t be fully counted out—@MrWalterShapiro reports from the campaign trail:","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-15T13:52:16+00:00","tweet":"If Tom Perez wasn't DNC Chairman, it would of been Michael Bennet and Steve Bullock instead of Tulsi Gabbard and Tom Steyer.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-15T13:47:16+00:00","tweet":"Tulsi Gabbard and Tom Steyer need to be replaced by Steve Bullock and Michael Bennet.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-15T13:12:32+00:00","tweet":"You may not see Montana Governor Steve Bullock on the debate stage tonight, but he's committed to the Democratic presidential nomination race as yesterday's interview with Sinclair Broadcasting makes clear. Get your full dose of Governor Bullock here. …","name":"steve bullock","Sentiment":0.225},{"date":"2019-10-15T11:04:58+00:00","tweet":"Steve Bullock Announces Four New Iowa Endorsements …","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-10-15T10:38:12+00:00","tweet":"Lest you think it's my stanning of Beto here, I'm actually talking about Steve Bullock and Amy Klobuchar and Michael Bennet. Tom Steyer is somehow on the debate stage, where Amy Klobuchar is unlikely to make it. That's...broken.","name":"steve bullock","Sentiment":-0.25},{"date":"2019-10-15T10:15:25+00:00","tweet":"New from @PaigeGodden: Steve Bullock racks up several more Iowa endorsers, including some local elected officials, while much of the field prepares for tonight's debate …","name":"steve bullock","Sentiment":0.1672727273},{"date":"2019-10-15T08:55:35+00:00","tweet":"I don’t blindly follow Beto or any other candidate. I follow because of policy positions. I believe in Beo. I like Kamala, Joe Biden, Cory Booker. I really like Steve Bullock & Michael Bennett. It’s a shame they have not made more traction. I sure as hell don’t allow","name":"steve bullock","Sentiment":0.115},{"date":"2019-10-14T19:01:00+00:00","tweet":"Gov. Steve Bullock: \"You have Democrats and Republicans condemning exactly what President Trump did, and saying this is not what we should have done with the Kurds. I agree.\"","name":"steve bullock","Sentiment":0.25},{"date":"2019-10-13T18:59:00+00:00","tweet":"Two chances for democrats: nominate Steve Bullock or remove Trump from office. I don’t understand why they are not paying attention to Steve Bullock.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-13T17:14:32+00:00","tweet":"Nicknames for democrat presidential candidates Status Quo Joe (Joe Biden) BetOil O Rourke (Beto) Mayor Booty-Judge (Pete Buttigieg) Kirsten Jellobrand (Gillibrand) Cory Bootlicker (Cory Booker) Steve Bullshit (Steve Bullock) John De-Lamey (John Delaney (1\/2)","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-13T15:34:37+00:00","tweet":"Steve Bullock has not Tweeted about #KurdsBetrayed. I learned that his Twitter feed is very boring. This Ski joke is about the most interesting thing there. (13\/19) …","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-12T19:00:58+00:00","tweet":"An Amy Klobucher\/Steve Bullock ticket would creme Trump. There's so many things going for it: 1. surprise factor 2. winners in Midwest & Trump voters 3. pragmatic progressives 4. experienced. COME ON DEMS! MAKE THE STRATEGIC CHOICE FOR 2020 #VoteBlueToEndThisNightmare #vote2020","name":"steve bullock","Sentiment":0.75},{"date":"2019-10-12T10:01:04+00:00","tweet":"In Iowa today, October 12: Steve Bullock, Kamala Harris, Michael Bennet, Pete Buttigieg. More: …","name":"steve bullock","Sentiment":0.5},{"date":"2019-10-12T09:59:30+00:00","tweet":"One-on-one with Steve Bullock where I beg him to run for senate","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-12T09:45:44+00:00","tweet":"1-on-1 With Steve Bullock, Who's Running on His Record of Governing … via @","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-12T09:29:25+00:00","tweet":"Free political advice to Steve Bullock (he's still in the race?). Don't drop bold new plans (joining the club on policy proposals) on Fridays. I think I learned that in Elections 101 in undergrad. …","name":"steve bullock","Sentiment":0.2174242424},{"date":"2019-10-12T09:00:13+00:00","tweet":"Gov. Steve Bullock's emergency ban of flavored #vaping products will take effect Oct. 22 and last for 120 days, but shop owners don't think they can survive that long. #mtnews","name":"steve bullock","Sentiment":-0.025},{"date":"2019-10-12T08:36:07+00:00","tweet":"Just a reminder that Tim Ryan, Steve Bullock, and John Delaney are all still running for president for some reason","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-12T07:45:05+00:00","tweet":"I wish Steve Bullock could have gotten as much coverage as any one of the folks you just mentioned.","name":"steve bullock","Sentiment":0.2},{"date":"2019-10-12T06:18:17+00:00","tweet":"Abi Steve Bullock","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-12T05:10:45+00:00","tweet":"Robin Williams would love to see Steve Bullock win, and would donated to him, I believe.","name":"steve bullock","Sentiment":0.65},{"date":"2019-10-12T04:43:40+00:00","tweet":"My 2 cents, as a female, my gut feeling is that Ms. Warren does not have it going on as much as her other competition of the same sex. I don't count any woman who has not made it to all of the debate stages as a contender. Men, it is a different story. Steve Bullock is bestman","name":"steve bullock","Sentiment":0.015},{"date":"2019-10-12T03:17:11+00:00","tweet":"I wonder why he is still running? How Steve Bullock would boost K-12 school spending and make community college free (via POLITICO for iOS)","name":"steve bullock","Sentiment":0.4},{"date":"2019-10-12T01:15:08+00:00","tweet":"@Gallatin_County @GallatinHealth #FOIA @ Governor Steve Bullock .... oops","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-11T15:26:50+00:00","tweet":"\"Montana Gov. Steve Bullock, in a new education plan unveiled on Friday, proposed doubling federal spending on K-12 schools and making community college tuition-free.\" …","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-10-08T22:30:00+00:00","tweet":"“Democratic presidential candidate Steve Bullock, the governor of Montana, is proposing a rule that federal elected officials must spend half of their terms actually governing.” …","name":"steve bullock","Sentiment":-0.0833333333},{"date":"2019-10-08T20:00:34+00:00","tweet":"What if there were some other federal office Steve Bullock could run for? …","name":"steve bullock","Sentiment":-0.125},{"date":"2019-10-08T13:22:05+00:00","tweet":"NEW POLL: Trump trails Steve Bullock in Montana","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-10-06T01:21:00+00:00","tweet":"Steve Bullock: \"When spoke to the president of Ukraine, he said I want you to talk to my personal lawyer and the Attorney General.\"","name":"steve bullock","Sentiment":0.025},{"date":"2019-10-04T17:01:00+00:00","tweet":"Gov. Steve Bullock: \"The attorney general is not the president's lawyer, it's the people's lawyer.\"","name":"steve bullock","Sentiment":0.05},{"date":"2019-10-04T16:00:00+00:00","tweet":"2020 Democrats 3rd Quarter Fundraising (so far) Bernie Sanders $25M Elizabeth Warren $24.6M Pete Buttigieg $19M Joe Biden $15.2M Kamala Harris $11.6M Andrew Yang $10M Cory Booker $6M Marianne Williamson $3M Steve Bullock $2.3M Michael Bennet $2.1M","name":"steve bullock","Sentiment":0.05},{"date":"2019-10-03T17:18:12+00:00","tweet":"Michael Bennet - lawyer Joe Biden - lawyer Cory Booker - lawyer Steve Bullock - lawyer John Delaney - lawyer Kirsten Gillibrand - lawyer Kamala Harris - lawyer Amy Klobuchar - lawyer Tim Ryan - lawyer Bernie Sanders - not a lawyer Elizabeth Warren - lawyer Andrew Yang - lawyer","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-30T09:26:00+00:00","tweet":"Montana Gov. Steve Bullock declared a \"winter storm emergency\" on Sunday after the state was struck by more than 3 feet of heavy, wet snow; storm watches and warnings were posted across the region","name":"steve bullock","Sentiment":0.0666666667},{"date":"2019-09-29T17:14:40+00:00","tweet":"Montana Gov. Steve Bullock declares an emergency after a wintry storm dumped record amounts of wind-driven snow.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-27T14:49:07+00:00","tweet":"JUST IN: Steve Bullock unveils plan to protect public lands","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-27T12:24:00+00:00","tweet":"On the impeachment inquiry, 2020 hopeful Steve Bullock says President Trump needs to be held accountable. “The norms of this representative democracy are severely under siege right now”","name":"steve bullock","Sentiment":0.2857142857},{"date":"2019-09-27T11:45:17+00:00","tweet":"Steve Bullock says he doesn’t want to make the campaign about Trump. Fine. Go home now.","name":"steve bullock","Sentiment":0.4166666667},{"date":"2019-09-24T17:51:25+00:00","tweet":"Your list plus Femi Oluwole @Femi_Sorry Steve Bray @snb19692 Fionna O'Leary @fascinatorfun Carol Hedges @carolJhedges Gina Miller @thatginamiller Carole Cadwalladr @carolecadwalla Nicola Sturgeon @NicolaSturgeon Steve Bullock @GuitarMoog Led by Donkeys @ByDonkeys Jo Swinson","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-24T10:53:24+00:00","tweet":"Even red-state Governor Steve Bullock is now on board with impeachment of Trump over Ukraine …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-24T10:25:03+00:00","tweet":"Gov. Steve Bullock: \"Congress must swiftly investigate these allegations and demand the whistleblower report and any relevant transcripts of the President's interactions with Ukrainian officials. If they don't get it, I see no other option than starting impeachment proceedings.\"","name":"steve bullock","Sentiment":0.1541666667},{"date":"2019-09-22T20:12:00+00:00","tweet":"“The man who is best suited to the position of President out of the slate of candidates is our own Governor Steve Bullock. He has served well and effectively as chief executive in state government, with the Senate and House stacked against him heavily.\" …","name":"steve bullock","Sentiment":0.5},{"date":"2019-09-20T10:20:02+00:00","tweet":"How radical is Steve Bullock's climate plan? He has pledged to put a moratorium on new nuclear power plants—America’s leading clean energy source.","name":"steve bullock","Sentiment":0.2515151515},{"date":"2019-09-19T21:41:02+00:00","tweet":"Gov. Steve Bullock - Montana... Thanks for sharing your platform with us ( WTU)!","name":"steve bullock","Sentiment":0.25},{"date":"2019-09-19T18:56:06+00:00","tweet":"Tune in tomorrow for the final day of #ClimateForum2020, where we'll here from candidates such as Senator Cory Booker, Governor Steve Bullock, Mayor Pete Buttigieg, Tom Steyer and Former Governor Bill Weld:","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-19T11:13:52+00:00","tweet":"Oh — look at this — lot of smart folks weighing in! Why Steve Bullock Refuses to Drop Out of the 2020 Race - The Atlantic …","name":"steve bullock","Sentiment":0.2678571429},{"date":"2019-09-19T10:33:19+00:00","tweet":"Members of the Clinton diaspora are pleading with Montana Governor Steve Bullock to stay in the race, even if the rest of the country doesn’t know who he is, @IsaacDovere reports:","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-18T10:34:31+00:00","tweet":"Sen. Elizabeth Warren picked up an endorsement from Iowa Treasurer Michael Fitzgerald today. Fitzgerald is the second statewide elected Democrat to endorse a candidate this cycle. Iowa Attorney General Tom Miller endorsed Montana Gov. Steve Bullock in May.","name":"steve bullock","Sentiment":0.025},{"date":"2019-09-16T18:57:26+00:00","tweet":"I just donated to Steve Bullock! He’s the only Democratic candidate who won a Trump state, but he needs 130,000 d... …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-16T14:58:04+00:00","tweet":"WATCH: Jeff Bridges calls for donations to get his \"good buddy\" Steve Bullock \"up on that debate stage\"","name":"steve bullock","Sentiment":0.7},{"date":"2019-09-16T13:51:48+00:00","tweet":"The Dude does not abide Steve Bullock being off the debate stage. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-16T13:51:02+00:00","tweet":"Jeff Bridges is soliciting donations for his “good buddy” Steve Bullock …","name":"steve bullock","Sentiment":0.7},{"date":"2019-09-16T10:42:22+00:00","tweet":"That’s right on. Conversely, it’s hard to think of any reason why you’d consider Biden a better electability choice than Bullock but nobody knows who Steve Bullock is.","name":"steve bullock","Sentiment":0.1646825397},{"date":"2019-09-16T09:00:48+00:00","tweet":"\"As Big Oil reaps huge profits and takes over our public lands, our politicians stand by and do literally nothing to deal with the climate crisis.\" - Governor Steve Bullock","name":"steve bullock","Sentiment":0.1333333333},{"date":"2019-09-15T19:28:22+00:00","tweet":"I like Steve Bullock and he’s a legit champion on campaign finance reform but this critique is unfair. After Citizens United, every current Dem Senator voted for a constitutional amendment to overturn it, something he could not do on his first day as president. …","name":"steve bullock","Sentiment":-0.0833333333},{"date":"2019-09-13T21:52:39+00:00","tweet":"An encounter with Steve Bullock, a Presidential hopeful who watched last night's debate from Iowa.","name":"steve bullock","Sentiment":0.0},{"date":"2019-09-13T18:09:01+00:00","tweet":"The Presidential hopeful Steve Bullock did not secure enough donors to qualify for last night's debate. He watched the event from a gastropub in Iowa.","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2019-09-13T17:44:13+00:00","tweet":"“Of all the Presidential hopefuls who have promised to oust Donald Trump in 2020, Steve Bullock, the governor of Montana, has perhaps the most compelling electoral record.” …","name":"steve bullock","Sentiment":0.4},{"date":"2019-09-13T17:25:18+00:00","tweet":"Extremely on-brand for former Kirsten Gillibrand staffers to buy whiskey for Steve Bullock at The Continental …","name":"steve bullock","Sentiment":-0.0625},{"date":"2019-09-13T13:03:54+00:00","tweet":"Montana Gov. Steve Bullock spent the past two days campaigning in Iowa and watched some of last night's debate with his staff. He said \"from what I saw and what I'm reading, this doesn't change anything.\"","name":"steve bullock","Sentiment":-0.1166666667},{"date":"2019-09-12T23:25:33+00:00","tweet":"Steve Bullock and Michael Bennet could totally become my new heroes by dropping out and donating their entire remaining war-chests to Virginia legislative candidates","name":"steve bullock","Sentiment":0.0454545455},{"date":"2019-09-12T15:33:00+00:00","tweet":"Trump's Senior Campaign Adviser: “Steve Bullock frightens me.” When we talk about issues that matter to American's everyday lives, we’ll win — and Donald Trump knows it.","name":"steve bullock","Sentiment":0.2},{"date":"2019-12-03T14:08:53+00:00","tweet":"In the three days after announcing my presence on Twitter, three of my enemies have dropped out: Joe Sestak, Steve Bullock, and now, Kamala Harris. DO NOT UNDERESTIMATE MY POWER, MORTALS. I WILL CRUSH YOU LIKE A STEAMROLLER SQUASHING A BEETLE. #YINDYNASTY …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-03T13:43:07+00:00","tweet":"Steve Bullock brought Montana commonsense values to the campaign and I’m proud to call him a friend. His track record of creating opportunity in rural America and bridging the partisan divide has made this country stronger.","name":"steve bullock","Sentiment":0.4},{"date":"2019-12-02T15:24:43+00:00","tweet":"He should consider not what he wants to do as a second act after he leaves the term-limited governorship, but what his party and country need him to do: help win control of the Senate. …","name":"steve bullock","Sentiment":0.3333333333},{"date":"2019-12-02T14:59:32+00:00","tweet":"Were you ever aware that Joe Sestak and Steve Bullock were running for president?","name":"steve bullock","Sentiment":0.25},{"date":"2019-12-02T13:23:55+00:00","tweet":"Richard Ojeda Eric Swalwell Mike Gravel John Hickenlooper Jay Inslee Seth Moulton Kirsten Gillibrand Bill DeBlasio Tim Ryan Beto O'Rourke Joe Sestak Steve Bullock Next:","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T11:31:10+00:00","tweet":"Steve Bullock: Gone but not forgotten","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T10:34:05+00:00","tweet":"Now that Steve Bullock has withdrawn his candidacy, the democratic primary field is starting to look pretty sparse","name":"steve bullock","Sentiment":0.2166666667},{"date":"2019-12-02T09:01:16+00:00","tweet":"Thank you to Steve Bullock for running a dignified race, and for bringing your voice and ideas into the national debate. Now that you've stepped aside, do us a favor and run for the Senate. You can DO it.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T08:44:17+00:00","tweet":"Where were all the campaign obituaries for #SteveBullock and #JoeSestak??? Video coming soon to address this.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T08:39:05+00:00","tweet":"Steve Bullock is a true family man and public servant. He has a lot to offer the country - will try my best to bring him to DC with me. 🇺🇸","name":"steve bullock","Sentiment":0.45},{"date":"2019-12-02T08:35:14+00:00","tweet":"Steve Bullock took on dark money in Montana and proved Democrats can win and get things done in a state that voted for Trump by double digits. He brought that determination and spirit to the presidential race and we are a better party for it.","name":"steve bullock","Sentiment":0.2875},{"date":"2019-12-02T08:23:01+00:00","tweet":"Steve Bullock has revealed himself as a man who only cares about himself, not the country. Anyone who doesn’t understand the threat from GOP Senate shouldn’t be in public life. Please go away while the adults try to fix this …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:37:02+00:00","tweet":"Steve Bullock is Exhibit A in how presidential politics are nationalized. A successful two-term governor of a small red state with real accomplishments got no traction in a field of flashier, DC-centric rivals. Today he dropped out. w\/@ByMattStevens …","name":"steve bullock","Sentiment":0.175},{"date":"2019-12-02T07:15:50+00:00","tweet":"New: Montana Gov. Steve Bullock has announced he's suspending his 2020 presidential campaign. His departure leaves 16 candidates vying for the Democratic nomination.","name":"steve bullock","Sentiment":0.1363636364},{"date":"2019-12-02T06:44:05+00:00","tweet":"Gov. Steve Bullock drops out","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:17:37+00:00","tweet":"Montana Gov. Steve Bullock is ending his presidential campaign. The two-term governor had tried to make the case he was the best bet to beat President Donald Trump because he was the only Democratic candidate to win in a state that Trump won in 2016.","name":"steve bullock","Sentiment":0.6},{"date":"2019-12-02T06:10:06+00:00","tweet":"JUST IN: Steve Bullock ends his presidential campaign and will not run for Senate","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-05T12:00:31+00:00","tweet":"Sen. @CoryBooker is on the pod today to share his thoughts on the 2020 race now that Kamala Harris, Joe Sestak, and Steve Bullock have dropped out. Refresher for those desperately trying to keep track of who's still running","name":"steve bullock","Sentiment":-0.6},{"date":"2019-12-04T18:23:09+00:00","tweet":"Democratic candidates who've dropped out: • Steve Bullock • Bill de Blasio • Kirsten Gillibrand • Mike Gravel • Kamala Harris • John Hickenlooper • Jay Inslee • Wayne Messam • Seth Moulton • Richard Ojeda • Beto O'Rourke • Tim Ryan • Joe Sestak • Eric Swalwell","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-03T01:05:06+00:00","tweet":"Montana Gov. Bullock drops out of Democratic Party’s 2020 presidential race","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T15:25:02+00:00","tweet":"Every issue he cares about, be it money in politics or trade or rural broadband or gun violence, will be impossible to address as long as Republicans, led by the self-proclaimed “Grim Reaper,” Sen. Mitch McConnell (Ky.), retain the Senate majority. …","name":"steve bullock","Sentiment":-0.4291666667},{"date":"2019-12-02T11:50:43+00:00","tweet":"Two more 2020 Democratic presidential candidates have dropped out of the race: —Former congressman and admiral Joe Sestak: —Montana Gov. Steve Bullock:","name":"steve bullock","Sentiment":0.5},{"date":"2019-12-02T11:33:03+00:00","tweet":"I am looking for a good guy for constant sex! Call me.. prettylittlewishes Catherine Tate Ken Livingstone Pat Mountain Teddy Sheringham Hugh Grant Nigel Bond The Secret Garden Paul Scholes Spyfall Lukasz plumpton CyberMonday Van Halen Lisa Page Steve Bullock Liz Phair Alanis","name":"steve bullock","Sentiment":0.1},{"date":"2019-12-02T10:36:20+00:00","tweet":"Steve Bullock has suspended his presidential campaign. He's been an excellent Governor of Montana always there for women and he will go on to do great things. Deep appreciation for his leadership at this critical moment. #Election2020","name":"steve bullock","Sentiment":0.45},{"date":"2019-12-02T09:43:59+00:00","tweet":"Pathetic. Steve Bullock was merely an autumn leaf shattering under my boot. He campaigned against dark money, but he should have prepared himself to face the darkness itself. Perhaps my next victim will be more fun to destroy. …","name":"steve bullock","Sentiment":-0.140625},{"date":"2019-12-02T08:01:40+00:00","tweet":"Fun fact. The McConnell-allied Senate Leadership Fund has reported independent expenditures targeting just one candidate this cycle: Steve Bullock …","name":"steve bullock","Sentiment":0.15},{"date":"2019-12-02T07:59:15+00:00","tweet":"2 more bite the dust! Joe Sestak & Steve Bullock drop out of the #2020Election for @TheDemocrats ticket. Don't let the door hit ya when the Good Lord splits ya!","name":"steve bullock","Sentiment":0.75},{"date":"2019-12-02T07:41:13+00:00","tweet":"Steve Bullock: gone but not forgotten","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:53:31+00:00","tweet":"Steve Bullock ends his presidential campaign and will not run for Senate","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:30:08+00:00","tweet":"Gov. Steve Bullock of Montana is ending his presidential campaign. He had argued that his electoral success in a deep red state meant he could take on President Trump.","name":"steve bullock","Sentiment":0.1},{"date":"2019-12-02T06:10:22+00:00","tweet":"Breaking News: Gov. Steve Bullock of Montana, a Democrat who won 2 terms as governor in a red state, dropped out of the presidential race","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:05:11+00:00","tweet":"BREAKING - Democratic presidential candidate Steve Bullock, the two-term governor of Montana, drops out of presidential race after falling short of qualification requirements for multiple debates. An aide says he will not run for the U.S. Senate. @amandawgolden @VaughnHillyard","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:05:07+00:00","tweet":"Bullock is out -- and he's not running for Senate, via @daveweigel …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:04:42+00:00","tweet":"Breaking: Montana Gov. Steve Bullock suspends 2020 campaign","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:03:18+00:00","tweet":"Montana governor Steve Bullock suspends his 2020 campaigns","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:03:08+00:00","tweet":"JUST IN: Montana Gov. Bullock suspends his campaign to be the Democratic Party’s 2020 presidential nominee","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:03:07+00:00","tweet":"Montana Gov. Steve Bullock is quitting the presidential race, and won’t run for Senate. Story here: …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-03T01:55:21+00:00","tweet":"Here’s Montana Gov. Steve Bullock, who dropped out of the race this morning: House Democrats have passed bills that would require paper backups for all votes and deliver $600 million for states to ... via @InfoSecHotSpot","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T20:35:14+00:00","tweet":"Our political system needs more of this and less of the fringe. It’s not thunder-dome winner take all, but thoughtful moderate leaders who can bring this country back to talking to each other. Steve Bullock is still the one I would absolutely love to have a beer with.","name":"steve bullock","Sentiment":0.1385416667},{"date":"2019-12-02T16:01:10+00:00","tweet":"Montana Gov. Steve Bullock ended his presidential bid this morning, leaving 16 Democrats still seeking the nomination","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T15:35:14+00:00","tweet":"Biden's base is ROCK SOLID. Ask Steve Bullock and Tim Ryan. Bloomberg can spend all he wants. This candidate is among the best VP's ever to serve the USA. Not forgotten. He is ready on day one. No training needed! 🇺🇸🇺🇸🇺🇸 …","name":"steve bullock","Sentiment":0.13},{"date":"2019-12-02T14:24:31+00:00","tweet":"Who is Steve Bullock and why isn't the nonpartisan ruling class fabricating support for himin order to maintain healthy rivalry and spirited competition in the presidential race? It's fun though watching an illegal Monopoly have to actually generate competition for a change","name":"steve bullock","Sentiment":0.16},{"date":"2019-12-02T10:42:15+00:00","tweet":"Wake up with determination go to bed with satisfaction. Steve Bullock #CyberMonday","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T10:18:25+00:00","tweet":"Sad to see Steve Bullock drop out.","name":"steve bullock","Sentiment":-0.5},{"date":"2019-12-02T10:09:13+00:00","tweet":"Steve Bullock drops out of the Democratic presidential race …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T09:28:53+00:00","tweet":"Who are Steve Bullock and Joe Sestak?","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T09:15:52+00:00","tweet":"Latest Tweetology for Steve Bullock","name":"steve bullock","Sentiment":0.5},{"date":"2019-12-02T08:28:24+00:00","tweet":"#NEW: Montana Governor Steve Bullock Drops Bid for White House …","name":"steve bullock","Sentiment":0.0681818182},{"date":"2019-12-02T07:34:41+00:00","tweet":"JUST IN: Montana Gov. Steve Bullock drops out of 2020 presidential race.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:20:00+00:00","tweet":"Montana Gov. Steve Bullock announced Monday that he's ending his Democratic presidential campaign, saying it's become clear that he won't have a shot at being his party's nominee.","name":"steve bullock","Sentiment":0.1},{"date":"2019-12-02T07:10:32+00:00","tweet":"Steve Bullock brings his presidential campaign to an end","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:43:24+00:00","tweet":"This is the guy Politico lamented about. According to them, Tulsi Gabbard was on the stage taking his spot. Good luck to neoliberal Steve Bullock. One less candidate trying to suck the air out of the process. …","name":"steve bullock","Sentiment":0.2666666667},{"date":"2019-12-02T06:24:11+00:00","tweet":"\"While there were many obstacles we could not have anticipated when entering this race, it has become clear that in this moment, I won't be able to break through to the top tier of this still-crowded field of candidates,\" Bullock says in a statement. …","name":"steve bullock","Sentiment":0.31},{"date":"2019-12-02T06:02:47+00:00","tweet":"Montana Gov. Steve Bullock announced this morning he is suspending his campaign for president amid fundraising struggles and a repeated inability to qualify for the debate stage …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T15:10:22+00:00","tweet":"Feel like pure shit I just want Steve Bullock governor of Montana back in the presidential race x","name":"steve bullock","Sentiment":0.0047619048},{"date":"2019-12-02T13:42:54+00:00","tweet":"fantastic! fingers crossed RT @lyew_neil: RT @amyklobuchar: Steve Bullock took on dark money in Montana and proved Democrats can win and get things done in a state that voted for Tr…","name":"steve bullock","Sentiment":0.3833333333},{"date":"2019-12-02T12:02:59+00:00","tweet":"We loved working with Steve Bullock - the red state governor with a progressive record, who led the field in dad jokes. It has been an honor to be a part of his team.","name":"steve bullock","Sentiment":0.35},{"date":"2019-12-02T11:20:15+00:00","tweet":"I really enjoyed getting to know Steve Bullock and greatly appreciated his voice in this campaign. He was on my short list because of his many achievements as governor and because he is so thoughtful in his approach. Thank your for your leadership, @GovernorBullock! …","name":"steve bullock","Sentiment":0.34},{"date":"2019-12-02T10:40:23+00:00","tweet":"The most important thing is to enjoy your life. Steve Bullock #CyberMonday","name":"steve bullock","Sentiment":0.4333333333},{"date":"2019-12-02T09:43:09+00:00","tweet":"Gov. Steve Bullock (D-MT) suspends campaign for President. Bad year for D Governors, unless Ex-Gov. Deval Patrick of Massachusetts—the most recent candidate—surprises.","name":"steve bullock","Sentiment":-0.0666666667},{"date":"2019-12-02T08:15:55+00:00","tweet":"Steve Bullock Drops Out of 2020 Presidential Race","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T08:09:52+00:00","tweet":"Montana Gov. Steve Bullock Quits Presidential Race","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T08:05:19+00:00","tweet":"I think it is great that Steve Bullock dropped out #cleartheway","name":"steve bullock","Sentiment":0.8},{"date":"2019-12-02T07:56:37+00:00","tweet":"In a blow to what’s perhaps Democrats’ best\/only chance to win the Montana Senate seat next year, Steve Bullock’s spokeswoman says that while he intends to work for Democrats in 2020 in his capacity as Montana gov & a “senior Democrat,” it’s “not as a candidate for U.S. Senate.”","name":"steve bullock","Sentiment":0.4},{"date":"2019-12-02T07:49:01+00:00","tweet":"Democrat Steve Bullock ends struggling presidential campaign …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:42:49+00:00","tweet":"Today, Steve Bullock dropped out of the race for president. His voice will be sorely missed.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:09:14+00:00","tweet":"Latest Tweetology for Steve Bullock","name":"steve bullock","Sentiment":0.5},{"date":"2019-12-02T06:28:39+00:00","tweet":"This has been said before but it applies to him as well: \"BREAKING: Steve Bullock was running for president!\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:23:12+00:00","tweet":"Now that Steve Bullock just dropped out of the race, there still are 16 candidates in the race for the 2020 Democratic Presidential Nomination.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-01T16:08:49+00:00","tweet":"Montana governor and presidential candidate Steve Bullock just chillin","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-01T15:55:38+00:00","tweet":"If we can kick Dark Money out of Montana's elections, we can do it across the country. Join us:","name":"steve bullock","Sentiment":-0.15},{"date":"2019-12-02T10:49:43+00:00","tweet":"Raise your hand if you had no idea that Steve Bullock was a candidate for POTUS. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T10:16:49+00:00","tweet":".@governorbullock is a terrific Governor, a deeply committed public servant and a great guy. Any debate process that excluded him - a sitting, successful, two term Democratic governor in a Trump state - from the stage is flawed by definition. …","name":"steve bullock","Sentiment":0.175},{"date":"2019-12-02T09:10:28+00:00","tweet":"who the fuck is steve bullock","name":"steve bullock","Sentiment":-0.4},{"date":"2019-12-02T08:37:11+00:00","tweet":"Democrat Steve Bullock ends struggling presidential campaign …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T08:14:05+00:00","tweet":"Montana Gov. Bullock drops out of 2020 presidential race.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:46:06+00:00","tweet":"Latest: Now that he's dropped out of the 2020 Democratic Presidential Primary, Steve #Bullock 's office says he will not run for Senate","name":"steve bullock","Sentiment":0.45},{"date":"2019-12-02T07:30:59+00:00","tweet":"I'm not even sure that Steve Bullock knew that Steve Bullock was running for president.","name":"steve bullock","Sentiment":0.5},{"date":"2019-12-02T07:16:21+00:00","tweet":"HAPPENING NOW: Gov. Steve Bullock ends presidential campaign and will not run for U.S. Senate …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:01:55+00:00","tweet":"Montana’s @GovernorBullock has dropped out of the race for President of the United States. “It has become clear that in this moment, I won’t be able to break through to the top tier of this still-crowded field of candidates,” Bullock said in a statement. …","name":"steve bullock","Sentiment":0.3666666667},{"date":"2019-12-02T06:04:44+00:00","tweet":"BREAKING: Steve Bullock drops out of Democratic presidential race …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-01T23:10:52+00:00","tweet":"Michael Bennet, Steve Bullock, and Marianne Williamson struggle to get 1% in most polls. At what point will they acknowledge reality and finally drop out?","name":"steve bullock","Sentiment":0.25},{"date":"2019-11-28T00:14:57+00:00","tweet":"Steve Bullock (D, MT) \/ Mikie Sherrill (D, NJ)","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-27T21:10:00+00:00","tweet":"Here’s my plan: Double federal investment in K-12 Oppose vouchers and the privatization of public schools Remove Betsy DeVos …","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-27T17:06:58+00:00","tweet":"We should probably include a Michael Bennet or Steve Bullock supporter too, to round things out a bit Our common goal is to overcome the influence of the corporate media","name":"steve bullock","Sentiment":-0.1666666667},{"date":"2019-12-02T08:19:21+00:00","tweet":"Steve Bullock drops out of presidential race. …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T08:10:57+00:00","tweet":"Steve Bullock is trending because he is suspending his presidential run but I honestly had no fucking idea he was running.","name":"steve bullock","Sentiment":0.45},{"date":"2019-12-02T07:58:00+00:00","tweet":"Steve Bullock finally dropped out of the race. Any chance of being nominated ended in July when he said: “I'm not going to support any plan that rips away quality health care form individuals. This is an example of wish-list economics,” Womp Womp!","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:42:49+00:00","tweet":"It's easy to forget that Steve Bullock was running for president, especially since he isn't now. (Yet Delaney is still running.)","name":"steve bullock","Sentiment":0.2166666667},{"date":"2019-12-02T07:37:52+00:00","tweet":"Not a huge fan of his policies but Steve Bullock was, in winning three times in a red state, what Joe Biden and Pete Buttigieg pretend to be","name":"steve bullock","Sentiment":0.1},{"date":"2019-12-02T06:45:14+00:00","tweet":"Montana Gov. Steve Bullock announced Monday that he's ending his Democratic presidential campaign, saying it's become clear that he won't have a shot at being his party's nominee:","name":"steve bullock","Sentiment":0.1},{"date":"2019-12-02T06:42:08+00:00","tweet":"The Democratic field of presidential candidates is down by one.","name":"steve bullock","Sentiment":-0.1555555556},{"date":"2019-12-02T06:30:48+00:00","tweet":"Democrat Steve Bullock ends struggling presidential campaign …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:26:36+00:00","tweet":"JUST IN: Montana Gov. #SteveBullock drops out of 2020 presidential race","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:05:03+00:00","tweet":"Steve Bullock is out of the race, and he won't run for Senate -- …","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-29T12:49:06+00:00","tweet":"That Politico article about Obama suggested he was genuinely impressed by Steve Bullock. It's only one of many parallel examples but that's the kind of thinking we're dealing with here.","name":"steve bullock","Sentiment":0.42},{"date":"2019-12-02T07:33:40+00:00","tweet":"Montana Governor Steve Bullock announced Monday that he is no longer running for president.","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:23:36+00:00","tweet":"Democrat Steve Bullock ends struggling presidential campaign …","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T07:05:16+00:00","tweet":"Joe Sestack, Rick Mosley, and Steve Bullock all dropped out of the presidential race. Actually, two of them did and one of those names is made up, but you aren’t sure which one.","name":"steve bullock","Sentiment":0.25},{"date":"2019-12-02T06:23:28+00:00","tweet":"Steve Bullock ends his presidential campaign and will not run for Senate","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-02T06:16:25+00:00","tweet":"#Elections2020 Democrat Steve Bullock drops out of primary race: …","name":"steve bullock","Sentiment":0.4},{"date":"2019-12-02T06:11:33+00:00","tweet":"Montana Gov. Steve Bullock drops out of presidential race","name":"steve bullock","Sentiment":0.0},{"date":"2019-12-01T21:09:37+00:00","tweet":"Is it just me or is Steve Bullock really testing the sunk cost fallacy? It sounds like he should just drop out if it’s this dire.","name":"steve bullock","Sentiment":0.2},{"date":"2019-11-11T17:29:03+00:00","tweet":"Kind of think Cory Booker or Amy Klobuchar or Steve Bullock should float to the NYT that they're considering a last-minute entry into the presidential race just so they'll get more attention that way.","name":"steve bullock","Sentiment":0.55},{"date":"2019-11-09T17:15:23+00:00","tweet":"Steve Bullock (D, MT) \/ Steve Bullock (D, MT)","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-08T09:51:02+00:00","tweet":"Steve Bullock TikToks are exactly what you’d expect.","name":"steve bullock","Sentiment":0.25},{"date":"2019-11-07T12:45:00+00:00","tweet":"\"If Democrats want to win they should nominate Montana Governor Steve Bullock\" - Larry Sabato. …","name":"steve bullock","Sentiment":0.8},{"date":"2019-11-05T11:59:21+00:00","tweet":"The DNC is an all-powerful election rigging cabal that also can’t convince Steve Bullock that being a senator would be more fun than polling at 0.5% in iowa.","name":"steve bullock","Sentiment":0.4},{"date":"2019-11-04T08:30:21+00:00","tweet":"Steve Bullock won three statewide elections in Montana, appears to be at full cognitive capacity, no children involved in sleazy Ukraine dealings, looks straight out of central casting... and his candidacy has still essentially been negated. Must wake up daily and be like, WTF","name":"steve bullock","Sentiment":0.0083333333},{"date":"2019-11-02T22:12:59+00:00","tweet":"I'm not seeing Steve Bullock as a president I'm sorry …","name":"steve bullock","Sentiment":-0.5},{"date":"2019-11-02T11:24:28+00:00","tweet":"Gov. Steve Bullock speaks in Des Moines, Iowa: \"When we take on Rudy Giuliani, Lindsey Graham, Joni Ernst, and all that corruption in Washington, DC, we're going to give Trump the boot.\"","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-02T00:25:10+00:00","tweet":"Does Steve Bullock know there's a competitive Senate seat that we need in Montana in 2020? Asking for an everyone. #LJ19","name":"steve bullock","Sentiment":0.0},{"date":"2019-11-01T23:15:09+00:00","tweet":"My November Tiers S: Andrew Yang A: Bernie Sanders B: Tulsi Gabbard Elizabeth Warren Cory Booker Marianne Williamson Julian Castro C: Tom Steyer Michael Bennet Pete Buttigieg Amy Klobuchar Joe Sestak Kamala Harris Joe Biden Wayne Messam Steve Bullock D: John Delaney F: None","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-31T11:34:09+00:00","tweet":"Steve Bullock calls for putting Giuliani \"behind bars\"","name":"steve bullock","Sentiment":-0.4},{"date":"2019-10-31T09:02:25+00:00","tweet":"Steve Bullock tricked Anthony Scaramucci into sorta endorsing him because 2019 …","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-28T15:20:32+00:00","tweet":"In 2019, Montana Governor Steve Bullock signed Hanna's Act. The law requires the Department of Justice to investigate missing & murdered indigenous people, oversee data collection, liaise with families & work with other state & federal agencies","name":"steve bullock","Sentiment":-0.1625},{"date":"2019-10-25T22:10:37+00:00","tweet":"Wow. Steve Bullock is really pissed off about what happened with Jay Inslee. …","name":"steve bullock","Sentiment":0.15},{"date":"2019-10-25T09:00:12+00:00","tweet":"I spent some time in Montana and Iowa with Steve Bullock, the 2-term governor who won in a Trump landslide state and passed Medicaid expansion through a Republican legislature. His stillborn presidential campaign tells us a lot about the Democrats in 2019. …","name":"steve bullock","Sentiment":-0.1},{"date":"2019-10-25T07:00:10+00:00","tweet":"Steve Bullock was supposed to be the key to unlocking Trump voters. Here’s why he thinks he still has a chance.","name":"steve bullock","Sentiment":0.0},{"date":"2019-10-18T16:33:14+00:00","tweet":"Memo to Tom Perez: Don't you feel proud that you made room on the debate stage for Tulsi Gabbard who just called the 2016 nominee, \"the queen of warmongers, embodiment of corruption\"? But your rigid, cockamamie debate rules exiled Steve Bullock and Michael Bennet. Great going.","name":"steve bullock","Sentiment":0.8},{"date":"2019-10-17T22:42:49+00:00","tweet":"Gov. Steve Bullock at 4%—ahead of Booker, Steyer, Harris, Klobuchar, etc.—with no access to recent debates or a big ad campaign is stunning. …","name":"steve bullock","Sentiment":0.1666666667},{"date":"2019-10-17T12:05:49+00:00","tweet":"2020 candidate Gov. Steve Bullock now says that President Trump should be removed from office. “Whether he's removed at the ballot box or through an impeachment proceeding, we’ve got to recognize the next person that comes in has to be able to deal with those great divides.”","name":"steve bullock","Sentiment":0.4333333333},{"date":"2019-10-15T20:50:25+00:00","tweet":"Tom Steyer is no Steve Bullock. I know Steve Bullock. Steve should be on this stage. Not Tom.","name":"steve bullock","Sentiment":0.0}]