{"0":{"date":"2019-12-05 19:32:28","tweet":"Steve Bullock exits: Will conservative Democrats follow? …","Sentiment":0.0},"1":{"date":"2019-12-05 19:29:05","tweet":"Gov. Steve Bullock heard a smorgasbord of concerns Thursday from the group tasked with creating a long-term vision for managing Montana’s grizzlies. …","Sentiment":0.0},"2":{"date":"2019-12-05 19:20:06","tweet":"Gov. Steve Bullock heard a smorgasbord of concerns Thursday from the group tasked with creating a long-term vision for managing Montana’s grizzlies. …","Sentiment":0.0},"3":{"date":"2019-12-05 18:55:32","tweet":"#AmyKlobuchar endorsed by former Steve Bullock supporter … #Klobuchar2020","Sentiment":0.0},"4":{"date":"2019-12-05 18:38:42","tweet":"New column is up. \"So how many times must Steve Bullock say, “No” before Montanans respect his decision?\" #mtpol @GovernorBullock …","Sentiment":0.3181818182},"5":{"date":"2019-12-05 18:02:56","tweet":"Last night I was trying to come up with a joke about Montana governor steve bullock as tony stark w the other avengers mourning him and despite never speaking it out loud or attempting to type it out, Twitter suggested this","Sentiment":-0.05625},"6":{"date":"2019-12-05 17:51:00","tweet":"Steve Bullock exits: Will conservative Democrats follow? Read the full story:","Sentiment":0.35},"7":{"date":"2019-12-05 17:11:41","tweet":"Based on a weighted average, the optimum age is 53.5. That makes Steve Bullock the winner, who sadly dropped out 3 days ago. So Booker it is.","Sentiment":0.0166666667},"8":{"date":"2019-12-05 15:58:04","tweet":"The most reasonable candidates from the left, to me, are exactly the ones who perform the worst in the Dem polls. Steve Bullock for example. I’m troubled by Trump and his incompetency, but Dems succeed in looking worse!","Sentiment":-0.15},"9":{"date":"2019-12-05 15:40:28","tweet":"today i am announcing that i am dropping out of 2020 presidential race. sick of the mainstream media. they didn't give me, kamala harris, steve bullock, joe sestak, beto o'rourke, tim ryan, mayor bill de blasio, kristen gillibrand, seth moulton, or john hickenlopper a chance.","Sentiment":-0.7142857143},"10":{"date":"2019-12-05 14:54:48","tweet":"But she did note that she has hired staffers from other Democratic presidential candidates who have dropped out of the race, including Governor Steve Bullock & former Congressman Beto O’Rourke as her campaign opens more offices here in Iowa. @FoxNewsMMR …","Sentiment":0.125},"11":{"date":"2019-12-05 14:43:07","tweet":"What’s a “Steve Bullock?”","Sentiment":0.0},"12":{"date":"2019-12-05 14:32:47","tweet":"This is complete bullshit! As an ardent Steve Bullock supporter, I can tell you HE WAS NOT A CONSERVATIVE! He was a moderate, problem solver. This opinion piece is just a pretense for a GOP author to push conservatives out of the Democratic Party. Don’t bring Steve into it!","Sentiment":0.078125},"13":{"date":"2019-12-05 14:28:28","tweet":"The Hill on Twitter: \"\"Steve Bullock exits: Will conservative Democrats follow?\" (via @TheHillOpinion) \" \/ Twitter - …","Sentiment":0.0},"14":{"date":"2019-12-05 14:28:07","tweet":"\"Steve Bullock exits: Will conservative Democrats follow?\" (via @TheHillOpinion)","Sentiment":0.0},"15":{"date":"2019-12-05 14:08:37","tweet":"After hearing the news that former “Late Show” guests Kamala Harris and Steve Bullock have dropped out of the race for the Democratic nomination, Stephen Colbert wonders if there are sinister forces at play. …","Sentiment":-0.2666666667},"16":{"date":"2019-12-05 14:06:16","tweet":"Steve Bullock exits: Will conservative Democrats follow? …","Sentiment":0.0},"17":{"date":"2019-12-05 13:49:56","tweet":"I’m far outside of the zeitgeist when it comes to the democratic primary. My preferred candidates were Jay Inslee and Steve Bullock. But my true preference is for sane people to stop insulting the current candidates while a madman occupies the White House.","Sentiment":-0.0214285714},"18":{"date":"2019-12-05 12:00:31","tweet":"Sen. @CoryBooker is on the pod today to share his thoughts on the 2020 race now that Kamala Harris, Joe Sestak, and Steve Bullock have dropped out. Refresher for those desperately trying to keep track of who's still running","Sentiment":-0.6},"19":{"date":"2019-12-05 11:41:05","tweet":"Steve Bullock is now out of the race. I am replacing him with Julian Castro in my list of top five presidential candidates. 1. Elizabeth Warren 2. Bernie Sanders 3. Tom Steyer 4. Cory Booker 5. Julian Castro","Sentiment":0.5}}