{"0":{"date":"2019-12-05 20:01:19","tweet":"*the other","Sentiment":-0.125},"1":{"date":"2019-12-05 20:01:07","tweet":"#TomBillionaireLoser Tom Steyer Is Willing To Donate $40 Million Just To See President Trump Impeached From Office - Theredpillednews …","Sentiment":0.25},"2":{"date":"2019-12-05 20:00:34","tweet":"Well I call on Democrats to have in-depth discussions rather than \"#debates.\" (Ludicrous to tag those soundbite generators with that word.) Roundtable discussion, different issue – wealth disparity, climate, immigration, health care – each night. Show how you work together.","Sentiment":0.0},"3":{"date":"2019-12-05 19:59:32","tweet":"Baby Yoda gets more social media interactions than 2020 Democratic candidates🤣 ⁦@JoeBiden⁩ ⁦@ewarren⁩ ⁦@BernieSanders⁩ ⁦@amyklobuchar⁩ ⁦@MikeBloomberg⁩ ⁦@CoryBooker⁩ ⁦⁦@TulsiGabbard⁩ ⁦@TomSteyer⁩ …","Sentiment":0.2666666667},"4":{"date":"2019-12-05 19:57:55","tweet":"@TomSteyer how do you plan on getting Congress to pass a term limits bill? You know that neither the House not the Senate will pass that proposition with out getting something in return.","Sentiment":0.0},"5":{"date":"2019-12-05 19:56:56","tweet":"I love your energy please make Bernard your 2nd choice.","Sentiment":0.25},"6":{"date":"2019-12-05 19:56:34","tweet":"Hmm I wonder if your billions of dollars have anything to do with it 🤣","Sentiment":0.0},"7":{"date":"2019-12-05 19:55:59","tweet":"Thank god, I hope you are right.","Sentiment":0.2857142857},"8":{"date":"2019-12-05 19:55:28","tweet":"Tom Steyer can spend a whole lot of ad money, but at the end of the day, people are actually giving him money. Crazy","Sentiment":-0.1333333333},"9":{"date":"2019-12-05 19:54:51","tweet":"It makes me wounder about Tom Steyer?","Sentiment":0.0},"10":{"date":"2019-12-05 19:54:38","tweet":"Tabling with @TomSteyer for @TomSteyer at Hawk the Vote’s Meet your Campaign event. Thanks @VoteHawk for giving students the chance to learn about #TeamTom ! #IACaucus #youthVote – at Iowa Memorial Union","Sentiment":0.25},"11":{"date":"2019-12-05 19:53:32","tweet":"Mr. Steyer with all due respect, please get behind Andrew Yang, and help this country move forward!","Sentiment":-0.3125},"12":{"date":"2019-12-05 19:52:44","tweet":"@VLongobardo @HoarseWisperer @tedlieu @tribelaw @TomSteyer @DearAuntCrabby @GeneForTexas @docrocktex26 @TeaPainUSA @mmpadellan #TheResistance #ImpeachAndRemove I've heard her say that many times and she means it. She absolutely did not want to impeach him. …","Sentiment":0.35},"13":{"date":"2019-12-05 19:52:42","tweet":"Steyer Campaign! @TomSteyer","Sentiment":0.0},"14":{"date":"2019-12-05 19:51:15","tweet":"Bloomberg and\/or @TomSteyer need to buy #Foxnews ASAP","Sentiment":0.0},"15":{"date":"2019-12-05 19:49:40","tweet":"fuck you and your ads. let me watch my show in peace @TomSteyer","Sentiment":-0.4},"16":{"date":"2019-12-05 19:49:11","tweet":"@TomSteyer We can't save the world if Mitch McConnell gets re-elected for six more years in 2020.","Sentiment":0.5},"17":{"date":"2019-12-05 19:48:46","tweet":"The Mike Bloomberg and Tom Steyer commercials are annoying. #Hardball","Sentiment":-0.8},"18":{"date":"2019-12-05 19:48:20","tweet":"Agreed. He has used his wealth in positive ways. His candidacy did seem like “rich white guy runs for president,” which may just be poor timing. He clearly wanted to try to advance climate crisis reversal.","Sentiment":0.0604545455},"19":{"date":"2019-12-05 19:48:19","tweet":"@TomSteyer - Tom, here is a list of the twenty-two Republican Senators we need to vote out of office. There are four GOP leaders running for reelection: McConnell Lindsey Graham John Cornyn Joni Ernst","Sentiment":0.0}}