{"0":{"date":"2019-12-05 20:01:37","tweet":"Brooks did that in 2016 by shaming Green supporters. Instead of making an argument to earn the votes of the 100 million people that didn't vote because they didn't like Hillary or Trump... Go after Greens... Logic, right?","Sentiment":0.0428571429},"1":{"date":"2019-12-05 20:01:33","tweet":"Hood, he should be there. Tulsi Gabbard-vitch, should not. …","Sentiment":0.0},"2":{"date":"2019-12-05 20:01:32","tweet":"I dont like Tulsi Gabbard but.....I mean I wouldnt say no. 🤷‍️🤷‍️","Sentiment":-0.3125},"3":{"date":"2019-12-05 20:01:16","tweet":"Hawaiian ninja who loves rolling with white Nationalist: Tucker, Hannity, Ingrams, and Bretibart. Black folk have nothing for her token end.","Sentiment":-0.0833333333},"4":{"date":"2019-12-05 20:01:06","tweet":"Am sure Tulsi Gabbard would lay waste to Joe Biden in a push up contest as well #TulsiGabbard #Tulsi2020 #twitch #2020Election #Election2020 #NoMalarkeyBusTour","Sentiment":0.15},"5":{"date":"2019-12-05 20:00:32","tweet":"Tulsi Gabbard for President \"My personal commitment is to always treat you and all Americans with respect. Working side-by-side, we can defeat the divisiveness of Donald Trump, and usher in a 21st century of peace,... …","Sentiment":0.0},"6":{"date":"2019-12-05 20:00:19","tweet":"I never said people won't unite behind anyone else, stupid conflation of my words. Bernie will unite the left. Clinton united the centrists. Tulsi is the only candidate I have ever seen run who can pull from all parties, left, center and right. That is truly uniting the country.","Sentiment":-0.1448979592},"7":{"date":"2019-12-05 20:00:17","tweet":"Merry Christmas Mr. President . And Merry Christmas soon to be Madam President @TulsiGabbard","Sentiment":0.0},"8":{"date":"2019-12-05 19:59:42","tweet":"Holy smokes! This is incredible!!","Sentiment":1.0},"9":{"date":"2019-12-05 19:59:32","tweet":"Baby Yoda gets more social media interactions than 2020 Democratic candidates🤣 ⁦@JoeBiden⁩ ⁦@ewarren⁩ ⁦@BernieSanders⁩ ⁦@amyklobuchar⁩ ⁦@MikeBloomberg⁩ ⁦@CoryBooker⁩ ⁦⁦@TulsiGabbard⁩ ⁦@TomSteyer⁩ …","Sentiment":0.2666666667},"10":{"date":"2019-12-05 19:59:31","tweet":".@TulsiGabbard: Trump's offering to place our military assets under the command of a foreign country—Saudi Arabia—is a disgrace and betrayal of my patriotic brothers and sisters in uniform and to our Constitution. We are not your prostitutes. You are not our pimp. (Sep. 16, 2019)","Sentiment":-0.1125},"11":{"date":"2019-12-05 19:58:27","tweet":"I could get behind or on the Foreign Affairs the green new deal and the medicare for all is a game stopper.","Sentiment":-0.1977272727},"12":{"date":"2019-12-05 19:58:27","tweet":"If her or Sanders isn't the nominee. I'll stay home election day","Sentiment":0.0},"13":{"date":"2019-12-05 19:57:27","tweet":"Sanders has not opposed sanctions on Venezuela. Find me a link? Id be glad to learn that he has. But he hasnt. He has also not said he would pardon assange. He hasnt even offered a word of support to Assange.","Sentiment":0.5},"14":{"date":"2019-12-05 19:57:05","tweet":"fully agree","Sentiment":0.0},"15":{"date":"2019-12-05 19:56:30","tweet":"He wouldn't stand a chance, but you can't be polling sub1% at this point and have a realistic shot. Her best bet is to pick someone she likes and try to go for a VP pick. Bernie\/Tulsi would be one hell of a ticket.","Sentiment":0.5833333333},"16":{"date":"2019-12-05 19:56:13","tweet":"Marianne Williamson is a sweet soul with a lot of love in her heart.","Sentiment":0.425},"17":{"date":"2019-12-05 19:55:56","tweet":"Ah, the perennial shrill problem! Somehow Tulsi Gabbard does well and I'm trying to figure out what she does. I ran into Women's Leadership Lab in Chicago, talking abt how females apoligize for strengths, e.g. \"yeah thanks for ssying the dress looks great. I got it on sale\".","Sentiment":0.1666666667},"18":{"date":"2019-12-05 19:55:43","tweet":"So @MSNBC, Bloomberg just buys his way onto your debate and @TulsiGabbard and @AndrewYang have to follow your shifty rules. You call that fair and unbiased?","Sentiment":0.7},"19":{"date":"2019-12-05 19:55:38","tweet":"Hey @TulsiGabbard, what will it take for you to politely take a hike.","Sentiment":0.0}}